iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/IMXRT685_RAM_GCC/targetInit/iMXRT685_sfr.h
};

#define NVIC (*(volatile struct NVIC_tag *) 0xe000e100)

struct SIG_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTID:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STIR;

};

#define SIG (*(volatile struct SIG_tag *) 0xe000ef00)

struct SAU_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENABLE:1;
      uint64_t ALLNS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SAU_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SREGION:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SAU_TYPE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REGION:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SAU_RNR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:5;
      uint64_t BADDR:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SAU_RBAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENABLE:1;
      uint64_t NSC:1;
      uint64_t reservedSpace0:3;
      uint64_t LADDR:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SAU_RLAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INVEP:1;
      uint64_t INVIS:1;
      uint64_t INVER:1;
      uint64_t AUVIOL:1;
      uint64_t INVTRAN:1;
      uint64_t LSPERR:1;
      uint64_t SFARVALID:1;
      uint64_t LSERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDRESS:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFAR;

};

#define SAU (*(volatile struct SAU_tag *) 0xe000edd0)

struct RSTCTL0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t VDD_POR:1;
      uint64_t reservedSpace0:3;
      uint64_t PAD_RESET:1;
      uint64_t ARM_APD_RESET:1;
      uint64_t WDT0_RESET:1;
      uint64_t WDT1_RESET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSRSTSTAT;

  uint8_t res0[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t HIFI_DSP:1;
      uint64_t reservedSpace1:6;
      uint64_t POWERQUAD_bitfield:1;
      uint64_t CASPER_bitfield:1;
      uint64_t HASHCRYPT_bitfield:1;
      uint64_t PUF_bitfield:1;
      uint64_t RNG:1;
      uint64_t reservedSpace2:3;
      uint64_t FLEXSPI_OTFAD:1;
      uint64_t reservedSpace3:3;
      uint64_t USBHS_PHY:1;
      uint64_t USBHS_DEVICE:1;
      uint64_t USBHS_HOST:1;
      uint64_t USBHS_SRAM:1;
      uint64_t SCT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRSTCTL0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t SDIO0:1;
      uint64_t SDIO1:1;
      uint64_t reservedSpace1:11;
      uint64_t ACMP0:1;
      uint64_t ADC0_bitfield:1;
      uint64_t reservedSpace2:7;
      uint64_t SHSGPIO0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRSTCTL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UTICK0_bitfield:1;
      uint64_t WWDT0_bitfield:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRSTCTL2;

  uint8_t res1[36];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t HIFI_DSP:1;
      uint64_t reservedSpace1:6;
      uint64_t POWERQUAD_bitfield:1;
      uint64_t CASPER_bitfield:1;
      uint64_t HASHCRYPT_bitfield:1;
      uint64_t PUF_bitfield:1;
      uint64_t RNG:1;
      uint64_t reservedSpace2:3;
      uint64_t FLEXSPI_OTFAD:1;
      uint64_t reservedSpace3:3;
      uint64_t USBHS_PHY:1;
      uint64_t USBHS_DEVICE:1;
      uint64_t USBHS_HOST:1;
      uint64_t USBHS_SRAM:1;
      uint64_t SCT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRSTCTL0_SET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t SDIO0:1;
      uint64_t SDIO1:1;
      uint64_t reservedSpace1:11;
      uint64_t ACMP0:1;
      uint64_t ADC0_bitfield:1;
      uint64_t reservedSpace2:7;
      uint64_t SHSGPIO0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRSTCTL1_SET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UTICK0_bitfield:1;
      uint64_t WWDT0_bitfield:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRSTCTL2_SET;

  uint8_t res2[36];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t HIFI_DSP:1;
      uint64_t reservedSpace1:6;
      uint64_t POWERQUAD_bitfield:1;
      uint64_t CASPER_bitfield:1;
      uint64_t HASHCRYPT_bitfield:1;
      uint64_t PUF_bitfield:1;
      uint64_t RNG:1;
      uint64_t reservedSpace2:3;
      uint64_t FLEXSPI_OTFAD:1;
      uint64_t reservedSpace3:3;
      uint64_t USBHS_PHY:1;
      uint64_t USBHS_DEVICE:1;
      uint64_t USBHS_HOST:1;
      uint64_t USBHS_SRAM:1;
      uint64_t SCT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRSTCTL0_CLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t SDIO0:1;
      uint64_t SDIO1:1;
      uint64_t reservedSpace1:11;
      uint64_t ACMP0:1;
      uint64_t ADC0_bitfield:1;
      uint64_t reservedSpace2:7;
      uint64_t SHSGPIO0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRSTCTL1_CLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UTICK0_bitfield:1;
      uint64_t WWDT0_bitfield:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRSTCTL2_CLR;

};

#define RSTCTL0 (*(volatile struct RSTCTL0_tag *) 0x40000000)

struct CLKCTL0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t ROM_CTL_128KB:1;
      uint64_t reservedSpace1:5;
      uint64_t POWERQUAD_CLK:1;
      uint64_t CASPER_CLK:1;
      uint64_t HASHCRYPT_CLK:1;
      uint64_t PUF_CLK:1;
      uint64_t RNG_CLK:1;
      uint64_t reservedSpace2:3;
      uint64_t FLEXSPI_OTFAD_CLK:1;
      uint64_t OTP_CLK:1;
      uint64_t reservedSpace3:2;
      uint64_t USBHS_PHY_CLK:1;
      uint64_t USBHS_DEVICE_CLK:1;
      uint64_t USBHS_HOST_CLK:1;
      uint64_t USBHS_SRAM_CLK:1;
      uint64_t SCT_CLK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PSCCTL0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t SDIO0_CLK:1;
      uint64_t SDIO1_CLK:1;
      uint64_t reservedSpace1:11;
      uint64_t ACMP0_CLK:1;
      uint64_t ADC0_CLK:1;
      uint64_t reservedSpace2:7;
      uint64_t SHSGPIO0_CLK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PSCCTL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UTICK0_CLK:1;
      uint64_t WWDT0_CLK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PSCCTL2;

