iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/IMXRT685_RAM_GCC/targetInit/iMXRT685_sfr.h
  uint8_t res0[36];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t ROM_CTL_128KB_CLK:1;
      uint64_t reservedSpace1:5;
      uint64_t POWERQUAD_CLK:1;
      uint64_t CASPER_CLK:1;
      uint64_t HASHCRYPT_CLK:1;
      uint64_t PUF_CLK:1;
      uint64_t RNG_CLK:1;
      uint64_t reservedSpace2:3;
      uint64_t FLEXSPI_OTFAD_CLK:1;
      uint64_t OTP_CLK:1;
      uint64_t reservedSpace3:2;
      uint64_t USBHS_PHY_CLK:1;
      uint64_t USBHS_DEVICE_CLK:1;
      uint64_t USBHS_HOST_CLK:1;
      uint64_t USBHS_SRAM_CLK:1;
      uint64_t SCT_CLK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PSCCTL0_SET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t SDIO0_CLK:1;
      uint64_t SDIO1_CLK:1;
      uint64_t reservedSpace1:11;
      uint64_t ACMP0_CLK:1;
      uint64_t ADC0_CLK:1;
      uint64_t reservedSpace2:7;
      uint64_t SHSGPIO0_CLK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PSCCTL1_SET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UTICK0_CLK:1;
      uint64_t WWDT0_CLK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PSCCTL2_SET;

  uint8_t res1[36];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t ROM_CTL_128KB_CLK:1;
      uint64_t reservedSpace1:5;
      uint64_t POWERQUAD_CLK:1;
      uint64_t CASPER_CLK:1;
      uint64_t HASHCRYPT_CLK:1;
      uint64_t PUF_CLK:1;
      uint64_t RNG_CLK:1;
      uint64_t reservedSpace2:3;
      uint64_t FLEXSPI_OTFAD_CLK:1;
      uint64_t OTP_CLK:1;
      uint64_t reservedSpace3:2;
      uint64_t USBHS_PHY_CLK:1;
      uint64_t USBHS_DEVICE_CLK:1;
      uint64_t USBHS_HOST_CLK:1;
      uint64_t USBHS_SRAM_CLK:1;
      uint64_t SCT_CLK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PSCCTL0_CLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t SDIO0_CLK:1;
      uint64_t SDIO1_CLK:1;
      uint64_t reservedSpace1:11;
      uint64_t ACMP0_CLK:1;
      uint64_t ADC0_CLK:1;
      uint64_t reservedSpace2:7;
      uint64_t SHSGPIO0_CLK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PSCCTL1_CLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UTICK0_CLK:1;
      uint64_t WWDT0_CLK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PSCCTL2_CLR;

  uint8_t res2[132];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRIM_TEMPCO:5;
      uint64_t TRIM_COARSE:6;
      uint64_t TRIM_FINE:7;
      uint64_t TRIM_RANGE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FFROCTL0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UPDATE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FFROCTL1;

  uint8_t res3[88];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LP_ENABLE:1;
      uint64_t BYPASS_ENABLE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSOSCCTL0;

  uint8_t res4[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSOSCBYPASS;

  uint8_t res5[36];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:31;
      uint64_t CLKRDY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LPOSCCTL0;

  uint8_t res6[44];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENA32KHZ:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OSC32KHZCTL0;

  uint8_t res7[60];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSPLL0CLKSEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BYPASS:1;
      uint64_t RESET:1;
      uint64_t reservedSpace0:11;
      uint64_t HOLDRINGOFF_ENA:1;
      uint64_t reservedSpace1:2;
      uint64_t MULT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSPLL0CTL0;

  uint8_t res8[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKTIMEDIV2:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSPLL0LOCKTIMEDIV2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NUM:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSPLL0NUM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DENOM:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSPLL0DENOM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PFD0:6;
      uint64_t PFD0_CLKRDY:1;
      uint64_t PFD0_CLKGATE:1;
      uint64_t PFD1:6;
      uint64_t PFD1_CLKRDY:1;
      uint64_t PFD1_CLKGATE:1;
      uint64_t PFD2:6;
      uint64_t PFD2_CLKRDY:1;
      uint64_t PFD2_CLKGATE:1;
      uint64_t PFD3:6;
      uint64_t PFD3_CLKRDY:1;
      uint64_t PFD3_CLKGATE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSPLL0PFD;

  uint8_t res9[36];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV:8;
      uint64_t reservedSpace0:21;
      uint64_t RESET:1;
      uint64_t HALT:1;
      uint64_t REQFLAG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAINPLLCLKDIV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV:8;
      uint64_t reservedSpace0:21;
      uint64_t RESET:1;
      uint64_t HALT:1;
      uint64_t REQFLAG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSPPLLCLKDIV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV:8;
      uint64_t reservedSpace0:21;
      uint64_t RESET:1;
      uint64_t HALT:1;
      uint64_t REQFLAG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AUX0PLLCLKDIV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV:8;
      uint64_t reservedSpace0:21;
      uint64_t RESET:1;
      uint64_t HALT:1;
      uint64_t REQFLAG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AUX1PLLCLKDIV;

  uint8_t res10[432];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV:8;
      uint64_t reservedSpace0:23;
      uint64_t REQFLAG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCPUAHBCLKDIV;

  uint8_t res11[44];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAINCLKSELA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAINCLKSELB;

  uint8_t res12[200];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV:8;
      uint64_t reservedSpace0:21;
      uint64_t RESET:1;
      uint64_t HALT:1;
      uint64_t REQFLAG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCDIV0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV:8;
      uint64_t reservedSpace0:21;
      uint64_t RESET:1;
      uint64_t HALT:1;
      uint64_t REQFLAG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCDIV1;

