iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/IMXRT685_RAM_GCC/targetInit/iMXRT685_sfr.h
  uint8_t res13[280];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLEXSPIFCLKSEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV:8;
      uint64_t reservedSpace0:21;
      uint64_t RESET:1;
      uint64_t HALT:1;
      uint64_t REQFLAG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLEXSPIFCLKDIV;

  uint8_t res14[24];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCTFCLKSEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV:8;
      uint64_t reservedSpace0:21;
      uint64_t RESET:1;
      uint64_t HALT:1;
      uint64_t REQFLAG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCTFCLKDIV;

  uint8_t res15[24];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USBHSFCLKSEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV:8;
      uint64_t reservedSpace0:21;
      uint64_t RESET:1;
      uint64_t HALT:1;
      uint64_t REQFLAG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USBHSFCLKDIV;

  uint8_t res16[24];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SDIO0FCLKSEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV:8;
      uint64_t reservedSpace0:21;
      uint64_t RESET:1;
      uint64_t HALT:1;
      uint64_t REQFLAG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SDIO0FCLKDIV;

  uint8_t res17[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SDIO1FCLKSEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV:8;
      uint64_t reservedSpace0:21;
      uint64_t RESET:1;
      uint64_t HALT:1;
      uint64_t REQFLAG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SDIO1FCLKDIV;

  uint8_t res18[56];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0FCLKSEL0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0FCLKSEL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV:8;
      uint64_t reservedSpace0:21;
      uint64_t RESET:1;
      uint64_t HALT:1;
      uint64_t REQFLAG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0FCLKDIV;

  uint8_t res19[36];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UTICKFCLKSEL;

  uint8_t res20[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WDT0FCLKSEL;

  uint8_t res21[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WAKECLK32KHZSEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:30;
      uint64_t HALT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WAKECLK32KHZDIV;

  uint8_t res22[40];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSTICKFCLKSEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV:8;
      uint64_t reservedSpace0:21;
      uint64_t RESET:1;
      uint64_t HALT:1;
      uint64_t REQFLAG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSTICKFCLKDIV;

};

#define CLKCTL0 (*(volatile struct CLKCTL0_tag *) 0x40001010)

struct SYSCTL0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t DSPSTALL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSPSTALL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t M0:2;
      uint64_t M1:2;
      uint64_t M2:2;
      uint64_t M3:2;
      uint64_t M4:2;
      uint64_t M5:2;
      uint64_t M6:2;
      uint64_t M7:2;
      uint64_t M8:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AHBMATRIXPRIOR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WRPENABLE:1;
      uint64_t RDPENABLE:1;
      uint64_t CPRENABLE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PACKERENABLE;

  uint8_t res0[24];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NMISRCSEL:7;
      uint64_t reservedSpace0:24;
      uint64_t NMIEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) M33NMISRCSEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSTEM_STICK_CALIB:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSTEM_STICK_CALIB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSTEM_NSTICK_CALIB:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSTEM_NSTICK_CALIB;

  uint8_t res1[40];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MINOR:4;
      uint64_t reservedSpace0:12;
      uint64_t MAJOR:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SILICONREV_ID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FIXBIT:1;
      uint64_t MANU:11;
      uint64_t PARTNUM:16;
      uint64_t VERNUM:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) JTAG_ID;

  uint8_t res2[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AHB2APB0:1;
      uint64_t AHB2APB1:1;
      uint64_t CRC_Engine:1;
      uint64_t Casper:1;
      uint64_t DMAC0:1;
      uint64_t DMAC1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AUTOCLKGATEOVERRIDE0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRAM_IF0:1;
      uint64_t SRAM_IF1:1;
      uint64_t SRAM_IF2:1;
      uint64_t SRAM_IF3:1;
      uint64_t SRAM_IF4:1;
      uint64_t SRAM_IF5:1;
      uint64_t SRAM_IF6:1;
      uint64_t SRAM_IF7:1;
      uint64_t SRAM_IF8:1;
      uint64_t SRAM_IF9:1;
      uint64_t SRAM_IF10:1;
      uint64_t SRAM_IF11:1;
      uint64_t SRAM_IF12:1;
      uint64_t SRAM_IF13:1;
      uint64_t SRAM_IF14:1;
      uint64_t SRAM_IF15:1;
      uint64_t SRAM_IF16:1;
      uint64_t SRAM_IF17:1;
      uint64_t SRAM_IF18:1;
      uint64_t SRAM_IF19:1;
      uint64_t SRAM_IF20:1;
      uint64_t SRAM_IF21:1;
      uint64_t SRAM_IF22:1;
      uint64_t SRAM_IF23:1;
      uint64_t SRAM_IF24:1;
      uint64_t SRAM_IF25:1;
      uint64_t SRAM_IF26:1;
      uint64_t SRAM_IF27:1;
      uint64_t SRAM_IF28:1;
      uint64_t SRAM_IF29:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AUTOCLKGATEOVERRIDE1;

  uint8_t res3[24];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SDIO_0:1;
      uint64_t SDIO_1:1;
      uint64_t USBHSPHY:1;
      uint64_t ADC:1;
      uint64_t MU:1;
      uint64_t ACMP:1;
      uint64_t PMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLKGATEOVERRIDE0;

  uint8_t res4[92];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRAM00_IF:1;
      uint64_t SRAM01_IF:1;
      uint64_t SRAM02_IF:1;
      uint64_t SRAM03_IF:1;
      uint64_t SRAM04_IF:1;
      uint64_t SRAM05_IF:1;
      uint64_t SRAM06_IF:1;
      uint64_t SRAM07_IF:1;
      uint64_t SRAM08_IF:1;
      uint64_t SRAM09_IF:1;
      uint64_t SRAM10_IF:1;
      uint64_t SRAM11_IF:1;
      uint64_t SRAM12_IF:1;
      uint64_t SRAM13_IF:1;
      uint64_t SRAM14_IF:1;
      uint64_t SRAM15_IF:1;
      uint64_t SRAM16_IF:1;
      uint64_t SRAM17_IF:1;
      uint64_t SRAM18_IF:1;
      uint64_t SRAM19_IF:1;
      uint64_t SRAM20_IF:1;
      uint64_t SRAM21_IF:1;
      uint64_t SRAM22_IF:1;
      uint64_t SRAM23_IF:1;
      uint64_t SRAM24_IF:1;
      uint64_t SRAM25_IF:1;
      uint64_t SRAM26_IF:1;
      uint64_t SRAM27_IF:1;
      uint64_t SRAM28_IF:1;
      uint64_t SRAM29_IF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AHB_SRAM_ACCESS_DISABLE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRAM00_IF:1;
      uint64_t SRAM01_IF:1;
      uint64_t SRAM02_IF:1;
      uint64_t SRAM03_IF:1;
      uint64_t SRAM04_IF:1;
      uint64_t SRAM05_IF:1;
      uint64_t SRAM06_IF:1;
      uint64_t SRAM07_IF:1;
      uint64_t SRAM08_IF:1;
      uint64_t SRAM09_IF:1;
      uint64_t SRAM10_IF:1;
      uint64_t SRAM11_IF:1;
      uint64_t SRAM12_IF:1;
      uint64_t SRAM13_IF:1;
      uint64_t SRAM14_IF:1;
      uint64_t SRAM15_IF:1;
      uint64_t SRAM16_IF:1;
      uint64_t SRAM17_IF:1;
      uint64_t SRAM18_IF:1;
      uint64_t SRAM19_IF:1;
      uint64_t SRAM20_IF:1;
      uint64_t SRAM21_IF:1;
      uint64_t SRAM22_IF:1;
      uint64_t SRAM23_IF:1;
      uint64_t SRAM24_IF:1;
      uint64_t SRAM25_IF:1;
      uint64_t SRAM26_IF:1;
      uint64_t SRAM27_IF:1;
      uint64_t SRAM28_IF:1;
      uint64_t SRAM29_IF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSP_SRAM_ACCESS_DISABLE;

