iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/IMXRT685_RAM_GCC/targetInit/iMXRT685_sfr.h
  uint8_t res5[48];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AHB_FLEXSPI_ACCESS_DISABLE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AHB_FLEXSPI_ACCESS_DISABLE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DSP_FLEXSPI_ACCESS_DISABLE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSP_FLEXSPI_ACCESS_DISABLE;

  uint8_t res6[716];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AP_DEV_CLK:1;
      uint64_t POL_DEV_CLK:1;
      uint64_t AP_HOST_CLK:1;
      uint64_t POL_HOST_CLK:1;
      uint64_t HS_DEV_WAKEUP_N:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USBCLKCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DEV_NEED_CLKST:1;
      uint64_t HOST_NEED_CLKST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USBCLKSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKTIMEDIV2:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USBPHYPLL0LOCKTIMEDIV2;

  uint8_t res7[488];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAINCLK_SHUTOFF:1;
      uint64_t PMIC_MODE0:1;
      uint64_t PMIC_MODE1:1;
      uint64_t DEEP_PD:1;
      uint64_t VDDCOREREG_LP:1;
      uint64_t reservedSpace0:1;
      uint64_t PMCREF_LP:1;
      uint64_t HVD1V8_PD:1;
      uint64_t PORCORE_LP:1;
      uint64_t LVDCORE_LP:1;
      uint64_t HVDCORE_PD:1;
      uint64_t RBB_PD:1;
      uint64_t FBB_PD:1;
      uint64_t SYSXTAL_PD:1;
      uint64_t LPOSC_PD:1;
      uint64_t SFRO_PD:1;
      uint64_t FFRO_PD:1;
      uint64_t SYSPLLLDO_PD:1;
      uint64_t SYSPLLANA_PD:1;
      uint64_t AUDPLLLDO_PD:1;
      uint64_t AUDPLLANA_PD:1;
      uint64_t ADC_PD:1;
      uint64_t ADC_LP:1;
      uint64_t ADCTEMPSNS_PD:1;
      uint64_t reservedSpace1:1;
      uint64_t ACMP_PD:1;
      uint64_t HSPAD0_VDET_LP:1;
      uint64_t HSPAD0_REF_PD:1;
      uint64_t HSPAD2_VDET_LP:1;
      uint64_t HSPAD2_REF_PD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDSLEEPCFG0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PQ_SRAM_APD:1;
      uint64_t PQ_SRAM_PPD:1;
      uint64_t FLEXSPI_SRAM_APD:1;
      uint64_t FLEXSPI_SRAM_PPD:1;
      uint64_t USBHS_SRAM_APD:1;
      uint64_t USBHS_SRAM_PPD:1;
      uint64_t USDHC0_SRAM_APD:1;
      uint64_t USDHC0_SRAM_PPD:1;
      uint64_t USDHC1_SRAM_APD:1;
      uint64_t USDHC1_SRAM_PPD:1;
      uint64_t CASPER_SRAM_APD:1;
      uint64_t CASPER_SRAM_PPD:1;
      uint64_t reservedSpace0:12;
      uint64_t DSPCACHE_REGF_APD:1;
      uint64_t DSPCACHE_REGF_PPD:1;
      uint64_t DSPTCM_REGF_APD:1;
      uint64_t DSPTCM_REGF_PPD:1;
      uint64_t ROM_PD:1;
      uint64_t reservedSpace1:2;
      uint64_t SRAM_SLEEP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDSLEEPCFG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRAM_IF0_APD:1;
      uint64_t SRAM_IF1_APD:1;
      uint64_t SRAM_IF2_APD:1;
      uint64_t SRAM_IF3_APD:1;
      uint64_t SRAM_IF4_APD:1;
      uint64_t SRAM_IF5_APD:1;
      uint64_t SRAM_IF6_APD:1;
      uint64_t SRAM_IF7_APD:1;
      uint64_t SRAM_IF8_APD:1;
      uint64_t SRAM_IF9_APD:1;
      uint64_t SRAM_IF10_APD:1;
      uint64_t SRAM_IF11_APD:1;
      uint64_t SRAM_IF12_APD:1;
      uint64_t SRAM_IF13_APD:1;
      uint64_t SRAM_IF14_APD:1;
      uint64_t SRAM_IF15_APD:1;
      uint64_t SRAM_IF16_APD:1;
      uint64_t SRAM_IF17_APD:1;
      uint64_t SRAM_IF18_APD:1;
      uint64_t SRAM_IF19_APD:1;
      uint64_t SRAM_IF20_APD:1;
      uint64_t SRAM_IF21_APD:1;
      uint64_t SRAM_IF22_APD:1;
      uint64_t SRAM_IF23_APD:1;
      uint64_t SRAM_IF24_APD:1;
      uint64_t SRAM_IF25_APD:1;
      uint64_t SRAM_IF26_APD:1;
      uint64_t SRAM_IF27_APD:1;
      uint64_t SRAM_IF28_APD:1;
      uint64_t SRAM_IF29_APD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDSLEEPCFG2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRAM_IF0_PPD:1;
      uint64_t SRAM_IF1_PPD:1;
      uint64_t SRAM_IF2_PPD:1;
      uint64_t SRAM_IF3_PPD:1;
      uint64_t SRAM_IF4_PPD:1;
      uint64_t SRAM_IF5_PPD:1;
      uint64_t SRAM_IF6_PPD:1;
      uint64_t SRAM_IF7_PPD:1;
      uint64_t SRAM_IF8_PPD:1;
      uint64_t SRAM_IF9_PPD:1;
      uint64_t SRAM_IF10_PPD:1;
      uint64_t SRAM_IF11_PPD:1;
      uint64_t SRAM_IF12_PPD:1;
      uint64_t SRAM_IF13_PPD:1;
      uint64_t SRAM_IF14_PPD:1;
      uint64_t SRAM_IF15_PPD:1;
      uint64_t SRAM_IF16_PPD:1;
      uint64_t SRAM_IF17_PPD:1;
      uint64_t SRAM_IF18_PPD:1;
      uint64_t SRAM_IF19_PPD:1;
      uint64_t SRAM_IF20_PPD:1;
      uint64_t SRAM_IF21_PPD:1;
      uint64_t SRAM_IF22_PPD:1;
      uint64_t SRAM_IF23_PPD:1;
      uint64_t SRAM_IF24_PPD:1;
      uint64_t SRAM_IF25_PPD:1;
      uint64_t SRAM_IF26_PPD:1;
      uint64_t SRAM_IF27_PPD:1;
      uint64_t SRAM_IF28_PPD:1;
      uint64_t SRAM_IF29_PPD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDSLEEPCFG3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t PMIC_MODE0:1;
      uint64_t PMIC_MODE1:1;
      uint64_t reservedSpace1:1;
      uint64_t VDDCOREREG_LP:1;
      uint64_t reservedSpace2:1;
      uint64_t PMCREF_LP:1;
      uint64_t HVD1V8_PD:1;
      uint64_t PORCORE_LP:1;
      uint64_t LVDCORE_LP:1;
      uint64_t HVDCORE_PD:1;
      uint64_t reservedSpace3:2;
      uint64_t SYSXTAL_PD:1;
      uint64_t LPOSC_PD:1;
      uint64_t SFRO_PD:1;
      uint64_t FFRO_PD:1;
      uint64_t SYSPLLLDO_PD:1;
      uint64_t SYSPLLANA_PD:1;
      uint64_t AUDPLLLDO_PD:1;
      uint64_t AUDPLLANA_PD:1;
      uint64_t ADC_PD:1;
      uint64_t ADC_LP:1;
      uint64_t ADCTEMPSNS_PD:1;
      uint64_t reservedSpace4:1;
      uint64_t ACMP_PD:1;
      uint64_t HSPAD0_VDET_LP:1;
      uint64_t HSPAD0_REF_PD:1;
      uint64_t HSPAD2_VDET_LP:1;
      uint64_t HSPAD2_REF_PD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDRUNCFG0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PQ_SRAM_APD:1;
      uint64_t PQ_SRAM_PPD:1;
      uint64_t FLEXSPI_SRAM_APD:1;
      uint64_t FLEXSPI_SRAM_PPD:1;
      uint64_t USBHS_SRAM_APD:1;
      uint64_t USBHS_SRAM_PPD:1;
      uint64_t USDHC0_SRAM_APD:1;
      uint64_t USDHC0_SRAM_PPD:1;
      uint64_t USDHC1_SRAM_APD:1;
      uint64_t USDHC1_SRAM_PPD:1;
      uint64_t CASPER_SRAM_APD:1;
      uint64_t CASPER_SRAM_PPD:1;
      uint64_t reservedSpace0:12;
      uint64_t DSPCACHE_REGF_APD:1;
      uint64_t DSPCACHE_REGF_PPD:1;
      uint64_t DSPTCM_REGF_APD:1;
      uint64_t DSPTCM_REGF_PPD:1;
      uint64_t ROM_PD:1;
      uint64_t reservedSpace1:2;
      uint64_t SRAM_SLEEP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDRUNCFG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRAM_IF0_APD:1;
      uint64_t SRAM_IF1_APD:1;
      uint64_t SRAM_IF2_APD:1;
      uint64_t SRAM_IF3_APD:1;
      uint64_t SRAM_IF4_APD:1;
      uint64_t SRAM_IF5_APD:1;
      uint64_t SRAM_IF6_APD:1;
      uint64_t SRAM_IF7_APD:1;
      uint64_t SRAM_IF8_APD:1;
      uint64_t SRAM_IF9_APD:1;
      uint64_t SRAM_IF10_APD:1;
      uint64_t SRAM_IF11_APD:1;
      uint64_t SRAM_IF12_APD:1;
      uint64_t SRAM_IF13_APD:1;
      uint64_t SRAM_IF14_APD:1;
      uint64_t SRAM_IF15_APD:1;
      uint64_t SRAM_IF16_APD:1;
      uint64_t SRAM_IF17_APD:1;
      uint64_t SRAM_IF18_APD:1;
      uint64_t SRAM_IF19_APD:1;
      uint64_t SRAM_IF20_APD:1;
      uint64_t SRAM_IF21_APD:1;
      uint64_t SRAM_IF22_APD:1;
      uint64_t SRAM_IF23_APD:1;
      uint64_t SRAM_IF24_APD:1;
      uint64_t SRAM_IF25_APD:1;
      uint64_t SRAM_IF26_APD:1;
      uint64_t SRAM_IF27_APD:1;
      uint64_t SRAM_IF28_APD:1;
      uint64_t SRAM_IF29_APD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDRUNCFG2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRAM_IF0_PPD:1;
      uint64_t SRAM_IF1_PPD:1;
      uint64_t SRAM_IF2_PPD:1;
      uint64_t SRAM_IF3_PPD:1;
      uint64_t SRAM_IF4_PPD:1;
      uint64_t SRAM_IF5_PPD:1;
      uint64_t SRAM_IF6_PPD:1;
      uint64_t SRAM_IF7_PPD:1;
      uint64_t SRAM_IF8_PPD:1;
      uint64_t SRAM_IF9_PPD:1;
      uint64_t SRAM_IF10_PPD:1;
      uint64_t SRAM_IF11_PPD:1;
      uint64_t SRAM_IF12_PPD:1;
      uint64_t SRAM_IF13_PPD:1;
      uint64_t SRAM_IF14_PPD:1;
      uint64_t SRAM_IF15_PPD:1;
      uint64_t SRAM_IF16_PPD:1;
      uint64_t SRAM_IF17_PPD:1;
      uint64_t SRAM_IF18_PPD:1;
      uint64_t SRAM_IF19_PPD:1;
      uint64_t SRAM_IF20_PPD:1;
      uint64_t SRAM_IF21_PPD:1;
      uint64_t SRAM_IF22_PPD:1;
      uint64_t SRAM_IF23_PPD:1;
      uint64_t SRAM_IF24_PPD:1;
      uint64_t SRAM_IF25_PPD:1;
      uint64_t SRAM_IF26_PPD:1;
      uint64_t SRAM_IF27_PPD:1;
      uint64_t SRAM_IF28_PPD:1;
      uint64_t SRAM_IF29_PPD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDRUNCFG3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t PMIC_MODE0:1;
      uint64_t PMIC_MODE1:1;
      uint64_t reservedSpace1:1;
      uint64_t VDDCOREREG_LP:1;
      uint64_t reservedSpace2:1;
      uint64_t PMCREF_LP:1;
      uint64_t HVD1V8_PD:1;
      uint64_t PORCORE_LP:1;
      uint64_t LVDCORE_LP:1;
      uint64_t HVDCORE_PD:1;
      uint64_t RBB_PD:1;
      uint64_t FBB_PD:1;
      uint64_t SYSXTAL_PD:1;
      uint64_t LPOSC_PD:1;
      uint64_t SFRO_PD:1;
      uint64_t FFRO_PD:1;
      uint64_t SYSPLLLDO_PD:1;
      uint64_t SYSPLLANA_PD:1;
      uint64_t AUDPLLLDO_PD:1;
      uint64_t AUDPLLANA_PD:1;
      uint64_t ADC_PD:1;
      uint64_t ADC_LP:1;
      uint64_t ADCTEMPSNS_PD:1;
      uint64_t reservedSpace3:1;
      uint64_t ACMP_PD:1;
      uint64_t HSPAD0_VDET_LP:1;
      uint64_t HSPAD0_REF_PD:1;
      uint64_t HSPAD2_VDET_LP:1;
      uint64_t HSPAD2_REF_PD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDRUNCFG0_SET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PQ_SRAM_APD:1;
      uint64_t PQ_SRAM_PPD:1;
      uint64_t FLEXSPI_SRAM_APD:1;
      uint64_t FLEXSPI_SRAM_PPD:1;
      uint64_t USBHS_SRAM_APD:1;
      uint64_t USBHS_SRAM_PPD:1;
      uint64_t USDHC0_SRAM_APD:1;
      uint64_t USDHC0_SRAM_PPD:1;
      uint64_t USDHC1_SRAM_APD:1;
      uint64_t USDHC1_SRAM_PPD:1;
      uint64_t CASPER_SRAM_APD:1;
      uint64_t CASPER_SRAM_PPD:1;
      uint64_t reservedSpace0:12;
      uint64_t DSPCACHE_REGF_APD:1;
      uint64_t DSPCACHE_REGF_PPD:1;
      uint64_t DSPTCM_REGF_APD:1;
      uint64_t DSPTCM_REGF_PPD:1;
      uint64_t ROM_PD:1;
      uint64_t reservedSpace1:2;
      uint64_t SRAM_SLEEP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDRUNCFG1_SET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRAM_IF0_APD:1;
      uint64_t SRAM_IF1_APD:1;
      uint64_t SRAM_IF2_APD:1;
      uint64_t SRAM_IF3_APD:1;
      uint64_t SRAM_IF4_APD:1;
      uint64_t SRAM_IF5_APD:1;
      uint64_t SRAM_IF6_APD:1;
      uint64_t SRAM_IF7_APD:1;
      uint64_t SRAM_IF8_APD:1;
      uint64_t SRAM_IF9_APD:1;
      uint64_t SRAM_IF10_APD:1;
      uint64_t SRAM_IF11_APD:1;
      uint64_t SRAM_IF12_APD:1;
      uint64_t SRAM_IF13_APD:1;
      uint64_t SRAM_IF14_APD:1;
      uint64_t SRAM_IF15_APD:1;
      uint64_t SRAM_IF16_APD:1;
      uint64_t SRAM_IF17_APD:1;
      uint64_t SRAM_IF18_APD:1;
      uint64_t SRAM_IF19_APD:1;
      uint64_t SRAM_IF20_APD:1;
      uint64_t SRAM_IF21_APD:1;
      uint64_t SRAM_IF22_APD:1;
      uint64_t SRAM_IF23_APD:1;
      uint64_t SRAM_IF24_APD:1;
      uint64_t SRAM_IF25_APD:1;
      uint64_t SRAM_IF26_APD:1;
      uint64_t SRAM_IF27_APD:1;
      uint64_t SRAM_IF28_APD:1;
      uint64_t SRAM_IF29_APD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDRUNCFG2_SET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRAM_IF0_PPD:1;
      uint64_t SRAM_IF1_PPD:1;
      uint64_t SRAM_IF2_PPD:1;
      uint64_t SRAM_IF3_PPD:1;
      uint64_t SRAM_IF4_PPD:1;
      uint64_t SRAM_IF5_PPD:1;
      uint64_t SRAM_IF6_PPD:1;
      uint64_t SRAM_IF7_PPD:1;
      uint64_t SRAM_IF8_PPD:1;
      uint64_t SRAM_IF9_PPD:1;
      uint64_t SRAM_IF10_PPD:1;
      uint64_t SRAM_IF11_PPD:1;
      uint64_t SRAM_IF12_PPD:1;
      uint64_t SRAM_IF13_PPD:1;
      uint64_t SRAM_IF14_PPD:1;
      uint64_t SRAM_IF15_PPD:1;
      uint64_t SRAM_IF16_PPD:1;
      uint64_t SRAM_IF17_PPD:1;
      uint64_t SRAM_IF18_PPD:1;
      uint64_t SRAM_IF19_PPD:1;
      uint64_t SRAM_IF20_PPD:1;
      uint64_t SRAM_IF21_PPD:1;
      uint64_t SRAM_IF22_PPD:1;
      uint64_t SRAM_IF23_PPD:1;
      uint64_t SRAM_IF24_PPD:1;
      uint64_t SRAM_IF25_PPD:1;
      uint64_t SRAM_IF26_PPD:1;
      uint64_t SRAM_IF27_PPD:1;
      uint64_t SRAM_IF28_PPD:1;
      uint64_t SRAM_IF29_PPD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDRUNCFG3_SET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t PMIC_MODE0:1;
      uint64_t PMIC_MODE1:1;
      uint64_t reservedSpace1:1;
      uint64_t VDDCOREREG_LP:1;
      uint64_t reservedSpace2:1;
      uint64_t PMCREF_LP:1;
      uint64_t HVD1V8_PD:1;
      uint64_t PORCORE_LP:1;
      uint64_t LVDCORE_LP:1;
      uint64_t HVDCORE_PD:1;
      uint64_t RBB_PD:1;
      uint64_t FBB_PD:1;
      uint64_t SYSXTAL_PD:1;
      uint64_t LPOSC_PD:1;
      uint64_t SFRO_PD:1;
      uint64_t FFRO_PD:1;
      uint64_t SYSPLLLDO_PD:1;
      uint64_t SYSPLLANA_PD:1;
      uint64_t AUDPLLLDO_PD:1;
      uint64_t AUDPLLANA_PD:1;
      uint64_t ADC_PD:1;
      uint64_t ADC_LP:1;
      uint64_t ADCTEMPSNS_PD:1;
      uint64_t reservedSpace3:1;
      uint64_t ACMP_PD:1;
      uint64_t HSPAD0_VDET_LP:1;
      uint64_t HSPAD0_REF_PD:1;
      uint64_t HSPAD2_VDET_LP:1;
      uint64_t HSPAD2_REF_PD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDRUNCFG0_CLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PQ_SRAM_APD:1;
      uint64_t PQ_SRAM_PPD:1;
      uint64_t FLEXSPI_SRAM_APD:1;
      uint64_t FLEXSPI_SRAM_PPD:1;
      uint64_t USBHS_SRAM_APD:1;
      uint64_t USBHS_SRAM_PPD:1;
      uint64_t USDHC0_SRAM_APD:1;
      uint64_t USDHC0_SRAM_PPD:1;
      uint64_t USDHC1_SRAM_APD:1;
      uint64_t USDHC1_SRAM_PPD:1;
      uint64_t CASPER_SRAM_APD:1;
      uint64_t CASPER_SRAM_PPD:1;
      uint64_t reservedSpace0:12;
      uint64_t DSPCACHE_REGF_APD:1;
      uint64_t DSPCACHE_REGF_PPD:1;
      uint64_t DSPTCM_REGF_APD:1;
      uint64_t DSPTCM_REGF_PPD:1;
      uint64_t ROM_PD:1;
      uint64_t reservedSpace1:2;
      uint64_t SRAM_SLEEP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDRUNCFG1_CLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRAM_IF0_APD:1;
      uint64_t SRAM_IF1_APD:1;
      uint64_t SRAM_IF2_APD:1;
      uint64_t SRAM_IF3_APD:1;
      uint64_t SRAM_IF4_APD:1;
      uint64_t SRAM_IF5_APD:1;
      uint64_t SRAM_IF6_APD:1;
      uint64_t SRAM_IF7_APD:1;
      uint64_t SRAM_IF8_APD:1;
      uint64_t SRAM_IF9_APD:1;
      uint64_t SRAM_IF10_APD:1;
      uint64_t SRAM_IF11_APD:1;
      uint64_t SRAM_IF12_APD:1;
      uint64_t SRAM_IF13_APD:1;
      uint64_t SRAM_IF14_APD:1;
      uint64_t SRAM_IF15_APD:1;
      uint64_t SRAM_IF16_APD:1;
      uint64_t SRAM_IF17_APD:1;
      uint64_t SRAM_IF18_APD:1;
      uint64_t SRAM_IF19_APD:1;
      uint64_t SRAM_IF20_APD:1;
      uint64_t SRAM_IF21_APD:1;
      uint64_t SRAM_IF22_APD:1;
      uint64_t SRAM_IF23_APD:1;
      uint64_t SRAM_IF24_APD:1;
      uint64_t SRAM_IF25_APD:1;
      uint64_t SRAM_IF26_APD:1;
      uint64_t SRAM_IF27_APD:1;
      uint64_t SRAM_IF28_APD:1;
      uint64_t SRAM_IF29_APD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDRUNCFG2_CLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRAM_IF0_PPD:1;
      uint64_t SRAM_IF1_PPD:1;
      uint64_t SRAM_IF2_PPD:1;
      uint64_t SRAM_IF3_PPD:1;
      uint64_t SRAM_IF4_PPD:1;
      uint64_t SRAM_IF5_PPD:1;
      uint64_t SRAM_IF6_PPD:1;
      uint64_t SRAM_IF7_PPD:1;
      uint64_t SRAM_IF8_PPD:1;
      uint64_t SRAM_IF9_PPD:1;
      uint64_t SRAM_IF10_PPD:1;
      uint64_t SRAM_IF11_PPD:1;
      uint64_t SRAM_IF12_PPD:1;
      uint64_t SRAM_IF13_PPD:1;
      uint64_t SRAM_IF14_PPD:1;
      uint64_t SRAM_IF15_PPD:1;
      uint64_t SRAM_IF16_PPD:1;
      uint64_t SRAM_IF17_PPD:1;
      uint64_t SRAM_IF18_PPD:1;
      uint64_t SRAM_IF19_PPD:1;
      uint64_t SRAM_IF20_PPD:1;
      uint64_t SRAM_IF21_PPD:1;
      uint64_t SRAM_IF22_PPD:1;
      uint64_t SRAM_IF23_PPD:1;
      uint64_t SRAM_IF24_PPD:1;
      uint64_t SRAM_IF25_PPD:1;
      uint64_t SRAM_IF26_PPD:1;
      uint64_t SRAM_IF27_PPD:1;
      uint64_t SRAM_IF28_PPD:1;
      uint64_t SRAM_IF29_PPD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDRUNCFG3_CLR;

  uint8_t res8[64];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WDT0:1;
      uint64_t DMAC0:1;
      uint64_t NSHSGPIO_INT0:1;
      uint64_t NSHSGPIO_INT1:1;
      uint64_t GPIO_INT0_IRQ0:1;
      uint64_t GPIO_INT0_IRQ1:1;
      uint64_t GPIO_INT0_IRQ2:1;
      uint64_t GPIO_INT0_IRQ3:1;
      uint64_t UTICK0_bitfield:1;
      uint64_t MRT0_bitfield:1;
      uint64_t CT32BIT0:1;
      uint64_t CT32BIT1:1;
      uint64_t SCT0:1;
      uint64_t CT32BIT3:1;
      uint64_t FLEXCOMM0_bitfield:1;
      uint64_t FLEXCOMM1_bitfield:1;
      uint64_t FLEXCOMM2_bitfield:1;
      uint64_t FLEXCOMM3_bitfield:1;
      uint64_t FLEXCOMM4_bitfield:1;
      uint64_t FLEXCOMM5_bitfield:1;
      uint64_t FLEXCOMM14_bitfield:1;
      uint64_t FLEXCOMM15_bitfield:1;
      uint64_t ADC0_bitfield:1;
      uint64_t reservedSpace0:1;
      uint64_t ACMP:1;
      uint64_t DMIC0_bitfield:1;
      uint64_t reservedSpace1:1;
      uint64_t HYPERVISOR:1;
      uint64_t SECUREVIOLATION:1;
      uint64_t HWVAD0:1;
      uint64_t reservedSpace2:1;
      uint64_t RNG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STARTEN0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RTC_LITE0_ALARM_or_WAKEUP:1;
      uint64_t reservedSpace0:1;
      uint64_t MU:1;
      uint64_t GPIO_INT0_IRQ4:1;
      uint64_t GPIO_INT0_IRQ5:1;
      uint64_t GPIO_INT0_IRQ6:1;
      uint64_t GPIO_INT0_IRQ7:1;
      uint64_t CT32BIT2:1;
      uint64_t CT32BIT4:1;
      uint64_t OS_EVENT_TIMER_WU:1;
      uint64_t FLEXSPI_bitfield:1;
      uint64_t FLEXCOMM6_bitfield:1;
      uint64_t FLEXCOMM7_bitfield:1;
      uint64_t SDIO0:1;
      uint64_t SDIO1:1;
      uint64_t SHSGPIO_INT0:1;
      uint64_t SHSGPIO_INT1:1;
      uint64_t I3C0:1;
      uint64_t USB_IRQ:1;
      uint64_t USB_NEEDCLK:1;
      uint64_t reservedSpace1:2;
      uint64_t DMAC1:1;
      uint64_t PUF_bitfield:1;
      uint64_t POWERQUAD_bitfield:1;
      uint64_t CASPER_bitfield:1;
      uint64_t PMIC:1;
      uint64_t SHA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STARTEN1;

  uint8_t res9[24];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WDT0:1;
      uint64_t DMAC0:1;
      uint64_t NSHSGPIO_INT0:1;
      uint64_t NSHSGPIO_INT1:1;
      uint64_t GPIO_INT0_IRQ0:1;
      uint64_t GPIO_INT0_IRQ1:1;
      uint64_t GPIO_INT0_IRQ2:1;
      uint64_t GPIO_INT0_IRQ3:1;
      uint64_t UTICK0_bitfield:1;
      uint64_t MRT0_bitfield:1;
      uint64_t CT32BIT0:1;
      uint64_t CT32BIT1:1;
      uint64_t SCT0:1;
      uint64_t CT32BIT3:1;
      uint64_t FLEXCOMM0_bitfield:1;
      uint64_t FLEXCOMM1_bitfield:1;
      uint64_t FLEXCOMM2_bitfield:1;
      uint64_t FLEXCOMM3_bitfield:1;
      uint64_t FLEXCOMM4_bitfield:1;
      uint64_t FLEXCOMM5_bitfield:1;
      uint64_t FLEXCOMM14_bitfield:1;
      uint64_t FLEXCOMM15_bitfield:1;
      uint64_t ADC0_bitfield:1;
      uint64_t reservedSpace0:1;
      uint64_t ACMP:1;
      uint64_t DMIC0_bitfield:1;
      uint64_t reservedSpace1:1;
      uint64_t HYPERVISOR:1;
      uint64_t SECUREVIOLATION:1;
      uint64_t HWVAD0:1;
      uint64_t reservedSpace2:1;
      uint64_t RNG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STARTEN0_SET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RTC_LITE0_ALARM_or_WAKEUP:1;
      uint64_t reservedSpace0:1;
      uint64_t MU:1;
      uint64_t GPIO_INT0_IRQ4:1;
      uint64_t GPIO_INT0_IRQ5:1;
      uint64_t GPIO_INT0_IRQ6:1;
      uint64_t GPIO_INT0_IRQ7:1;
      uint64_t CT32BIT2:1;
      uint64_t CT32BIT4:1;
      uint64_t OS_EVENT_TIMER_WU:1;
      uint64_t FLEXSPI_bitfield:1;
      uint64_t FLEXCOMM6_bitfield:1;
      uint64_t FLEXCOMM7_bitfield:1;
      uint64_t SDIO0:1;
      uint64_t SDIO1:1;
      uint64_t SHSGPIO_INT0:1;
      uint64_t SHSGPIO_INT1:1;
      uint64_t I3C0:1;
      uint64_t USB_IRQ:1;
      uint64_t USB_NEEDCLK:1;
      uint64_t reservedSpace1:2;
      uint64_t DMAC1:1;
      uint64_t PUF_bitfield:1;
      uint64_t POWERQUAD_bitfield:1;
      uint64_t CASPER_bitfield:1;
      uint64_t PMIC:1;
      uint64_t SHA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STARTEN1_SET;

  uint8_t res10[24];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WDT0:1;
      uint64_t DMAC0:1;
      uint64_t NSHSGPIO_INT0:1;
      uint64_t NSHSGPIO_INT1:1;
      uint64_t GPIO_INT0_IRQ0:1;
      uint64_t GPIO_INT0_IRQ1:1;
      uint64_t GPIO_INT0_IRQ2:1;
      uint64_t GPIO_INT0_IRQ3:1;
      uint64_t UTICK0_bitfield:1;
      uint64_t MRT0_bitfield:1;
      uint64_t CT32BIT0:1;
      uint64_t CT32BIT1:1;
      uint64_t SCT0:1;
      uint64_t CT32BIT3:1;
      uint64_t FLEXCOMM0_bitfield:1;
      uint64_t FLEXCOMM1_bitfield:1;
      uint64_t FLEXCOMM2_bitfield:1;
      uint64_t FLEXCOMM3_bitfield:1;
      uint64_t FLEXCOMM4_bitfield:1;
      uint64_t FLEXCOMM5_bitfield:1;
      uint64_t FLEXCOMM14_bitfield:1;
      uint64_t FLEXCOMM15_bitfield:1;
      uint64_t ADC0_bitfield:1;
      uint64_t reservedSpace0:1;
      uint64_t ACMP:1;
      uint64_t DMIC0_bitfield:1;
      uint64_t reservedSpace1:1;
      uint64_t HYPERVISOR:1;
      uint64_t SECUREVIOLATION:1;
      uint64_t HWVAD0:1;
      uint64_t reservedSpace2:1;
      uint64_t RNG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STARTEN0_CLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RTC_LITE0_ALARM_or_WAKEUP:1;
      uint64_t reservedSpace0:1;
      uint64_t MU:1;
      uint64_t GPIO_INT0_IRQ4:1;
      uint64_t GPIO_INT0_IRQ5:1;
      uint64_t GPIO_INT0_IRQ6:1;
      uint64_t GPIO_INT0_IRQ7:1;
      uint64_t CT32BIT2:1;
      uint64_t CT32BIT4:1;
      uint64_t OS_EVENT_TIMER_WU:1;
      uint64_t FLEXSPI_bitfield:1;
      uint64_t FLEXCOMM6_bitfield:1;
      uint64_t FLEXCOMM7_bitfield:1;
      uint64_t SDIO0:1;
      uint64_t SDIO1:1;
      uint64_t SHSGPIO_INT0:1;
      uint64_t SHSGPIO_INT1:1;
      uint64_t I3C0:1;
      uint64_t USB_IRQ:1;
      uint64_t USB_NEEDCLK:1;
      uint64_t reservedSpace1:2;
      uint64_t DMAC1:1;
      uint64_t PUF_bitfield:1;
      uint64_t POWERQUAD_bitfield:1;
      uint64_t CASPER_bitfield:1;
      uint64_t PMIC:1;
      uint64_t SHA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STARTEN1_CLR;

  uint8_t res11[184];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FORCEWAKE:1;
      uint64_t FCWAKE:1;
      uint64_t DMICWAKE:1;
      uint64_t DMAC0WAKE:1;
      uint64_t DMAC1WAKE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HWWAKE;

  uint8_t res12[1740];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BOOTSTATESEED:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BOOTSTATESEED0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BOOTSTATESEED:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BOOTSTATESEED1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BOOTSTATESEED:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BOOTSTATESEED2;

