iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/IMXRT685_RAM_GCC/targetInit/iMXRT685_sfr.h
  union
  {
    uint32_t R;
    struct
    {
      uint64_t BOOTSTATESEED:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BOOTSTATESEED3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BOOTSTATESEED:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BOOTSTATESEED4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BOOTSTATESEED:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BOOTSTATESEED5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BOOTSTATESEED:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BOOTSTATESEED6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BOOTSTATESEED:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BOOTSTATESEED7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BOOTSTATEHMAC:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BOOTSTATEHMAC0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BOOTSTATEHMAC:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BOOTSTATEHMAC1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BOOTSTATEHMAC:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BOOTSTATEHMAC2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BOOTSTATEHMAC:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BOOTSTATEHMAC3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BOOTSTATEHMAC:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BOOTSTATEHMAC4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BOOTSTATEHMAC:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BOOTSTATEHMAC5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BOOTSTATEHMAC:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BOOTSTATEHMAC6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BOOTSTATEHMAC:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BOOTSTATEHMAC7;

  uint8_t res13[104];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RASRCN:4;
      uint64_t RASRCP:4;
      uint64_t FASTFRZ:1;
      uint64_t FREEZE:1;
      uint64_t COMPTQ:1;
      uint64_t COMPEN:1;
      uint64_t reservedSpace0:4;
      uint64_t NASRCN:4;
      uint64_t NASRCP:4;
      uint64_t COMPOK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLEXSPIPADCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RASRCN:4;
      uint64_t RASRCP:4;
      uint64_t FASTFRZ:1;
      uint64_t FREEZE:1;
      uint64_t COMPTQ:1;
      uint64_t COMPEN:1;
      uint64_t reservedSpace0:4;
      uint64_t NASRCN:4;
      uint64_t NASRCP:4;
      uint64_t COMPOK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SDIOPADCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DICEHWREG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DICEHWREG_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DICEHWREG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DICEHWREG_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DICEHWREG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DICEHWREG_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DICEHWREG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DICEHWREG_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DICEHWREG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DICEHWREG_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DICEHWREG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DICEHWREG_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DICEHWREG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DICEHWREG_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DICEHWREG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DICEHWREG_7;

  uint8_t res14[48];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t uuid:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UUID0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t uuid:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UUID1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t uuid:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UUID2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t uuid:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UUID3;

  uint8_t res15[32];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AESKEY_SRCSEL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AESKEY_SRCSEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OTFADKEY_SRCSEL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTFADKEY_SRCSEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HASHHWKEYDISABLE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HASHHWKEYDISABLE;

  uint8_t res16[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DBG_LOCKEN:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DBG_LOCKEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DBGEN:2;
      uint64_t NIDEN:2;
      uint64_t SPIDEN:2;
      uint64_t SPNIDEN:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DBG_FEATURES;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DBGEN:2;
      uint64_t NIDEN:2;
      uint64_t SPIDEN:2;
      uint64_t SPNIDEN:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DBG_FEATURES_DP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HWUNLOCK_DISABLE:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HWUNLOCK_DISABLE;

  uint8_t res17[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CS_PROTCPU0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CS_PROTCPU0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CS_PROTCPU1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CS_PROTCPU1;

  uint8_t res18[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DBG_AUTH_SCRATCH:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DBG_AUTH_SCRATCH;

  uint8_t res19[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t KEY_BLOCK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) KEY_BLOCK;

