iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/IMXRT685_RAM_GCC/targetInit/iMXRT685_sfr.h
};

#define SYSCTL0 (*(volatile struct SYSCTL0_tag *) 0x4000200c)

struct IOPCTL_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO0_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO0_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO0_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO0_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO0_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO0_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO0_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO0_7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO0_8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO0_9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO0_10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO0_11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO0_12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO0_13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO0_14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO0_15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO0_16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO0_17;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO0_18;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO0_19;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO0_20;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO0_21;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO0_22;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO0_23;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO0_24;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO0_25;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO0_26;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO0_27;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO0_28;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO0_29;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO0_30;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO0_31;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO1_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO1_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO1_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO1_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO1_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO1_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO1_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO1_7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO1_8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO1_9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO1_10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO1_11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO1_12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO1_13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO1_14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO1_15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO1_16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO1_17;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO1_18;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO1_19;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO1_20;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO1_21;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO1_22;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO1_23;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO1_24;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO1_25;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO1_26;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO1_27;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO1_28;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO1_29;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO1_30;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO1_31;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO2_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO2_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO2_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO2_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO2_4;

