iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/IMXRT685_RAM_GCC/targetInit/iMXRT685_sfr.h
  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO2_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO2_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO2_7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO2_8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO2_9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO2_10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO2_11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO2_12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO2_13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO2_14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO2_15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO2_16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO2_17;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO2_18;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO2_19;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO2_20;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO2_21;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO2_22;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO2_23;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO2_24;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO2_25;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO2_26;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO2_27;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO2_28;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO2_29;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO2_30;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO2_31;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO3_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO3_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO3_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO3_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO3_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO3_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO3_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO3_7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO3_8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO3_9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO3_10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO3_11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO3_12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO3_13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO3_14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO3_15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO3_16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO3_17;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO3_18;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO3_19;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO3_20;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO3_21;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO3_22;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO3_23;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO3_24;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO3_25;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO3_26;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO3_27;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO3_28;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO3_29;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO3_30;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO3_31;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO4_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO4_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO4_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO4_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO4_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO4_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO4_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO4_7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO4_8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO4_9;

