iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/IMXRT685_RAM_GCC/targetInit/iMXRT685_sfr.h
  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO4_10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO4_11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO4_12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO4_13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO4_14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO4_15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO4_16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO4_17;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO4_18;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO4_19;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO4_20;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO4_21;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO4_22;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO4_23;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO4_24;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO4_25;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO4_26;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO4_27;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO4_28;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO4_29;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO4_30;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO4_31;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO5_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO5_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO5_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO5_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO5_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO5_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO5_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO5_7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO5_8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO5_9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO5_10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO5_11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO5_12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO5_13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO5_14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO5_15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO5_16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO5_17;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO5_18;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO5_19;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO5_20;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO5_21;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO5_22;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO5_23;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO5_24;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO5_25;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO5_26;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO5_27;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO5_28;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO5_29;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO5_30;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO5_31;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO6_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO6_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO6_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO6_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO6_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO6_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO6_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO6_7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO6_8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO6_9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO6_10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO6_11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO6_12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO6_13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO6_14;

