iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/IMXRT685_RAM_GCC/targetInit/iMXRT685_sfr.h
  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO6_15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO6_16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO6_17;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO6_18;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO6_19;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO6_20;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO6_21;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO6_22;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO6_23;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO6_24;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO6_25;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO6_26;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO6_27;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO6_28;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO6_29;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO6_30;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO6_31;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO7_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO7_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO7_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO7_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO7_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO7_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO7_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO7_7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO7_8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO7_9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO7_10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO7_11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO7_12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO7_13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO7_14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO7_15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO7_16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO7_17;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO7_18;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO7_19;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO7_20;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO7_21;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO7_22;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO7_23;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO7_24;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO7_25;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO7_26;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO7_27;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO7_28;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO7_29;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO7_30;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO7_31;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FC15_I2C_SCL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:4;
      uint64_t PUPDENA:1;
      uint64_t PUPDSEL:1;
      uint64_t IBENA:1;
      uint64_t SLEWRATE:1;
      uint64_t FULLDRIVE:1;
      uint64_t AMENA:1;
      uint64_t ODENA:1;
      uint64_t IIENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FC15_I2C_SDA;

