iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/IMXRT685_RAM_GCC/targetInit/iMXRT685_sfr.h
};

#define IOPCTL (*(volatile struct IOPCTL_tag *) 0x40004000)

struct PUF_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t ZEROIZE:1;
      uint64_t ENROLL:1;
      uint64_t START:1;
      uint64_t GENERATEKEY:1;
      uint64_t SETKEY:1;
      uint64_t reservedSpace0:1;
      uint64_t GETKEY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t KEYIDX:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) KEYINDEX;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t KEYSIZE:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) KEYSIZE;

  uint8_t res0[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BUSY:1;
      uint64_t SUCCESS:1;
      uint64_t ERROR:1;
      uint64_t reservedSpace0:1;
      uint64_t KEYINREQ:1;
      uint64_t KEYOUTAVAIL:1;
      uint64_t CODEINREQ:1;
      uint64_t CODEOUTAVAIL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STAT;

  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ALLOWENROLL:1;
      uint64_t ALLOWSTART:1;
      uint64_t ALLOWSETKEY:1;
      uint64_t ALLOWGETKEY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ALLOW;

  uint8_t res2[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t KEYIN:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) KEYINPUT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CODEIN:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CODEINPUT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CODEOUT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CODEOUTPUT;

  uint8_t res3[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t KEYOUTIDX:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) KEYOUTINDEX;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t KEYOUT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) KEYOUTPUT;

  uint8_t res4[116];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ERROR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFSTAT;

  uint8_t res5[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VERSION:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) VERSION;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t READYEN:1;
      uint64_t SUCCESEN:1;
      uint64_t ERROREN:1;
      uint64_t reservedSpace0:1;
      uint64_t KEYINREQEN:1;
      uint64_t KEYOUTAVAILEN:1;
      uint64_t CODEINREQEN:1;
      uint64_t CODEOUTAVAILEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t READY:1;
      uint64_t SUCCESS:1;
      uint64_t ERROR:1;
      uint64_t reservedSpace0:1;
      uint64_t KEYINREQ:1;
      uint64_t KEYOUTAVAIL:1;
      uint64_t CODEINREQ:1;
      uint64_t CODEOUTAVAIL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RAM_ON:1;
      uint64_t reservedSpace0:1;
      uint64_t CK_DIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWRCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BLOCKENROLL_SETKEY:1;
      uint64_t BLOCKKEYOUTPUT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG;

  uint8_t res6[240];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t KEY0:2;
      uint64_t KEY1:2;
      uint64_t KEY2:2;
      uint64_t KEY3:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) KEYLOCK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t KEY0:2;
      uint64_t KEY1:2;
      uint64_t KEY2:2;
      uint64_t KEY3:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) KEYENABLE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t KEY0:2;
      uint64_t KEY1:2;
      uint64_t KEY2:2;
      uint64_t KEY3:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) KEYRESET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t IDX1:2;
      uint64_t IDX2:2;
      uint64_t IDX3:2;
      uint64_t IDX4:2;
      uint64_t IDX5:2;
      uint64_t IDX6:2;
      uint64_t IDX7:2;
      uint64_t reservedSpace1:14;
      uint64_t LOCK_IDX:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IDXBLK_L;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IDX8:2;
      uint64_t IDX9:2;
      uint64_t IDX10:2;
      uint64_t IDX11:2;
      uint64_t IDX12:2;
      uint64_t IDX13:2;
      uint64_t IDX14:2;
      uint64_t IDX15:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IDXBLK_H_DP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t KEYMASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) KEYMASK_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t KEYMASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) KEYMASK_1;

  uint8_t res7[56];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IDX8:2;
      uint64_t IDX9:2;
      uint64_t IDX10:2;
      uint64_t IDX11:2;
      uint64_t IDX12:2;
      uint64_t IDX13:2;
      uint64_t IDX14:2;
      uint64_t IDX15:2;
      uint64_t reservedSpace0:14;
      uint64_t LOCK_IDX:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IDXBLK_H;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IDX0:2;
      uint64_t IDX1:2;
      uint64_t IDX2:2;
      uint64_t IDX3:2;
      uint64_t IDX4:2;
      uint64_t IDX5:2;
      uint64_t IDX6:2;
      uint64_t IDX7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IDXBLK_L_DP;

};

#define PUF (*(volatile struct PUF_tag *) 0x40006000)

struct WWDT0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t WDEN:1;
      uint64_t WDRESET:1;
      uint64_t WDTOF:1;
      uint64_t WDINT:1;
      uint64_t WDPROTECT:1;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MOD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEED:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FEED;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TV;

