iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/IMXRT685_RAM_GCC/targetInit/iMXRT685_sfr.h
  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WARNINT:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WARNINT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WINDOW:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WINDOW;

};

#define WWDT0 (*(volatile struct WWDT0_tag *) 0x4000e000)

struct WWDT1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t WDEN:1;
      uint64_t WDRESET:1;
      uint64_t WDTOF:1;
      uint64_t WDINT:1;
      uint64_t WDPROTECT:1;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MOD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEED:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FEED;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TV;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WARNINT:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WARNINT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WINDOW:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WINDOW;

};

#define WWDT1 (*(volatile struct WWDT1_tag *) 0x4002e000)

struct UTICK0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t DELAYVAL:31;
      uint64_t REPEAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTR:1;
      uint64_t ACTIVE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAPEN0:1;
      uint64_t CAPEN1:1;
      uint64_t CAPEN2:1;
      uint64_t CAPEN3:1;
      uint64_t reservedSpace0:4;
      uint64_t CAPPOL0:1;
      uint64_t CAPPOL1:1;
      uint64_t CAPPOL2:1;
      uint64_t CAPPOL3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAPCLR0:1;
      uint64_t CAPCLR1:1;
      uint64_t CAPCLR2:1;
      uint64_t CAPCLR3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAPCLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAP_VALUE:31;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAP_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAP_VALUE:31;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAP_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAP_VALUE:31;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAP_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAP_VALUE:31;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAP_3;

};

#define UTICK0 (*(volatile struct UTICK0_tag *) 0x4000f000)

struct RSTCTL1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t VDD_POR:1;
      uint64_t reservedSpace0:3;
      uint64_t PAD_RESET:1;
      uint64_t ARM_APD_RESET:1;
      uint64_t WDT0_RESET:1;
      uint64_t WDT1_RESET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSRSTSTAT;

  uint8_t res0[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t FLEXCOMM0_RST:1;
      uint64_t FLEXCOMM1_RST:1;
      uint64_t FLEXCOMM2_RST:1;
      uint64_t FLEXCOMM3_RST:1;
      uint64_t FLEXCOMM4_RST:1;
      uint64_t FLEXCOMM5_RST:1;
      uint64_t FLEXCOMM6_RST:1;
      uint64_t FLEXCOMM7_RST:1;
      uint64_t reservedSpace1:6;
      uint64_t FLEXCOMM14_SPI_RST:1;
      uint64_t FLEXCOMM15_I2C_RST:1;
      uint64_t DMIC0_RST:1;
      uint64_t reservedSpace2:2;
      uint64_t OSEVT_TIMER_RST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRSTCTL0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HSGPIO0_RST:1;
      uint64_t HSGPIO1_RST:1;
      uint64_t HSGPIO2_RST:1;
      uint64_t HSGPIO3_RST:1;
      uint64_t HSGPIO4_RST:1;
      uint64_t HSGPIO5_RST:1;
      uint64_t HSGPIO6_RST:1;
      uint64_t HSGPIO7_RST:1;
      uint64_t reservedSpace0:8;
      uint64_t CRC_RST:1;
      uint64_t reservedSpace1:6;
      uint64_t DMAC0_RST:1;
      uint64_t DMAC1_RST:1;
      uint64_t reservedSpace2:3;
      uint64_t MU_RST:1;
      uint64_t SEMA_RST:1;
      uint64_t reservedSpace3:1;
      uint64_t FREQME_RST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRSTCTL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CT32BIT0_RST:1;
      uint64_t CT32BIT1_RST:1;
      uint64_t CT32BIT2_RST:1;
      uint64_t CT32BIT3_RST:1;
      uint64_t CT32BIT4_RST:1;
      uint64_t reservedSpace0:3;
      uint64_t MRT0_RST:1;
      uint64_t reservedSpace1:1;
      uint64_t WWDT1_RST:1;
      uint64_t reservedSpace2:5;
      uint64_t I3C0_RST:1;
      uint64_t reservedSpace3:13;
      uint64_t GPIOINTCTL_RST:1;
      uint64_t PIMCTL_RST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRSTCTL2;

  uint8_t res1[36];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t FLEXCOMM0_RST_SET:1;
      uint64_t FLEXCOMM1_RST_SET:1;
      uint64_t FLEXCOMM2_RST_SET:1;
      uint64_t FLEXCOMM3_RST_SET:1;
      uint64_t FLEXCOMM4_RST_SET:1;
      uint64_t FLEXCOMM5_RST_SET:1;
      uint64_t FLEXCOMM6_RST_SET:1;
      uint64_t FLEXCOMM7_RST_SET:1;
      uint64_t reservedSpace1:6;
      uint64_t FLEXCOMM14_SPI_RST_SET:1;
      uint64_t FLEXCOMM15_I2C_RST_SET:1;
      uint64_t DMIC0_RST_SET:1;
      uint64_t reservedSpace2:2;
      uint64_t OSEVT_TIMER_RST_SET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRSTCTL0_SET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HSGPIO0_RST_SET:1;
      uint64_t HSGPIO1_RST_SET:1;
      uint64_t HSGPIO2_RST_SET:1;
      uint64_t HSGPIO3_RST_SET:1;
      uint64_t HSGPIO4_RST_SET:1;
      uint64_t HSGPIO5_RST_SET:1;
      uint64_t HSGPIO6_RST_SET:1;
      uint64_t HSGPIO7_RST_SET:1;
      uint64_t reservedSpace0:8;
      uint64_t CRC_RST_SET:1;
      uint64_t reservedSpace1:6;
      uint64_t DMAC0_RST_SET:1;
      uint64_t DMAC1_RST_SET:1;
      uint64_t reservedSpace2:3;
      uint64_t MU_RST_SET:1;
      uint64_t SEMA_RST_SET:1;
      uint64_t reservedSpace3:1;
      uint64_t FREQME_RST_SET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRSTCTL1_SET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CT32BIT0_RST_SET:1;
      uint64_t CT32BIT1_RST_SET:1;
      uint64_t CT32BIT2_RST_SET:1;
      uint64_t CT32BIT3_RST_SET:1;
      uint64_t CT32BIT4_RST_SET:1;
      uint64_t reservedSpace0:3;
      uint64_t MRT0_RST_SET:1;
      uint64_t reservedSpace1:1;
      uint64_t WWDT1_RST_SET:1;
      uint64_t reservedSpace2:5;
      uint64_t I3C0_RST_SET:1;
      uint64_t reservedSpace3:13;
      uint64_t GPIOINTCTL_RST_SET:1;
      uint64_t PIMCTL_RST_SET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRSTCTL2_SET;

  uint8_t res2[36];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t FLEXCOMM0_RST_CLR:1;
      uint64_t FLEXCOMM1_RST_CLR:1;
      uint64_t FLEXCOMM2_RST_CLR:1;
      uint64_t FLEXCOMM3_RST_CLR:1;
      uint64_t FLEXCOMM4_RST_CLR:1;
      uint64_t FLEXCOMM5_RST_CLR:1;
      uint64_t FLEXCOMM6_RST_CLR:1;
      uint64_t FLEXCOMM7_RST_CLR:1;
      uint64_t reservedSpace1:6;
      uint64_t FLEXCOMM14_SPI_RST_CLR:1;
      uint64_t FLEXCOMM15_I2C_RST_CLR:1;
      uint64_t DMIC0_RST_CLR:1;
      uint64_t reservedSpace2:2;
      uint64_t OSEVT_TIMER_RST_CLR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRSTCTL0_CLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HSGPIO0_RST_CLR:1;
      uint64_t HSGPIO1_RST_CLR:1;
      uint64_t HSGPIO2_RST_CLR:1;
      uint64_t HSGPIO3_RST_CLR:1;
      uint64_t HSGPIO4_RST_CLR:1;
      uint64_t HSGPIO5_RST_CLR:1;
      uint64_t HSGPIO6_RST_CLR:1;
      uint64_t HSGPIO7_RST_CLR:1;
      uint64_t reservedSpace0:8;
      uint64_t CRC_RST_CLR:1;
      uint64_t reservedSpace1:6;
      uint64_t DMAC0_RST_CLR:1;
      uint64_t DMAC1_RST_CLR:1;
      uint64_t reservedSpace2:3;
      uint64_t MU_RST_CLR:1;
      uint64_t SEMA_RST_CLR:1;
      uint64_t reservedSpace3:1;
      uint64_t FREQME_RST_CLR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRSTCTL1_CLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CT32BIT0_RST_CLR:1;
      uint64_t CT32BIT1_RST_CLR:1;
      uint64_t CT32BIT2_RST_CLR:1;
      uint64_t CT32BIT3_RST_CLR:1;
      uint64_t CT32BIT4_RST_CLR:1;
      uint64_t reservedSpace0:3;
      uint64_t MRT0_RST_CLR:1;
      uint64_t reservedSpace1:1;
      uint64_t WWDT1_RST_CLR:1;
      uint64_t reservedSpace2:5;
      uint64_t I3C0_RST_CLR:1;
      uint64_t reservedSpace3:13;
      uint64_t GPIOINTCTL_RST_CLR:1;
      uint64_t PIMCTL_RST_CLR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRSTCTL2_CLR;

