iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/IMXRT685_RAM_GCC/targetInit/iMXRT685_sfr.h
};

#define RSTCTL1 (*(volatile struct RSTCTL1_tag *) 0x40020000)

struct CLKCTL1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t FC0_CLK:1;
      uint64_t FC1_CLK:1;
      uint64_t FC2_CLK:1;
      uint64_t FC3_CLK:1;
      uint64_t FC4_CLK:1;
      uint64_t FC5_CLK:1;
      uint64_t FC6_CLK:1;
      uint64_t FC7_CLK:1;
      uint64_t reservedSpace1:6;
      uint64_t FC14_SPI_CLK:1;
      uint64_t FC15_I2C_CLK:1;
      uint64_t DMIC0_CLK:1;
      uint64_t reservedSpace2:2;
      uint64_t OSEVENT_TIMER_CLK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PSCCTL0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HSGPIO0_CLK:1;
      uint64_t HSGPIO1_CLK:1;
      uint64_t HSGPIO2_CLK:1;
      uint64_t HSGPIO3_CLK:1;
      uint64_t HSGPIO4_CLK:1;
      uint64_t HSGPIO5_CLK:1;
      uint64_t HSGPIO6_CLK:1;
      uint64_t HSGPIO7_CLK:1;
      uint64_t reservedSpace0:8;
      uint64_t CRC_CLK:1;
      uint64_t reservedSpace1:6;
      uint64_t DMAC0_CLK:1;
      uint64_t DMAC1_CLK:1;
      uint64_t reservedSpace2:3;
      uint64_t MU_CLK:1;
      uint64_t SEMA_CLK:1;
      uint64_t reservedSpace3:1;
      uint64_t FREQME_CLK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PSCCTL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CT32BIT0_CLK:1;
      uint64_t CT32BIT1_CLK:1;
      uint64_t CT32BIT2_CLK:1;
      uint64_t CT32BIT3_CLK:1;
      uint64_t CT32BIT4_CLK:1;
      uint64_t reservedSpace0:2;
      uint64_t RTC_LITE_CLK:1;
      uint64_t MRT0_CLK:1;
      uint64_t reservedSpace1:1;
      uint64_t WWDT1_CLK:1;
      uint64_t reservedSpace2:5;
      uint64_t I3C0_CLK:1;
      uint64_t reservedSpace3:13;
      uint64_t GPIOINTCTL_CLK:1;
      uint64_t PIMCTL_CLK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PSCCTL2;

  uint8_t res0[36];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t FC0_CLK_SET:1;
      uint64_t FC1_CLK_SET:1;
      uint64_t FC2_CLK_SET:1;
      uint64_t FC3_CLK_SET:1;
      uint64_t FC4_CLK_SET:1;
      uint64_t FC5_CLK_SET:1;
      uint64_t FC6_CLK_SET:1;
      uint64_t FC7_CLK_SET:1;
      uint64_t reservedSpace1:6;
      uint64_t FC14_SPI_CLK_SET:1;
      uint64_t FC15_I2C_CLK_SET:1;
      uint64_t DMIC0_CLK_SET:1;
      uint64_t reservedSpace2:2;
      uint64_t OSEVENT_TIMER_CLK_SET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PSCCTL0_SET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HSGPIO0_CLK_SET:1;
      uint64_t HSGPIO1_CLK_SET:1;
      uint64_t HSGPIO2_CLK_SET:1;
      uint64_t HSGPIO3_CLK_SET:1;
      uint64_t HSGPIO4_CLK_SET:1;
      uint64_t HSGPIO5_CLK_SET:1;
      uint64_t HSGPIO6_CLK_SET:1;
      uint64_t HSGPIO7_CLK_SET:1;
      uint64_t reservedSpace0:8;
      uint64_t CRC_CLK_SET:1;
      uint64_t reservedSpace1:6;
      uint64_t DMAC0_CLK_SET:1;
      uint64_t DMAC1_CLK_SET:1;
      uint64_t reservedSpace2:3;
      uint64_t MU_CLK_SET:1;
      uint64_t SEMA_CLK_SET:1;
      uint64_t reservedSpace3:1;
      uint64_t FREQME_CLK_SET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PSCCTL1_SET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CT32BIT0_CLK_SET:1;
      uint64_t CT32BIT1_CLK_SET:1;
      uint64_t CT32BIT2_CLK_SET:1;
      uint64_t CT32BIT3_CLK_SET:1;
      uint64_t CT32BIT4_CLK_SET:1;
      uint64_t reservedSpace0:2;
      uint64_t RTC_LITE_CLK_SET:1;
      uint64_t MRT0_CLK_SET:1;
      uint64_t reservedSpace1:1;
      uint64_t WWDT1_CLK_SET:1;
      uint64_t reservedSpace2:5;
      uint64_t I3C0_CLK_SET:1;
      uint64_t reservedSpace3:13;
      uint64_t GPIOINTCTL_CLK_SET:1;
      uint64_t PIMCTL_CLK_SET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PSCCTL2_SET;

  uint8_t res1[36];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t FC0_CLK_CLR:1;
      uint64_t FC1_CLK_CLR:1;
      uint64_t FC2_CLK_CLR:1;
      uint64_t FC3_CLK_CLR:1;
      uint64_t FC4_CLK_CLR:1;
      uint64_t FC5_CLK_CLR:1;
      uint64_t FC6_CLK_CLR:1;
      uint64_t FC7_CLK_CLR:1;
      uint64_t reservedSpace1:6;
      uint64_t FC14_SPI_CLK_CLR:1;
      uint64_t FC15_I2C_CLK_CLR:1;
      uint64_t DMIC0_CLK_CLR:1;
      uint64_t reservedSpace2:2;
      uint64_t OSEVENT_TIMER_CLK_CLR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PSCCTL0_CLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HSGPIO0_CLK_CLR:1;
      uint64_t HSGPIO1_CLK_CLR:1;
      uint64_t HSGPIO2_CLK_CLR:1;
      uint64_t HSGPIO3_CLK_CLR:1;
      uint64_t HSGPIO4_CLK_CLR:1;
      uint64_t HSGPIO5_CLK_CLR:1;
      uint64_t HSGPIO6_CLK_CLR:1;
      uint64_t HSGPIO7_CLK_CLR:1;
      uint64_t reservedSpace0:8;
      uint64_t CRC_CLK_CLR:1;
      uint64_t reservedSpace1:6;
      uint64_t DMAC0_CLK_CLR:1;
      uint64_t DMAC1_CLK_CLR:1;
      uint64_t reservedSpace2:3;
      uint64_t MU_CLK_CLR:1;
      uint64_t SEMA_CLK_CLR:1;
      uint64_t reservedSpace3:1;
      uint64_t FREQME_CLK_CLR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PSCCTL1_CLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CT32BIT0_CLK_CLR:1;
      uint64_t CT32BIT1_CLK_CLR:1;
      uint64_t CT32BIT2_CLK_CLR:1;
      uint64_t CT32BIT3_CLK_CLR:1;
      uint64_t CT32BIT4_CLK_CLR:1;
      uint64_t reservedSpace0:2;
      uint64_t RTC_LITE_CLK_CLR:1;
      uint64_t MRT0_CLK_CLR:1;
      uint64_t reservedSpace1:1;
      uint64_t WWDT1_CLK_CLR:1;
      uint64_t reservedSpace2:5;
      uint64_t I3C0_CLK_CLR:1;
      uint64_t reservedSpace3:13;
      uint64_t GPIOINTCTL_CLK_CLR:1;
      uint64_t PIMCTL_CLK_CLR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PSCCTL2_CLR;

  uint8_t res2[388];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AUDIOPLL0CLKSEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BYPASS:1;
      uint64_t RESET:1;
      uint64_t reservedSpace0:11;
      uint64_t HOLDRINGOFF_ENA:1;
      uint64_t reservedSpace1:2;
      uint64_t MULT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AUDIOPLL0CTL0;

