iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/IMXRT685_RAM_GCC/targetInit/iMXRT685_sfr.h
  uint8_t res3[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKTIMEDIV2:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AUDIOPLL0LOCKTIMEDIV2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NUM:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AUDIOPLL0NUM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DENOM:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AUDIOPLL0DENOM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PFD0:6;
      uint64_t PFD0_CLKRDY:1;
      uint64_t PFD0_CLKGATE:1;
      uint64_t PFD1:6;
      uint64_t PFD1_CLKRDY:1;
      uint64_t PFD1_CLKGATE:1;
      uint64_t PFD2:6;
      uint64_t PFD2_CLKRDY:1;
      uint64_t PFD2_CLKGATE:1;
      uint64_t PFD3:6;
      uint64_t PFD3_CLKRDY:1;
      uint64_t PFD3_CLKGATE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AUDIOPLL0PFD;

  uint8_t res4[36];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV:8;
      uint64_t reservedSpace0:21;
      uint64_t RESET:1;
      uint64_t HALT:1;
      uint64_t REQFLAG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AUDIOPLLCLKDIV;

  uint8_t res5[444];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV:8;
      uint64_t reservedSpace0:21;
      uint64_t RESET:1;
      uint64_t HALT:1;
      uint64_t REQFLAG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSPCPUCLKDIV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DSPMRAMCLKDIV:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSPMAINRAMCLKDIV;

  uint8_t res6[40];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSPCPUCLKSELA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSPCPUCLKSELB;

  uint8_t res7[72];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OSEVENTFCLKSEL;

  uint8_t res8[572];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FRG14CLKSEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV:8;
      uint64_t MULT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FRG14CTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FC14FCLKSEL;

  uint8_t res9[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FRG15CLKSEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV:8;
      uint64_t MULT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FRG15CTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FC15FCLKSEL;

  uint8_t res10[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV:8;
      uint64_t reservedSpace0:21;
      uint64_t RESET:1;
      uint64_t HALT:1;
      uint64_t REQFLAG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FRGPLLCLKDIV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMIC0FCLKSEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV:8;
      uint64_t reservedSpace0:21;
      uint64_t RESET:1;
      uint64_t HALT:1;
      uint64_t REQFLAG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMIC0FCLKDIV;

  uint8_t res11[24];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CT32BITFCLKSEL0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CT32BITFCLKSEL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CT32BITFCLKSEL2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CT32BITFCLKSEL3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CT32BITFCLKSEL4;

  uint8_t res12[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AUDIOMCLKSEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV:8;
      uint64_t reservedSpace0:21;
      uint64_t RESET:1;
      uint64_t HALT:1;
      uint64_t REQFLAG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AUDIOMCLKDIV;

  uint8_t res13[24];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLKOUTSEL0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLKOUTSEL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV:8;
      uint64_t reservedSpace0:21;
      uint64_t RESET:1;
      uint64_t HALT:1;
      uint64_t REQFLAG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLKOUTDIV;

  uint8_t res14[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I3C0FCLKSEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I3C0FCLKSTCSEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV:8;
      uint64_t reservedSpace0:21;
      uint64_t RESET:1;
      uint64_t HALT:1;
      uint64_t REQFLAG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I3C0FCLKSTCDIV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV:8;
      uint64_t reservedSpace0:21;
      uint64_t RESET:1;
      uint64_t HALT:1;
      uint64_t REQFLAG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I3C0FCLKSDIV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV:8;
      uint64_t reservedSpace0:21;
      uint64_t RESET:1;
      uint64_t HALT:1;
      uint64_t REQFLAG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I3C0FCLKDIV;

