iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/IMXRT685_RAM_GCC/targetInit/iMXRT685_sfr.h
  uint8_t res15[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WDT1FCLKSEL;

  uint8_t res16[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ACMP0FCLKSEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV:8;
      uint64_t reservedSpace0:21;
      uint64_t RESET:1;
      uint64_t HALT:1;
      uint64_t REQFLAG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ACMP0FCLKDIV;

};

#define CLKCTL1 (*(volatile struct CLKCTL1_tag *) 0x40021010)

struct CLKCTL1_FLEXCOMM_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FRGCLKSEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV:8;
      uint64_t MULT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FRGCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FCFCLKSEL;

};

#define CLKCTL1_FLEXCOMM_0 (*(volatile struct CLKCTL1_FLEXCOMM_0_tag *) 0x40021500)

struct CLKCTL1_FLEXCOMM_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FRGCLKSEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV:8;
      uint64_t MULT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FRGCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FCFCLKSEL;

};

#define CLKCTL1_FLEXCOMM_1 (*(volatile struct CLKCTL1_FLEXCOMM_1_tag *) 0x40021520)

struct CLKCTL1_FLEXCOMM_2_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FRGCLKSEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV:8;
      uint64_t MULT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FRGCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FCFCLKSEL;

};

#define CLKCTL1_FLEXCOMM_2 (*(volatile struct CLKCTL1_FLEXCOMM_2_tag *) 0x40021540)

struct CLKCTL1_FLEXCOMM_3_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FRGCLKSEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV:8;
      uint64_t MULT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FRGCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FCFCLKSEL;

};

#define CLKCTL1_FLEXCOMM_3 (*(volatile struct CLKCTL1_FLEXCOMM_3_tag *) 0x40021560)

struct CLKCTL1_FLEXCOMM_4_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FRGCLKSEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV:8;
      uint64_t MULT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FRGCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FCFCLKSEL;

};

#define CLKCTL1_FLEXCOMM_4 (*(volatile struct CLKCTL1_FLEXCOMM_4_tag *) 0x40021580)

struct CLKCTL1_FLEXCOMM_5_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FRGCLKSEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV:8;
      uint64_t MULT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FRGCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FCFCLKSEL;

};

#define CLKCTL1_FLEXCOMM_5 (*(volatile struct CLKCTL1_FLEXCOMM_5_tag *) 0x400215a0)

struct CLKCTL1_FLEXCOMM_6_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FRGCLKSEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV:8;
      uint64_t MULT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FRGCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FCFCLKSEL;

};

#define CLKCTL1_FLEXCOMM_6 (*(volatile struct CLKCTL1_FLEXCOMM_6_tag *) 0x400215c0)

struct CLKCTL1_FLEXCOMM_7_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FRGCLKSEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV:8;
      uint64_t MULT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FRGCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FCFCLKSEL;

};

#define CLKCTL1_FLEXCOMM_7 (*(volatile struct CLKCTL1_FLEXCOMM_7_tag *) 0x400215e0)

struct SYSCTL1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t MCLKPINDIR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCLKPINDIR;

  uint8_t res0[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NMISRCSEL:5;
      uint64_t reservedSpace0:26;
      uint64_t NMIEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSPNMISRCSEL;

  uint8_t res1[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SCKINSEL:2;
      uint64_t reservedSpace0:6;
      uint64_t WSINSEL:2;
      uint64_t reservedSpace1:6;
      uint64_t DATAINSEL:2;
      uint64_t reservedSpace2:6;
      uint64_t DATAOUTSEL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FCCTRLSEL0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SCKINSEL:2;
      uint64_t reservedSpace0:6;
      uint64_t WSINSEL:2;
      uint64_t reservedSpace1:6;
      uint64_t DATAINSEL:2;
      uint64_t reservedSpace2:6;
      uint64_t DATAOUTSEL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FCCTRLSEL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SCKINSEL:2;
      uint64_t reservedSpace0:6;
      uint64_t WSINSEL:2;
      uint64_t reservedSpace1:6;
      uint64_t DATAINSEL:2;
      uint64_t reservedSpace2:6;
      uint64_t DATAOUTSEL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FCCTRLSEL2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SCKINSEL:2;
      uint64_t reservedSpace0:6;
      uint64_t WSINSEL:2;
      uint64_t reservedSpace1:6;
      uint64_t DATAINSEL:2;
      uint64_t reservedSpace2:6;
      uint64_t DATAOUTSEL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FCCTRLSEL3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SCKINSEL:2;
      uint64_t reservedSpace0:6;
      uint64_t WSINSEL:2;
      uint64_t reservedSpace1:6;
      uint64_t DATAINSEL:2;
      uint64_t reservedSpace2:6;
      uint64_t DATAOUTSEL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FCCTRLSEL4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SCKINSEL:2;
      uint64_t reservedSpace0:6;
      uint64_t WSINSEL:2;
      uint64_t reservedSpace1:6;
      uint64_t DATAINSEL:2;
      uint64_t reservedSpace2:6;
      uint64_t DATAOUTSEL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FCCTRLSEL5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SCKINSEL:2;
      uint64_t reservedSpace0:6;
      uint64_t WSINSEL:2;
      uint64_t reservedSpace1:6;
      uint64_t DATAINSEL:2;
      uint64_t reservedSpace2:6;
      uint64_t DATAOUTSEL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FCCTRLSEL6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SCKINSEL:2;
      uint64_t reservedSpace0:6;
      uint64_t WSINSEL:2;
      uint64_t reservedSpace1:6;
      uint64_t DATAINSEL:2;
      uint64_t reservedSpace2:6;
      uint64_t DATAOUTSEL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FCCTRLSEL7;

  uint8_t res2[32];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SHAREDSCKSEL:3;
      uint64_t reservedSpace0:1;
      uint64_t SHAREDWSSEL:3;
      uint64_t reservedSpace1:1;
      uint64_t SHAREDDATASEL:3;
      uint64_t reservedSpace2:5;
      uint64_t FC0DATAOUTEN:1;
      uint64_t FC1DATAOUTEN:1;
      uint64_t F20DATAOUTEN:1;
      uint64_t FC3DATAOUTEN:1;
      uint64_t FC4DATAOUTEN:1;
      uint64_t FC5DATAOUTEN:1;
      uint64_t FC6DATAOUTEN:1;
      uint64_t FC7DATAOUTEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHAREDCTRLSET0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SHAREDSCKSEL:3;
      uint64_t reservedSpace0:1;
      uint64_t SHAREDWSSEL:3;
      uint64_t reservedSpace1:1;
      uint64_t SHAREDDATASEL:3;
      uint64_t reservedSpace2:5;
      uint64_t FC0DATAOUTEN:1;
      uint64_t FC1DATAOUTEN:1;
      uint64_t F20DATAOUTEN:1;
      uint64_t FC3DATAOUTEN:1;
      uint64_t FC4DATAOUTEN:1;
      uint64_t FC5DATAOUTEN:1;
      uint64_t FC6DATAOUTEN:1;
      uint64_t FC7DATAOUTEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHAREDCTRLSET1;

  uint8_t res3[376];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXEVPULSEGEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXEVPULSEGEN;

