iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/IMXRT685_RAM_GCC/targetInit/iMXRT685_sfr.h
};

#define SYSCTL1 (*(volatile struct SYSCTL1_tag *) 0x40022010)

struct PINT_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PMODE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ISEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENRL:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IENR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SETENRL:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SIENR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CENRL:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CIENR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENAF:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IENF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SETENAF:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SIENF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CENAF:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CIENF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RDET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RISE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FDET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FALL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PSTAT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IST;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL_PMATCH:1;
      uint64_t ENA_RXEV:1;
      uint64_t reservedSpace0:22;
      uint64_t PMAT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PMCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t SRC0:3;
      uint64_t SRC1:3;
      uint64_t SRC2:3;
      uint64_t SRC3:3;
      uint64_t SRC4:3;
      uint64_t SRC5:3;
      uint64_t SRC6:3;
      uint64_t SRC7:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PMSRC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROD_ENDPTS0:1;
      uint64_t PROD_ENDPTS1:1;
      uint64_t PROD_ENDPTS2:1;
      uint64_t PROD_ENDPTS3:1;
      uint64_t PROD_ENDPTS4:1;
      uint64_t PROD_ENDPTS5:1;
      uint64_t PROD_ENDPTS6:1;
      uint64_t reservedSpace0:1;
      uint64_t CFG0:3;
      uint64_t CFG1:3;
      uint64_t CFG2:3;
      uint64_t CFG3:3;
      uint64_t CFG4:3;
      uint64_t CFG5:3;
      uint64_t CFG6:3;
      uint64_t CFG7:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PMCFG;

};

#define PINT (*(volatile struct PINT_tag *) 0x40025000)

struct INPUTMUX_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SCT_IN_SEL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCT0_IN_SEL0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SCT_IN_SEL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCT0_IN_SEL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SCT_IN_SEL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCT0_IN_SEL2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SCT_IN_SEL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCT0_IN_SEL3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SCT_IN_SEL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCT0_IN_SEL4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SCT_IN_SEL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCT0_IN_SEL5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SCT_IN_SEL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCT0_IN_SEL6;

  uint8_t res0[228];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PINT_SEL:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PINT_SEL0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PINT_SEL:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PINT_SEL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PINT_SEL:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PINT_SEL2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PINT_SEL:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PINT_SEL3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PINT_SEL:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PINT_SEL4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PINT_SEL:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PINT_SEL5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PINT_SEL:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PINT_SEL6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PINT_SEL:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PINT_SEL7;

  uint8_t res1[32];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DSP_INT_SEL:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSP_INT_SEL_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DSP_INT_SEL:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSP_INT_SEL_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DSP_INT_SEL:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSP_INT_SEL_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DSP_INT_SEL:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSP_INT_SEL_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DSP_INT_SEL:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSP_INT_SEL_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DSP_INT_SEL:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSP_INT_SEL_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DSP_INT_SEL:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSP_INT_SEL_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DSP_INT_SEL:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSP_INT_SEL_7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DSP_INT_SEL:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSP_INT_SEL_8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DSP_INT_SEL:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSP_INT_SEL_9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DSP_INT_SEL:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSP_INT_SEL_10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DSP_INT_SEL:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSP_INT_SEL_11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DSP_INT_SEL:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSP_INT_SEL_12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DSP_INT_SEL:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSP_INT_SEL_13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DSP_INT_SEL:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSP_INT_SEL_14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DSP_INT_SEL:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSP_INT_SEL_15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DSP_INT_SEL:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSP_INT_SEL_16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DSP_INT_SEL:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSP_INT_SEL_17;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DSP_INT_SEL:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSP_INT_SEL_18;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DSP_INT_SEL:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSP_INT_SEL_19;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DSP_INT_SEL:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSP_INT_SEL_20;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DSP_INT_SEL:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSP_INT_SEL_21;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DSP_INT_SEL:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSP_INT_SEL_22;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DSP_INT_SEL:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSP_INT_SEL_23;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DSP_INT_SEL:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSP_INT_SEL_24;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DSP_INT_SEL:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSP_INT_SEL_25;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DSP_INT_SEL:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSP_INT_SEL_26;

