iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/IMXRT685_RAM_GCC/targetInit/iMXRT685_sfr.h
  uint8_t res2[84];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA0_ITRIG_SEL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC0_ITRIG_SEL_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA0_ITRIG_SEL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC0_ITRIG_SEL_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA0_ITRIG_SEL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC0_ITRIG_SEL_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA0_ITRIG_SEL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC0_ITRIG_SEL_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA0_ITRIG_SEL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC0_ITRIG_SEL_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA0_ITRIG_SEL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC0_ITRIG_SEL_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA0_ITRIG_SEL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC0_ITRIG_SEL_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA0_ITRIG_SEL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC0_ITRIG_SEL_7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA0_ITRIG_SEL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC0_ITRIG_SEL_8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA0_ITRIG_SEL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC0_ITRIG_SEL_9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA0_ITRIG_SEL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC0_ITRIG_SEL_10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA0_ITRIG_SEL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC0_ITRIG_SEL_11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA0_ITRIG_SEL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC0_ITRIG_SEL_12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA0_ITRIG_SEL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC0_ITRIG_SEL_13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA0_ITRIG_SEL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC0_ITRIG_SEL_14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA0_ITRIG_SEL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC0_ITRIG_SEL_15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA0_ITRIG_SEL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC0_ITRIG_SEL_16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA0_ITRIG_SEL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC0_ITRIG_SEL_17;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA0_ITRIG_SEL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC0_ITRIG_SEL_18;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA0_ITRIG_SEL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC0_ITRIG_SEL_19;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA0_ITRIG_SEL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC0_ITRIG_SEL_20;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA0_ITRIG_SEL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC0_ITRIG_SEL_21;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA0_ITRIG_SEL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC0_ITRIG_SEL_22;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA0_ITRIG_SEL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC0_ITRIG_SEL_23;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA0_ITRIG_SEL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC0_ITRIG_SEL_24;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA0_ITRIG_SEL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC0_ITRIG_SEL_25;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA0_ITRIG_SEL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC0_ITRIG_SEL_26;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA0_ITRIG_SEL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC0_ITRIG_SEL_27;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA0_ITRIG_SEL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC0_ITRIG_SEL_28;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA0_ITRIG_SEL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC0_ITRIG_SEL_29;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA0_ITRIG_SEL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC0_ITRIG_SEL_30;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA0_ITRIG_SEL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC0_ITRIG_SEL_31;

  uint8_t res3[128];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMAC0_OTRIG_SEL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC0_OTRIG_SEL0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMAC0_OTRIG_SEL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC0_OTRIG_SEL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMAC0_OTRIG_SEL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC0_OTRIG_SEL2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMAC0_OTRIG_SEL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC0_OTRIG_SEL3;

  uint8_t res4[240];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA1_ITRIG_SEL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC1_ITRIG_SEL_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA1_ITRIG_SEL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC1_ITRIG_SEL_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA1_ITRIG_SEL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC1_ITRIG_SEL_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA1_ITRIG_SEL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC1_ITRIG_SEL_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA1_ITRIG_SEL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC1_ITRIG_SEL_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA1_ITRIG_SEL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC1_ITRIG_SEL_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA1_ITRIG_SEL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC1_ITRIG_SEL_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA1_ITRIG_SEL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC1_ITRIG_SEL_7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA1_ITRIG_SEL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC1_ITRIG_SEL_8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA1_ITRIG_SEL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC1_ITRIG_SEL_9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA1_ITRIG_SEL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC1_ITRIG_SEL_10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA1_ITRIG_SEL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC1_ITRIG_SEL_11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA1_ITRIG_SEL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC1_ITRIG_SEL_12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA1_ITRIG_SEL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC1_ITRIG_SEL_13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA1_ITRIG_SEL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC1_ITRIG_SEL_14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA1_ITRIG_SEL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC1_ITRIG_SEL_15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA1_ITRIG_SEL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC1_ITRIG_SEL_16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA1_ITRIG_SEL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC1_ITRIG_SEL_17;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA1_ITRIG_SEL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC1_ITRIG_SEL_18;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA1_ITRIG_SEL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC1_ITRIG_SEL_19;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA1_ITRIG_SEL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC1_ITRIG_SEL_20;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA1_ITRIG_SEL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC1_ITRIG_SEL_21;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA1_ITRIG_SEL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC1_ITRIG_SEL_22;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA1_ITRIG_SEL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC1_ITRIG_SEL_23;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA1_ITRIG_SEL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC1_ITRIG_SEL_24;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA1_ITRIG_SEL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC1_ITRIG_SEL_25;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA1_ITRIG_SEL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC1_ITRIG_SEL_26;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA1_ITRIG_SEL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC1_ITRIG_SEL_27;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA1_ITRIG_SEL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC1_ITRIG_SEL_28;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA1_ITRIG_SEL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC1_ITRIG_SEL_29;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA1_ITRIG_SEL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC1_ITRIG_SEL_30;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA1_ITRIG_SEL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC1_ITRIG_SEL_31;

  uint8_t res5[128];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMAC1_OTRIG_SEL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC1_OTRIG_SEL0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMAC1_OTRIG_SEL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC1_OTRIG_SEL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMAC1_OTRIG_SEL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC1_OTRIG_SEL2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMAC1_OTRIG_SEL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC1_OTRIG_SEL3;

  uint8_t res6[496];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FMEASURE_SEL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FMEASURE_CH_SEL0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FMEASURE_SEL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FMEASURE_CH_SEL1;

