iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/IMXRT685_RAM_GCC/targetInit/iMXRT685_sfr.h
  uint8_t res7[56];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLEXCOMM0_RX:1;
      uint64_t FLEXCOMM0_TX:1;
      uint64_t FLEXCOMM1_RX:1;
      uint64_t FLEXCOMM1_TX:1;
      uint64_t FLEXCOMM2_RX:1;
      uint64_t FLEXCOMM2_TX:1;
      uint64_t FLEXCOMM3_RX:1;
      uint64_t FLEXCOMM3_TX:1;
      uint64_t FLEXCOMM4_RX:1;
      uint64_t FLEXCOMM4_TX:1;
      uint64_t FLEXCOMM5_RX:1;
      uint64_t FLEXCOMM5_TX:1;
      uint64_t FLEXCOMM6_RX:1;
      uint64_t FLEXCOMM6_TX:1;
      uint64_t FLEXCOMM7_RX:1;
      uint64_t FLEXCOMM7_TX:1;
      uint64_t DMIC0CH0:1;
      uint64_t DMIC0CH1:1;
      uint64_t DMIC0CH2:1;
      uint64_t DMIC0CH3:1;
      uint64_t DMIC0CH4:1;
      uint64_t DMIC0CH5:1;
      uint64_t DMIC0CH6:1;
      uint64_t DMIC0CH7:1;
      uint64_t I3C0_RX:1;
      uint64_t I3C0_TX:1;
      uint64_t FLEXCOMM14_RX:1;
      uint64_t FLEXCOMM14_TX:1;
      uint64_t FLEXSPI_RX:1;
      uint64_t FLEXSPI_TX:1;
      uint64_t HASHCRYPT_bitfield:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC0_REQ_ENA0;

  uint8_t res8[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLEXCOMM0_RX:1;
      uint64_t FLEXCOMM0_TX:1;
      uint64_t FLEXCOMM1_RX:1;
      uint64_t FLEXCOMM1_TX:1;
      uint64_t FLEXCOMM2_RX:1;
      uint64_t FLEXCOMM2_TX:1;
      uint64_t FLEXCOMM3_RX:1;
      uint64_t FLEXCOMM3_TX:1;
      uint64_t FLEXCOMM4_RX:1;
      uint64_t FLEXCOMM4_TX:1;
      uint64_t FLEXCOMM5_RX:1;
      uint64_t FLEXCOMM5_TX:1;
      uint64_t FLEXCOMM6_RX:1;
      uint64_t FLEXCOMM6_TX:1;
      uint64_t FLEXCOMM7_RX:1;
      uint64_t FLEXCOMM7_TX:1;
      uint64_t DMIC0CH0:1;
      uint64_t DMIC0CH1:1;
      uint64_t DMIC0CH2:1;
      uint64_t DMIC0CH3:1;
      uint64_t DMIC0CH4:1;
      uint64_t DMIC0CH5:1;
      uint64_t DMIC0CH6:1;
      uint64_t DMIC0CH7:1;
      uint64_t I3C0_RX:1;
      uint64_t I3C0_TX:1;
      uint64_t FLEXCOMM14_RX:1;
      uint64_t FLEXCOMM14_TX:1;
      uint64_t FLEXSPI_RX:1;
      uint64_t FLEXSPI_TX:1;
      uint64_t HASHCRYPT_bitfield:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC0_REQ_ENA0_SET;

  uint8_t res9[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLEXCOMM0_RX:1;
      uint64_t FLEXCOMM0_TX:1;
      uint64_t FLEXCOMM1_RX:1;
      uint64_t FLEXCOMM1_TX:1;
      uint64_t FLEXCOMM2_RX:1;
      uint64_t FLEXCOMM2_TX:1;
      uint64_t FLEXCOMM3_RX:1;
      uint64_t FLEXCOMM3_TX:1;
      uint64_t FLEXCOMM4_RX:1;
      uint64_t FLEXCOMM4_TX:1;
      uint64_t FLEXCOMM5_RX:1;
      uint64_t FLEXCOMM5_TX:1;
      uint64_t FLEXCOMM6_RX:1;
      uint64_t FLEXCOMM6_TX:1;
      uint64_t FLEXCOMM7_RX:1;
      uint64_t FLEXCOMM7_TX:1;
      uint64_t DMIC0CH0:1;
      uint64_t DMIC0CH1:1;
      uint64_t DMIC0CH2:1;
      uint64_t DMIC0CH3:1;
      uint64_t DMIC0CH4:1;
      uint64_t DMIC0CH5:1;
      uint64_t DMIC0CH6:1;
      uint64_t DMIC0CH7:1;
      uint64_t I3C0_RX:1;
      uint64_t I3C0_TX:1;
      uint64_t FLEXCOMM14_RX:1;
      uint64_t FLEXCOMM14_TX:1;
      uint64_t FLEXSPI_RX:1;
      uint64_t FLEXSPI_TX:1;
      uint64_t HASHCRYPT_bitfield:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC0_REQ_ENA0_CLR;

  uint8_t res10[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLEXCOMM0_RX:1;
      uint64_t FLEXCOMM0_TX:1;
      uint64_t FLEXCOMM1_RX:1;
      uint64_t FLEXCOMM1_TX:1;
      uint64_t FLEXCOMM2_RX:1;
      uint64_t FLEXCOMM2_TX:1;
      uint64_t FLEXCOMM3_RX:1;
      uint64_t FLEXCOMM3_TX:1;
      uint64_t FLEXCOMM4_RX:1;
      uint64_t FLEXCOMM4_TX:1;
      uint64_t FLEXCOMM5_RX:1;
      uint64_t FLEXCOMM5_TX:1;
      uint64_t FLEXCOMM6_RX:1;
      uint64_t FLEXCOMM6_TX:1;
      uint64_t FLEXCOMM7_RX:1;
      uint64_t FLEXCOMM7_TX:1;
      uint64_t DMIC0CH0:1;
      uint64_t DMIC0CH1:1;
      uint64_t DMIC0CH2:1;
      uint64_t DMIC0CH3:1;
      uint64_t DMIC0CH4:1;
      uint64_t DMIC0CH5:1;
      uint64_t DMIC0CH6:1;
      uint64_t DMIC0CH7:1;
      uint64_t I3C0_RX:1;
      uint64_t I3C0_TX:1;
      uint64_t FLEXCOMM14_RX:1;
      uint64_t FLEXCOMM14_TX:1;
      uint64_t FLEXSPI_RX:1;
      uint64_t FLEXSPI_TX:1;
      uint64_t HASHCRYPT_bitfield:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC1_REQ_ENA0;

  uint8_t res11[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLEXCOMM0_RX:1;
      uint64_t FLEXCOMM0_TX:1;
      uint64_t FLEXCOMM1_RX:1;
      uint64_t FLEXCOMM1_TX:1;
      uint64_t FLEXCOMM2_RX:1;
      uint64_t FLEXCOMM2_TX:1;
      uint64_t FLEXCOMM3_RX:1;
      uint64_t FLEXCOMM3_TX:1;
      uint64_t FLEXCOMM4_RX:1;
      uint64_t FLEXCOMM4_TX:1;
      uint64_t FLEXCOMM5_RX:1;
      uint64_t FLEXCOMM5_TX:1;
      uint64_t FLEXCOMM6_RX:1;
      uint64_t FLEXCOMM6_TX:1;
      uint64_t FLEXCOMM7_RX:1;
      uint64_t FLEXCOMM7_TX:1;
      uint64_t DMIC0CH0:1;
      uint64_t DMIC0CH1:1;
      uint64_t DMIC0CH2:1;
      uint64_t DMIC0CH3:1;
      uint64_t DMIC0CH4:1;
      uint64_t DMIC0CH5:1;
      uint64_t DMIC0CH6:1;
      uint64_t DMIC0CH7:1;
      uint64_t I3C0_RX:1;
      uint64_t I3C0_TX:1;
      uint64_t FLEXCOMM14_RX:1;
      uint64_t FLEXCOMM14_TX:1;
      uint64_t FLEXSPI_RX:1;
      uint64_t FLEXSPI_TX:1;
      uint64_t HASHCRYPT_bitfield:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC1_REQ_ENA0_SET;

  uint8_t res12[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLEXCOMM0_RX:1;
      uint64_t FLEXCOMM0_TX:1;
      uint64_t FLEXCOMM1_RX:1;
      uint64_t FLEXCOMM1_TX:1;
      uint64_t FLEXCOMM2_RX:1;
      uint64_t FLEXCOMM2_TX:1;
      uint64_t FLEXCOMM3_RX:1;
      uint64_t FLEXCOMM3_TX:1;
      uint64_t FLEXCOMM4_RX:1;
      uint64_t FLEXCOMM4_TX:1;
      uint64_t FLEXCOMM5_RX:1;
      uint64_t FLEXCOMM5_TX:1;
      uint64_t FLEXCOMM6_RX:1;
      uint64_t FLEXCOMM6_TX:1;
      uint64_t FLEXCOMM7_RX:1;
      uint64_t FLEXCOMM7_TX:1;
      uint64_t DMIC0CH0:1;
      uint64_t DMIC0CH1:1;
      uint64_t DMIC0CH2:1;
      uint64_t DMIC0CH3:1;
      uint64_t DMIC0CH4:1;
      uint64_t DMIC0CH5:1;
      uint64_t DMIC0CH6:1;
      uint64_t DMIC0CH7:1;
      uint64_t I3C0_RX:1;
      uint64_t I3C0_TX:1;
      uint64_t FLEXCOMM14_RX:1;
      uint64_t FLEXCOMM14_TX:1;
      uint64_t FLEXSPI_RX:1;
      uint64_t FLEXSPI_TX:1;
      uint64_t HASHCRYPT_bitfield:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC1_REQ_ENA0_CLR;

  uint8_t res13[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMAC0_ITRIG_INMUX0:1;
      uint64_t DMAC0_ITRIG_INMUX1:1;
      uint64_t DMAC0_ITRIG_INMUX2:1;
      uint64_t DMAC0_ITRIG_INMUX3:1;
      uint64_t DMAC0_ITRIG_INMUX4:1;
      uint64_t DMAC0_ITRIG_INMUX5:1;
      uint64_t DMAC0_ITRIG_INMUX6:1;
      uint64_t DMAC0_ITRIG_INMUX7:1;
      uint64_t DMAC0_ITRIG_INMUX8:1;
      uint64_t DMAC0_ITRIG_INMUX9:1;
      uint64_t DMAC0_ITRIG_INMUX10:1;
      uint64_t DMAC0_ITRIG_INMUX11:1;
      uint64_t DMAC0_ITRIG_INMUX12:1;
      uint64_t DMAC0_ITRIG_INMUX13:1;
      uint64_t DMAC0_ITRIG_INMUX14:1;
      uint64_t DMAC0_ITRIG_INMUX15:1;
      uint64_t DMAC0_ITRIG_INMUX16:1;
      uint64_t DMAC0_ITRIG_INMUX17:1;
      uint64_t DMAC0_ITRIG_INMUX18:1;
      uint64_t DMAC0_ITRIG_INMUX19:1;
      uint64_t DMAC0_ITRIG_INMUX20:1;
      uint64_t DMAC0_ITRIG_INMUX21:1;
      uint64_t DMAC0_ITRIG_INMUX22:1;
      uint64_t DMAC0_ITRIG_INMUX23:1;
      uint64_t DMAC0_ITRIG_INMUX24:1;
      uint64_t DMAC0_ITRIG_INMUX25:1;
      uint64_t DMAC0_ITRIG_INMUX26:1;
      uint64_t DMAC0_ITRIG_INMUX27:1;
      uint64_t DMAC0_ITRIG_INMUX28:1;
      uint64_t DMAC0_ITRIG_INMUX29:1;
      uint64_t DMAC0_ITRIG_INMUX30:1;
      uint64_t DMAC0_ITRIG_INMUX31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC0_ITRIG_ENA0;

  uint8_t res14[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMAC0_ITRIG_INMUX0:1;
      uint64_t DMAC0_ITRIG_INMUX1:1;
      uint64_t DMAC0_ITRIG_INMUX2:1;
      uint64_t DMAC0_ITRIG_INMUX3:1;
      uint64_t DMAC0_ITRIG_INMUX4:1;
      uint64_t DMAC0_ITRIG_INMUX5:1;
      uint64_t DMAC0_ITRIG_INMUX6:1;
      uint64_t DMAC0_ITRIG_INMUX7:1;
      uint64_t DMAC0_ITRIG_INMUX8:1;
      uint64_t DMAC0_ITRIG_INMUX9:1;
      uint64_t DMAC0_ITRIG_INMUX10:1;
      uint64_t DMAC0_ITRIG_INMUX11:1;
      uint64_t DMAC0_ITRIG_INMUX12:1;
      uint64_t DMAC0_ITRIG_INMUX13:1;
      uint64_t DMAC0_ITRIG_INMUX14:1;
      uint64_t DMAC0_ITRIG_INMUX15:1;
      uint64_t DMAC0_ITRIG_INMUX16:1;
      uint64_t DMAC0_ITRIG_INMUX17:1;
      uint64_t DMAC0_ITRIG_INMUX18:1;
      uint64_t DMAC0_ITRIG_INMUX19:1;
      uint64_t DMAC0_ITRIG_INMUX20:1;
      uint64_t DMAC0_ITRIG_INMUX21:1;
      uint64_t DMAC0_ITRIG_INMUX22:1;
      uint64_t DMAC0_ITRIG_INMUX23:1;
      uint64_t DMAC0_ITRIG_INMUX24:1;
      uint64_t DMAC0_ITRIG_INMUX25:1;
      uint64_t DMAC0_ITRIG_INMUX26:1;
      uint64_t DMAC0_ITRIG_INMUX27:1;
      uint64_t DMAC0_ITRIG_INMUX28:1;
      uint64_t DMAC0_ITRIG_INMUX29:1;
      uint64_t DMAC0_ITRIG_INMUX30:1;
      uint64_t DMAC0_ITRIG_INMUX31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC0_ITRIG_ENA0_SET;

  uint8_t res15[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMAC0_ITRIG_INMUX0:1;
      uint64_t DMAC0_ITRIG_INMUX1:1;
      uint64_t DMAC0_ITRIG_INMUX2:1;
      uint64_t DMAC0_ITRIG_INMUX3:1;
      uint64_t DMAC0_ITRIG_INMUX4:1;
      uint64_t DMAC0_ITRIG_INMUX5:1;
      uint64_t DMAC0_ITRIG_INMUX6:1;
      uint64_t DMAC0_ITRIG_INMUX7:1;
      uint64_t DMAC0_ITRIG_INMUX8:1;
      uint64_t DMAC0_ITRIG_INMUX9:1;
      uint64_t DMAC0_ITRIG_INMUX10:1;
      uint64_t DMAC0_ITRIG_INMUX11:1;
      uint64_t DMAC0_ITRIG_INMUX12:1;
      uint64_t DMAC0_ITRIG_INMUX13:1;
      uint64_t DMAC0_ITRIG_INMUX14:1;
      uint64_t DMAC0_ITRIG_INMUX15:1;
      uint64_t DMAC0_ITRIG_INMUX16:1;
      uint64_t DMAC0_ITRIG_INMUX17:1;
      uint64_t DMAC0_ITRIG_INMUX18:1;
      uint64_t DMAC0_ITRIG_INMUX19:1;
      uint64_t DMAC0_ITRIG_INMUX20:1;
      uint64_t DMAC0_ITRIG_INMUX21:1;
      uint64_t DMAC0_ITRIG_INMUX22:1;
      uint64_t DMAC0_ITRIG_INMUX23:1;
      uint64_t DMAC0_ITRIG_INMUX24:1;
      uint64_t DMAC0_ITRIG_INMUX25:1;
      uint64_t DMAC0_ITRIG_INMUX26:1;
      uint64_t DMAC0_ITRIG_INMUX27:1;
      uint64_t DMAC0_ITRIG_INMUX28:1;
      uint64_t DMAC0_ITRIG_INMUX29:1;
      uint64_t DMAC0_ITRIG_INMUX30:1;
      uint64_t DMAC0_ITRIG_INMUX31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC0_ITRIG_ENA0_CLR;

  uint8_t res16[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMAC1_ITRIG_INMUX0:1;
      uint64_t DMAC1_ITRIG_INMUX1:1;
      uint64_t DMAC1_ITRIG_INMUX2:1;
      uint64_t DMAC1_ITRIG_INMUX3:1;
      uint64_t DMAC1_ITRIG_INMUX4:1;
      uint64_t DMAC1_ITRIG_INMUX5:1;
      uint64_t DMAC1_ITRIG_INMUX6:1;
      uint64_t DMAC1_ITRIG_INMUX7:1;
      uint64_t DMAC1_ITRIG_INMUX8:1;
      uint64_t DMAC1_ITRIG_INMUX9:1;
      uint64_t DMAC1_ITRIG_INMUX10:1;
      uint64_t DMAC1_ITRIG_INMUX11:1;
      uint64_t DMAC1_ITRIG_INMUX12:1;
      uint64_t DMAC1_ITRIG_INMUX13:1;
      uint64_t DMAC1_ITRIG_INMUX14:1;
      uint64_t DMAC1_ITRIG_INMUX15:1;
      uint64_t DMAC1_ITRIG_INMUX16:1;
      uint64_t DMAC1_ITRIG_INMUX17:1;
      uint64_t DMAC1_ITRIG_INMUX18:1;
      uint64_t DMAC1_ITRIG_INMUX19:1;
      uint64_t DMAC1_ITRIG_INMUX20:1;
      uint64_t DMAC1_ITRIG_INMUX21:1;
      uint64_t DMAC1_ITRIG_INMUX22:1;
      uint64_t DMAC1_ITRIG_INMUX23:1;
      uint64_t DMAC1_ITRIG_INMUX24:1;
      uint64_t DMAC1_ITRIG_INMUX25:1;
      uint64_t DMAC1_ITRIG_INMUX26:1;
      uint64_t DMAC1_ITRIG_INMUX27:1;
      uint64_t DMAC1_ITRIG_INMUX28:1;
      uint64_t DMAC1_ITRIG_INMUX29:1;
      uint64_t DMAC1_ITRIG_INMUX30:1;
      uint64_t DMAC1_ITRIG_INMUX31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC1_ITRIG_ENA0;

  uint8_t res17[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMAC1_ITRIG_INMUX0:1;
      uint64_t DMAC1_ITRIG_INMUX1:1;
      uint64_t DMAC1_ITRIG_INMUX2:1;
      uint64_t DMAC1_ITRIG_INMUX3:1;
      uint64_t DMAC1_ITRIG_INMUX4:1;
      uint64_t DMAC1_ITRIG_INMUX5:1;
      uint64_t DMAC1_ITRIG_INMUX6:1;
      uint64_t DMAC1_ITRIG_INMUX7:1;
      uint64_t DMAC1_ITRIG_INMUX8:1;
      uint64_t DMAC1_ITRIG_INMUX9:1;
      uint64_t DMAC1_ITRIG_INMUX10:1;
      uint64_t DMAC1_ITRIG_INMUX11:1;
      uint64_t DMAC1_ITRIG_INMUX12:1;
      uint64_t DMAC1_ITRIG_INMUX13:1;
      uint64_t DMAC1_ITRIG_INMUX14:1;
      uint64_t DMAC1_ITRIG_INMUX15:1;
      uint64_t DMAC1_ITRIG_INMUX16:1;
      uint64_t DMAC1_ITRIG_INMUX17:1;
      uint64_t DMAC1_ITRIG_INMUX18:1;
      uint64_t DMAC1_ITRIG_INMUX19:1;
      uint64_t DMAC1_ITRIG_INMUX20:1;
      uint64_t DMAC1_ITRIG_INMUX21:1;
      uint64_t DMAC1_ITRIG_INMUX22:1;
      uint64_t DMAC1_ITRIG_INMUX23:1;
      uint64_t DMAC1_ITRIG_INMUX24:1;
      uint64_t DMAC1_ITRIG_INMUX25:1;
      uint64_t DMAC1_ITRIG_INMUX26:1;
      uint64_t DMAC1_ITRIG_INMUX27:1;
      uint64_t DMAC1_ITRIG_INMUX28:1;
      uint64_t DMAC1_ITRIG_INMUX29:1;
      uint64_t DMAC1_ITRIG_INMUX30:1;
      uint64_t DMAC1_ITRIG_INMUX31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC1_ITRIG_ENA0_SET;

  uint8_t res18[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMAC1_ITRIG_INMUX0:1;
      uint64_t DMAC1_ITRIG_INMUX1:1;
      uint64_t DMAC1_ITRIG_INMUX2:1;
      uint64_t DMAC1_ITRIG_INMUX3:1;
      uint64_t DMAC1_ITRIG_INMUX4:1;
      uint64_t DMAC1_ITRIG_INMUX5:1;
      uint64_t DMAC1_ITRIG_INMUX6:1;
      uint64_t DMAC1_ITRIG_INMUX7:1;
      uint64_t DMAC1_ITRIG_INMUX8:1;
      uint64_t DMAC1_ITRIG_INMUX9:1;
      uint64_t DMAC1_ITRIG_INMUX10:1;
      uint64_t DMAC1_ITRIG_INMUX11:1;
      uint64_t DMAC1_ITRIG_INMUX12:1;
      uint64_t DMAC1_ITRIG_INMUX13:1;
      uint64_t DMAC1_ITRIG_INMUX14:1;
      uint64_t DMAC1_ITRIG_INMUX15:1;
      uint64_t DMAC1_ITRIG_INMUX16:1;
      uint64_t DMAC1_ITRIG_INMUX17:1;
      uint64_t DMAC1_ITRIG_INMUX18:1;
      uint64_t DMAC1_ITRIG_INMUX19:1;
      uint64_t DMAC1_ITRIG_INMUX20:1;
      uint64_t DMAC1_ITRIG_INMUX21:1;
      uint64_t DMAC1_ITRIG_INMUX22:1;
      uint64_t DMAC1_ITRIG_INMUX23:1;
      uint64_t DMAC1_ITRIG_INMUX24:1;
      uint64_t DMAC1_ITRIG_INMUX25:1;
      uint64_t DMAC1_ITRIG_INMUX26:1;
      uint64_t DMAC1_ITRIG_INMUX27:1;
      uint64_t DMAC1_ITRIG_INMUX28:1;
      uint64_t DMAC1_ITRIG_INMUX29:1;
      uint64_t DMAC1_ITRIG_INMUX30:1;
      uint64_t DMAC1_ITRIG_INMUX31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC1_ITRIG_ENA0_CLR;

