iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/IMXRT685_RAM_GCC/targetInit/iMXRT685_sfr.h
};

#define CTIMER0 (*(volatile struct CTIMER0_tag *) 0x40028000)

struct CTIMER1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t MR0INT:1;
      uint64_t MR1INT:1;
      uint64_t MR2INT:1;
      uint64_t MR3INT:1;
      uint64_t CR0INT:1;
      uint64_t CR1INT:1;
      uint64_t CR2INT:1;
      uint64_t CR3INT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CEN:1;
      uint64_t CRST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TCVAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRVAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCVAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MR0I:1;
      uint64_t MR0R:1;
      uint64_t MR0S:1;
      uint64_t MR1I:1;
      uint64_t MR1R:1;
      uint64_t MR1S:1;
      uint64_t MR2I:1;
      uint64_t MR2R:1;
      uint64_t MR2S:1;
      uint64_t MR3I:1;
      uint64_t MR3R:1;
      uint64_t MR3S:1;
      uint64_t reservedSpace0:12;
      uint64_t MR0RL:1;
      uint64_t MR1RL:1;
      uint64_t MR2RL:1;
      uint64_t MR3RL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MATCH:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MR_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MATCH:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MR_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MATCH:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MR_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MATCH:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MR_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAP0RE:1;
      uint64_t CAP0FE:1;
      uint64_t CAP0I:1;
      uint64_t CAP1RE:1;
      uint64_t CAP1FE:1;
      uint64_t CAP1I:1;
      uint64_t CAP2RE:1;
      uint64_t CAP2FE:1;
      uint64_t CAP2I:1;
      uint64_t CAP3RE:1;
      uint64_t CAP3FE:1;
      uint64_t CAP3I:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EM0:1;
      uint64_t EM1:1;
      uint64_t EM2:1;
      uint64_t EM3:1;
      uint64_t EMC0:2;
      uint64_t EMC1:2;
      uint64_t EMC2:2;
      uint64_t EMC3:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMR;

  uint8_t res0[48];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CTMODE:2;
      uint64_t CINSEL:2;
      uint64_t ENCC:1;
      uint64_t SELCC:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWMEN0:1;
      uint64_t PWMEN1:1;
      uint64_t PWMEN2:1;
      uint64_t PWMEN3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWMC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MATCH_Shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSR_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MATCH_Shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSR_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MATCH_Shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSR_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MATCH_Shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSR_3;

};

#define CTIMER1 (*(volatile struct CTIMER1_tag *) 0x40029000)

struct CTIMER2_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t MR0INT:1;
      uint64_t MR1INT:1;
      uint64_t MR2INT:1;
      uint64_t MR3INT:1;
      uint64_t CR0INT:1;
      uint64_t CR1INT:1;
      uint64_t CR2INT:1;
      uint64_t CR3INT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CEN:1;
      uint64_t CRST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TCVAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRVAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCVAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MR0I:1;
      uint64_t MR0R:1;
      uint64_t MR0S:1;
      uint64_t MR1I:1;
      uint64_t MR1R:1;
      uint64_t MR1S:1;
      uint64_t MR2I:1;
      uint64_t MR2R:1;
      uint64_t MR2S:1;
      uint64_t MR3I:1;
      uint64_t MR3R:1;
      uint64_t MR3S:1;
      uint64_t reservedSpace0:12;
      uint64_t MR0RL:1;
      uint64_t MR1RL:1;
      uint64_t MR2RL:1;
      uint64_t MR3RL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MATCH:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MR_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MATCH:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MR_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MATCH:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MR_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MATCH:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MR_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAP0RE:1;
      uint64_t CAP0FE:1;
      uint64_t CAP0I:1;
      uint64_t CAP1RE:1;
      uint64_t CAP1FE:1;
      uint64_t CAP1I:1;
      uint64_t CAP2RE:1;
      uint64_t CAP2FE:1;
      uint64_t CAP2I:1;
      uint64_t CAP3RE:1;
      uint64_t CAP3FE:1;
      uint64_t CAP3I:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EM0:1;
      uint64_t EM1:1;
      uint64_t EM2:1;
      uint64_t EM3:1;
      uint64_t EMC0:2;
      uint64_t EMC1:2;
      uint64_t EMC2:2;
      uint64_t EMC3:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMR;

  uint8_t res0[48];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CTMODE:2;
      uint64_t CINSEL:2;
      uint64_t ENCC:1;
      uint64_t SELCC:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWMEN0:1;
      uint64_t PWMEN1:1;
      uint64_t PWMEN2:1;
      uint64_t PWMEN3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWMC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MATCH_Shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSR_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MATCH_Shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSR_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MATCH_Shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSR_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MATCH_Shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSR_3;

