iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/IMXRT685_RAM_GCC/targetInit/iMXRT685_sfr.h
};

#define CTIMER4 (*(volatile struct CTIMER4_tag *) 0x4002c000)

struct MRT0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t NOC:4;
      uint64_t NOB:5;
      uint64_t reservedSpace0:22;
      uint64_t MULTITASK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MODCFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t CHAN:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IDLE_CH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GFLAG0:1;
      uint64_t GFLAG1:1;
      uint64_t GFLAG2:1;
      uint64_t GFLAG3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ_FLAG;

};

#define MRT0 (*(volatile struct MRT0_tag *) 0x4002d0f0)

struct MRT0_CHANNEL_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t IVALUE:24;
      uint64_t reservedSpace0:7;
      uint64_t LOAD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTVAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VALUE:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTEN:1;
      uint64_t MODE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTFLAG:1;
      uint64_t RUN:1;
      uint64_t INUSE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STAT;

};

#define MRT0_CHANNEL_0 (*(volatile struct MRT0_CHANNEL_0_tag *) 0x4002d000)

struct MRT0_CHANNEL_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t IVALUE:24;
      uint64_t reservedSpace0:7;
      uint64_t LOAD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTVAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VALUE:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTEN:1;
      uint64_t MODE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTFLAG:1;
      uint64_t RUN:1;
      uint64_t INUSE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STAT;

};

#define MRT0_CHANNEL_1 (*(volatile struct MRT0_CHANNEL_1_tag *) 0x4002d010)

struct MRT0_CHANNEL_2_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t IVALUE:24;
      uint64_t reservedSpace0:7;
      uint64_t LOAD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTVAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VALUE:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTEN:1;
      uint64_t MODE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTFLAG:1;
      uint64_t RUN:1;
      uint64_t INUSE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STAT;

};

#define MRT0_CHANNEL_2 (*(volatile struct MRT0_CHANNEL_2_tag *) 0x4002d020)

struct MRT0_CHANNEL_3_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t IVALUE:24;
      uint64_t reservedSpace0:7;
      uint64_t LOAD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTVAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VALUE:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTEN:1;
      uint64_t MODE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTFLAG:1;
      uint64_t RUN:1;
      uint64_t INUSE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STAT;

};

#define MRT0_CHANNEL_3 (*(volatile struct MRT0_CHANNEL_3_tag *) 0x4002d030)

struct RTC_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SWRESET:1;
      uint64_t reservedSpace0:1;
      uint64_t ALARM1HZ:1;
      uint64_t WAKE1KHZ:1;
      uint64_t ALARMDPD_EN:1;
      uint64_t WAKEDPD_EN:1;
      uint64_t RTC1KHZ_EN:1;
      uint64_t RTC_EN:1;
      uint64_t RTC_OSC_PD:1;
      uint64_t reservedSpace1:1;
      uint64_t RTC_SUBSEC_ENA:1;
      uint64_t reservedSpace2:17;
      uint64_t RTC_OSC_loadcap:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MATVAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MATCH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COUNT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VAL:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WAKE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RTC_SUBSEC:15;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SUBSEC;

  uint8_t res0[44];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPREG_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPREG_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPREG_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPREG_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPREG_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPREG_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPREG_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPREG_7;

