iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/IMXRT685_RAM_GCC/targetInit/iMXRT685_sfr.h
};

#define RTC (*(volatile struct RTC_tag *) 0x40030000)

struct CACHE64_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENCACHE:1;
      uint64_t ENWRBUF:1;
      uint64_t reservedSpace0:22;
      uint64_t INVW0:1;
      uint64_t PUSHW0:1;
      uint64_t INVW1:1;
      uint64_t PUSHW1:1;
      uint64_t reservedSpace1:3;
      uint64_t GO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LGO:1;
      uint64_t reservedSpace0:1;
      uint64_t CACHEADDR:12;
      uint64_t WSEL:1;
      uint64_t reservedSpace1:1;
      uint64_t TDSEL:1;
      uint64_t reservedSpace2:3;
      uint64_t LCIVB:1;
      uint64_t LCIMB:1;
      uint64_t LCWAY:1;
      uint64_t reservedSpace3:1;
      uint64_t LCMD:2;
      uint64_t LADSEL:1;
      uint64_t LACC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LGO:1;
      uint64_t PHYADDR27_1:27;
      uint64_t reservedSpace0:1;
      uint64_t PHYADDR31_29:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCVR;

};

#define CACHE64 (*(volatile struct CACHE64_tag *) 0x40033800)

struct CACHE64_POLSEL_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:10;
      uint64_t REG0_TOP:17;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG0_TOP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:10;
      uint64_t REG1_TOP:17;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG1_TOP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REG0_POLICY:2;
      uint64_t REG1_POLICY:2;
      uint64_t REG02_POLICY:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) POLSEL;

};

#define CACHE64_POLSEL (*(volatile struct CACHE64_POLSEL_tag *) 0x40033014)

struct GPIO_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIRP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIR_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIRP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIR_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIRP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIR_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIRP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIR_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIRP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIR_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIRP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIR_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIRP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIR_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIRP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIR_7;

  uint8_t res0[96];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MASKP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MASK_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MASKP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MASK_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MASKP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MASK_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MASKP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MASK_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MASKP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MASK_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MASKP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MASK_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MASKP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MASK_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MASKP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MASK_7;

  uint8_t res1[96];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PORT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIN_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PORT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIN_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PORT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIN_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PORT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIN_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PORT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIN_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PORT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIN_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PORT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIN_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PORT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIN_7;

  uint8_t res2[96];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPORTP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPIN_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPORTP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPIN_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPORTP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPIN_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPORTP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPIN_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPORTP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPIN_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPORTP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPIN_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPORTP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPIN_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPORTP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPIN_7;

  uint8_t res3[96];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SETP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SET_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SETP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SET_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SETP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SET_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SETP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SET_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SETP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SET_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SETP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SET_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SETP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SET_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SETP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SET_7;

  uint8_t res4[96];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLRP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLR_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLRP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLR_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLRP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLR_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLRP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLR_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLRP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLR_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLRP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLR_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLRP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLR_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLRP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLR_7;

  uint8_t res5[96];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NOTP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NOT_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NOTP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NOT_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NOTP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NOT_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NOTP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NOT_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NOTP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NOT_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NOTP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NOT_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NOTP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NOT_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NOTP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NOT_7;

  uint8_t res6[96];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIRSETP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIRSET_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIRSETP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIRSET_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIRSETP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIRSET_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIRSETP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIRSET_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIRSETP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIRSET_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIRSETP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIRSET_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIRSETP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIRSET_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIRSETP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIRSET_7;

