iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/IMXRT685_RAM_GCC/targetInit/iMXRT685_sfr.h
};

#define GPIO_W_7 (*(volatile struct GPIO_W_7_tag *) 0x40101380)

struct SECGPIO_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIRP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIR_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIRP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIR_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIRP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIR_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIRP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIR_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIRP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIR_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIRP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIR_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIRP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIR_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIRP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIR_7;

  uint8_t res0[96];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MASKP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MASK_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MASKP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MASK_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MASKP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MASK_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MASKP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MASK_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MASKP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MASK_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MASKP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MASK_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MASKP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MASK_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MASKP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MASK_7;

  uint8_t res1[96];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PORT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIN_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PORT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIN_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PORT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIN_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PORT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIN_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PORT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIN_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PORT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIN_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PORT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIN_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PORT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIN_7;

  uint8_t res2[96];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPORTP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPIN_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPORTP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPIN_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPORTP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPIN_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPORTP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPIN_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPORTP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPIN_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPORTP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPIN_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPORTP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPIN_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPORTP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPIN_7;

  uint8_t res3[96];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SETP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SET_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SETP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SET_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SETP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SET_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SETP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SET_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SETP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SET_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SETP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SET_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SETP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SET_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SETP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SET_7;

  uint8_t res4[96];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLRP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLR_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLRP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLR_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLRP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLR_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLRP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLR_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLRP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLR_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLRP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLR_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLRP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLR_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLRP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLR_7;

  uint8_t res5[96];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NOTP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NOT_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NOTP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NOT_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NOTP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NOT_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NOTP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NOT_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NOTP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NOT_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NOTP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NOT_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NOTP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NOT_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NOTP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NOT_7;

  uint8_t res6[96];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIRSETP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIRSET_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIRSETP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIRSET_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIRSETP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIRSET_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIRSETP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIRSET_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIRSETP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIRSET_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIRSETP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIRSET_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIRSETP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIRSET_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIRSETP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIRSET_7;

