iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/IMXRT685_RAM_GCC/targetInit/iMXRT685_sfr.h
  uint8_t res7[96];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIRCLRP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIRCLR_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIRCLRP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIRCLR_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIRCLRP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIRCLR_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIRCLRP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIRCLR_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIRCLRP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIRCLR_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIRCLRP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIRCLR_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIRCLRP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIRCLR_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIRCLRP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIRCLR_7;

  uint8_t res8[96];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIRNOTP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIRNOT_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIRNOTP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIRNOT_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIRNOTP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIRNOT_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIRNOTP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIRNOT_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIRNOTP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIRNOT_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIRNOTP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIRNOT_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIRNOTP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIRNOT_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIRNOTP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIRNOT_7;

  uint8_t res9[96];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INT_EN:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTENA_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INT_EN:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTENA_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INT_EN:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTENA_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INT_EN:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTENA_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INT_EN:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTENA_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INT_EN:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTENA_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INT_EN:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTENA_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INT_EN:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTENA_7;

  uint8_t res10[96];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INT_EN:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTENB_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INT_EN:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTENB_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INT_EN:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTENB_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INT_EN:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTENB_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INT_EN:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTENB_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INT_EN:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTENB_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INT_EN:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTENB_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INT_EN:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTENB_7;

  uint8_t res11[96];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t POL_CTL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPOL_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t POL_CTL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPOL_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t POL_CTL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPOL_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t POL_CTL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPOL_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t POL_CTL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPOL_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t POL_CTL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPOL_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t POL_CTL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPOL_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t POL_CTL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPOL_7;

  uint8_t res12[96];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EDGE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTEDG_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EDGE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTEDG_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EDGE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTEDG_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EDGE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTEDG_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EDGE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTEDG_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EDGE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTEDG_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EDGE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTEDG_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EDGE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTEDG_7;

  uint8_t res13[96];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STATUS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTSTATA_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STATUS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTSTATA_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STATUS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTSTATA_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STATUS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTSTATA_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STATUS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTSTATA_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STATUS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTSTATA_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STATUS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTSTATA_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STATUS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTSTATA_7;

  uint8_t res14[96];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STATUS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTSTATB_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STATUS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTSTATB_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STATUS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTSTATB_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STATUS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTSTATB_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STATUS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTSTATB_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STATUS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTSTATB_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STATUS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTSTATB_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STATUS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTSTATB_7;

