iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/IMXRT685_RAM_GCC/targetInit/iMXRT685_sfr.h
};

#define SECGPIO_B_3 (*(volatile struct SECGPIO_B_3_tag *) 0x40154060)

struct SECGPIO_B_4_tag
{
  union
  {
    uint8_t R;
    struct
    {
      uint64_t PBYTE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) B__0;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PBYTE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) B__1;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PBYTE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) B__2;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PBYTE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) B__3;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PBYTE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) B__4;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PBYTE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) B__5;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PBYTE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) B__6;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PBYTE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) B__7;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PBYTE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) B__8;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PBYTE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) B__9;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PBYTE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) B__10;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PBYTE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) B__11;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PBYTE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) B__12;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PBYTE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) B__13;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PBYTE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) B__14;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PBYTE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) B__15;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PBYTE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) B__16;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PBYTE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) B__17;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PBYTE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) B__18;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PBYTE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) B__19;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PBYTE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) B__20;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PBYTE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) B__21;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PBYTE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) B__22;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PBYTE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) B__23;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PBYTE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) B__24;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PBYTE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) B__25;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PBYTE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) B__26;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PBYTE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) B__27;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PBYTE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) B__28;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PBYTE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) B__29;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PBYTE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) B__30;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PBYTE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) B__31;

};

#define SECGPIO_B_4 (*(volatile struct SECGPIO_B_4_tag *) 0x40154080)

struct SECGPIO_B_5_tag
{
  union
  {
    uint8_t R;
    struct
    {
      uint64_t PBYTE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) B__0;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PBYTE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) B__1;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PBYTE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) B__2;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PBYTE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) B__3;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PBYTE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) B__4;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PBYTE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) B__5;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PBYTE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) B__6;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PBYTE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) B__7;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PBYTE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) B__8;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PBYTE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) B__9;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PBYTE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) B__10;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PBYTE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) B__11;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PBYTE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) B__12;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PBYTE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) B__13;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PBYTE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) B__14;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PBYTE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) B__15;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PBYTE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) B__16;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PBYTE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) B__17;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PBYTE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) B__18;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PBYTE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) B__19;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PBYTE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) B__20;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PBYTE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) B__21;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PBYTE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) B__22;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PBYTE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) B__23;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PBYTE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) B__24;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PBYTE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) B__25;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PBYTE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) B__26;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PBYTE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) B__27;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PBYTE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) B__28;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PBYTE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) B__29;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PBYTE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) B__30;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PBYTE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) B__31;

