iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/IMXRT685_RAM_GCC/targetInit/iMXRT685_sfr.h
};

#define SECGPIO_W_5 (*(volatile struct SECGPIO_W_5_tag *) 0x40155280)

struct SECGPIO_W_6_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W__0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W__1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W__2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W__3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W__4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W__5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W__6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W__7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W__8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W__9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W__10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W__11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W__12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W__13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W__14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W__15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W__16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W__17;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W__18;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W__19;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W__20;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W__21;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W__22;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W__23;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W__24;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W__25;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W__26;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W__27;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W__28;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W__29;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W__30;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W__31;

};

#define SECGPIO_W_6 (*(volatile struct SECGPIO_W_6_tag *) 0x40155300)

struct SECGPIO_W_7_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W__0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W__1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W__2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W__3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W__4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W__5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W__6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W__7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W__8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W__9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W__10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W__11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W__12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W__13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W__14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W__15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W__16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W__17;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W__18;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W__19;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W__20;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W__21;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W__22;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W__23;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W__24;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W__25;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W__26;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W__27;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W__28;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W__29;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W__30;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) W__31;

