iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/IMXRT685_RAM_GCC/targetInit/iMXRT685_sfr.h
};

#define SECGPIO_W_7 (*(volatile struct SECGPIO_W_7_tag *) 0x40155380)

struct DMA0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENABLE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t ACTIVEINT:1;
      uint64_t ACTIVEERRINT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:9;
      uint64_t OFFSET:23;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRAMBASE;

  uint8_t res0[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENABLESET0;

  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENABLECLR0;

  uint8_t res2[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ACT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ACTIVE0;

  uint8_t res3[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BSY:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BUSY0;

  uint8_t res4[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ERR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERRINT0;

  uint8_t res5[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTEN:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTENSET0;

  uint8_t res6[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTENCLR0;

  uint8_t res7[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTA0;

  uint8_t res8[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IB:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTB0;

  uint8_t res9[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SV:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SETVALID0;

  uint8_t res10[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRIG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SETTRIG0;

  uint8_t res11[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ABORTCTRL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ABORT0;

};

#define DMA0 (*(volatile struct DMA0_tag *) 0x40104000)

struct DMA0_CHANNEL_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PERIPHREQEN:1;
      uint64_t HWTRIGEN:1;
      uint64_t reservedSpace0:2;
      uint64_t TRIGPOL:1;
      uint64_t TRIGTYPE:1;
      uint64_t TRIGBURST:1;
      uint64_t reservedSpace1:1;
      uint64_t BURSTPOWER:4;
      uint64_t reservedSpace2:2;
      uint64_t SRCBURSTWRAP:1;
      uint64_t DSTBURSTWRAP:1;
      uint64_t CHPRIORITY:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VALIDPENDING:1;
      uint64_t reservedSpace0:1;
      uint64_t TRIG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTLSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CFGVALID:1;
      uint64_t RELOAD:1;
      uint64_t SWTRIG:1;
      uint64_t CLRTRIG:1;
      uint64_t SETINTA:1;
      uint64_t SETINTB:1;
      uint64_t reservedSpace0:2;
      uint64_t WIDTH:2;
      uint64_t reservedSpace1:2;
      uint64_t SRCINC:2;
      uint64_t DSTINC:2;
      uint64_t XFERCOUNT:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) XFERCFG;

};

#define DMA0_CHANNEL_0 (*(volatile struct DMA0_CHANNEL_0_tag *) 0x40104400)

struct DMA0_CHANNEL_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PERIPHREQEN:1;
      uint64_t HWTRIGEN:1;
      uint64_t reservedSpace0:2;
      uint64_t TRIGPOL:1;
      uint64_t TRIGTYPE:1;
      uint64_t TRIGBURST:1;
      uint64_t reservedSpace1:1;
      uint64_t BURSTPOWER:4;
      uint64_t reservedSpace2:2;
      uint64_t SRCBURSTWRAP:1;
      uint64_t DSTBURSTWRAP:1;
      uint64_t CHPRIORITY:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VALIDPENDING:1;
      uint64_t reservedSpace0:1;
      uint64_t TRIG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTLSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CFGVALID:1;
      uint64_t RELOAD:1;
      uint64_t SWTRIG:1;
      uint64_t CLRTRIG:1;
      uint64_t SETINTA:1;
      uint64_t SETINTB:1;
      uint64_t reservedSpace0:2;
      uint64_t WIDTH:2;
      uint64_t reservedSpace1:2;
      uint64_t SRCINC:2;
      uint64_t DSTINC:2;
      uint64_t XFERCOUNT:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) XFERCFG;

};

#define DMA0_CHANNEL_1 (*(volatile struct DMA0_CHANNEL_1_tag *) 0x40104410)

struct DMA0_CHANNEL_2_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PERIPHREQEN:1;
      uint64_t HWTRIGEN:1;
      uint64_t reservedSpace0:2;
      uint64_t TRIGPOL:1;
      uint64_t TRIGTYPE:1;
      uint64_t TRIGBURST:1;
      uint64_t reservedSpace1:1;
      uint64_t BURSTPOWER:4;
      uint64_t reservedSpace2:2;
      uint64_t SRCBURSTWRAP:1;
      uint64_t DSTBURSTWRAP:1;
      uint64_t CHPRIORITY:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VALIDPENDING:1;
      uint64_t reservedSpace0:1;
      uint64_t TRIG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTLSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CFGVALID:1;
      uint64_t RELOAD:1;
      uint64_t SWTRIG:1;
      uint64_t CLRTRIG:1;
      uint64_t SETINTA:1;
      uint64_t SETINTB:1;
      uint64_t reservedSpace0:2;
      uint64_t WIDTH:2;
      uint64_t reservedSpace1:2;
      uint64_t SRCINC:2;
      uint64_t DSTINC:2;
      uint64_t XFERCOUNT:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) XFERCFG;

