iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/IMXRT685_RAM_GCC/targetInit/iMXRT685_sfr.h
};

#define DMA0_CHANNEL_2 (*(volatile struct DMA0_CHANNEL_2_tag *) 0x40104420)

struct DMA0_CHANNEL_3_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PERIPHREQEN:1;
      uint64_t HWTRIGEN:1;
      uint64_t reservedSpace0:2;
      uint64_t TRIGPOL:1;
      uint64_t TRIGTYPE:1;
      uint64_t TRIGBURST:1;
      uint64_t reservedSpace1:1;
      uint64_t BURSTPOWER:4;
      uint64_t reservedSpace2:2;
      uint64_t SRCBURSTWRAP:1;
      uint64_t DSTBURSTWRAP:1;
      uint64_t CHPRIORITY:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VALIDPENDING:1;
      uint64_t reservedSpace0:1;
      uint64_t TRIG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTLSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CFGVALID:1;
      uint64_t RELOAD:1;
      uint64_t SWTRIG:1;
      uint64_t CLRTRIG:1;
      uint64_t SETINTA:1;
      uint64_t SETINTB:1;
      uint64_t reservedSpace0:2;
      uint64_t WIDTH:2;
      uint64_t reservedSpace1:2;
      uint64_t SRCINC:2;
      uint64_t DSTINC:2;
      uint64_t XFERCOUNT:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) XFERCFG;

};

#define DMA0_CHANNEL_3 (*(volatile struct DMA0_CHANNEL_3_tag *) 0x40104430)

struct DMA0_CHANNEL_4_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PERIPHREQEN:1;
      uint64_t HWTRIGEN:1;
      uint64_t reservedSpace0:2;
      uint64_t TRIGPOL:1;
      uint64_t TRIGTYPE:1;
      uint64_t TRIGBURST:1;
      uint64_t reservedSpace1:1;
      uint64_t BURSTPOWER:4;
      uint64_t reservedSpace2:2;
      uint64_t SRCBURSTWRAP:1;
      uint64_t DSTBURSTWRAP:1;
      uint64_t CHPRIORITY:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VALIDPENDING:1;
      uint64_t reservedSpace0:1;
      uint64_t TRIG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTLSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CFGVALID:1;
      uint64_t RELOAD:1;
      uint64_t SWTRIG:1;
      uint64_t CLRTRIG:1;
      uint64_t SETINTA:1;
      uint64_t SETINTB:1;
      uint64_t reservedSpace0:2;
      uint64_t WIDTH:2;
      uint64_t reservedSpace1:2;
      uint64_t SRCINC:2;
      uint64_t DSTINC:2;
      uint64_t XFERCOUNT:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) XFERCFG;

};

#define DMA0_CHANNEL_4 (*(volatile struct DMA0_CHANNEL_4_tag *) 0x40104440)

struct DMA0_CHANNEL_5_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PERIPHREQEN:1;
      uint64_t HWTRIGEN:1;
      uint64_t reservedSpace0:2;
      uint64_t TRIGPOL:1;
      uint64_t TRIGTYPE:1;
      uint64_t TRIGBURST:1;
      uint64_t reservedSpace1:1;
      uint64_t BURSTPOWER:4;
      uint64_t reservedSpace2:2;
      uint64_t SRCBURSTWRAP:1;
      uint64_t DSTBURSTWRAP:1;
      uint64_t CHPRIORITY:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VALIDPENDING:1;
      uint64_t reservedSpace0:1;
      uint64_t TRIG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTLSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CFGVALID:1;
      uint64_t RELOAD:1;
      uint64_t SWTRIG:1;
      uint64_t CLRTRIG:1;
      uint64_t SETINTA:1;
      uint64_t SETINTB:1;
      uint64_t reservedSpace0:2;
      uint64_t WIDTH:2;
      uint64_t reservedSpace1:2;
      uint64_t SRCINC:2;
      uint64_t DSTINC:2;
      uint64_t XFERCOUNT:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) XFERCFG;

};

#define DMA0_CHANNEL_5 (*(volatile struct DMA0_CHANNEL_5_tag *) 0x40104450)

struct DMA0_CHANNEL_6_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PERIPHREQEN:1;
      uint64_t HWTRIGEN:1;
      uint64_t reservedSpace0:2;
      uint64_t TRIGPOL:1;
      uint64_t TRIGTYPE:1;
      uint64_t TRIGBURST:1;
      uint64_t reservedSpace1:1;
      uint64_t BURSTPOWER:4;
      uint64_t reservedSpace2:2;
      uint64_t SRCBURSTWRAP:1;
      uint64_t DSTBURSTWRAP:1;
      uint64_t CHPRIORITY:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VALIDPENDING:1;
      uint64_t reservedSpace0:1;
      uint64_t TRIG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTLSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CFGVALID:1;
      uint64_t RELOAD:1;
      uint64_t SWTRIG:1;
      uint64_t CLRTRIG:1;
      uint64_t SETINTA:1;
      uint64_t SETINTB:1;
      uint64_t reservedSpace0:2;
      uint64_t WIDTH:2;
      uint64_t reservedSpace1:2;
      uint64_t SRCINC:2;
      uint64_t DSTINC:2;
      uint64_t XFERCOUNT:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) XFERCFG;

};

#define DMA0_CHANNEL_6 (*(volatile struct DMA0_CHANNEL_6_tag *) 0x40104460)

struct DMA0_CHANNEL_7_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PERIPHREQEN:1;
      uint64_t HWTRIGEN:1;
      uint64_t reservedSpace0:2;
      uint64_t TRIGPOL:1;
      uint64_t TRIGTYPE:1;
      uint64_t TRIGBURST:1;
      uint64_t reservedSpace1:1;
      uint64_t BURSTPOWER:4;
      uint64_t reservedSpace2:2;
      uint64_t SRCBURSTWRAP:1;
      uint64_t DSTBURSTWRAP:1;
      uint64_t CHPRIORITY:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VALIDPENDING:1;
      uint64_t reservedSpace0:1;
      uint64_t TRIG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTLSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CFGVALID:1;
      uint64_t RELOAD:1;
      uint64_t SWTRIG:1;
      uint64_t CLRTRIG:1;
      uint64_t SETINTA:1;
      uint64_t SETINTB:1;
      uint64_t reservedSpace0:2;
      uint64_t WIDTH:2;
      uint64_t reservedSpace1:2;
      uint64_t SRCINC:2;
      uint64_t DSTINC:2;
      uint64_t XFERCOUNT:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) XFERCFG;

