iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/IMXRT685_RAM_GCC/targetInit/iMXRT685_sfr.h
};

#define DMA1_CHANNEL_28 (*(volatile struct DMA1_CHANNEL_28_tag *) 0x401055c0)

struct DMA1_CHANNEL_29_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PERIPHREQEN:1;
      uint64_t HWTRIGEN:1;
      uint64_t reservedSpace0:2;
      uint64_t TRIGPOL:1;
      uint64_t TRIGTYPE:1;
      uint64_t TRIGBURST:1;
      uint64_t reservedSpace1:1;
      uint64_t BURSTPOWER:4;
      uint64_t reservedSpace2:2;
      uint64_t SRCBURSTWRAP:1;
      uint64_t DSTBURSTWRAP:1;
      uint64_t CHPRIORITY:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VALIDPENDING:1;
      uint64_t reservedSpace0:1;
      uint64_t TRIG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTLSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CFGVALID:1;
      uint64_t RELOAD:1;
      uint64_t SWTRIG:1;
      uint64_t CLRTRIG:1;
      uint64_t SETINTA:1;
      uint64_t SETINTB:1;
      uint64_t reservedSpace0:2;
      uint64_t WIDTH:2;
      uint64_t reservedSpace1:2;
      uint64_t SRCINC:2;
      uint64_t DSTINC:2;
      uint64_t XFERCOUNT:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) XFERCFG;

};

#define DMA1_CHANNEL_29 (*(volatile struct DMA1_CHANNEL_29_tag *) 0x401055d0)

struct DMA1_CHANNEL_30_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PERIPHREQEN:1;
      uint64_t HWTRIGEN:1;
      uint64_t reservedSpace0:2;
      uint64_t TRIGPOL:1;
      uint64_t TRIGTYPE:1;
      uint64_t TRIGBURST:1;
      uint64_t reservedSpace1:1;
      uint64_t BURSTPOWER:4;
      uint64_t reservedSpace2:2;
      uint64_t SRCBURSTWRAP:1;
      uint64_t DSTBURSTWRAP:1;
      uint64_t CHPRIORITY:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VALIDPENDING:1;
      uint64_t reservedSpace0:1;
      uint64_t TRIG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTLSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CFGVALID:1;
      uint64_t RELOAD:1;
      uint64_t SWTRIG:1;
      uint64_t CLRTRIG:1;
      uint64_t SETINTA:1;
      uint64_t SETINTB:1;
      uint64_t reservedSpace0:2;
      uint64_t WIDTH:2;
      uint64_t reservedSpace1:2;
      uint64_t SRCINC:2;
      uint64_t DSTINC:2;
      uint64_t XFERCOUNT:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) XFERCFG;

};

#define DMA1_CHANNEL_30 (*(volatile struct DMA1_CHANNEL_30_tag *) 0x401055e0)

struct DMA1_CHANNEL_31_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PERIPHREQEN:1;
      uint64_t HWTRIGEN:1;
      uint64_t reservedSpace0:2;
      uint64_t TRIGPOL:1;
      uint64_t TRIGTYPE:1;
      uint64_t TRIGBURST:1;
      uint64_t reservedSpace1:1;
      uint64_t BURSTPOWER:4;
      uint64_t reservedSpace2:2;
      uint64_t SRCBURSTWRAP:1;
      uint64_t DSTBURSTWRAP:1;
      uint64_t CHPRIORITY:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VALIDPENDING:1;
      uint64_t reservedSpace0:1;
      uint64_t TRIG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTLSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CFGVALID:1;
      uint64_t RELOAD:1;
      uint64_t SWTRIG:1;
      uint64_t CLRTRIG:1;
      uint64_t SETINTA:1;
      uint64_t SETINTB:1;
      uint64_t reservedSpace0:2;
      uint64_t WIDTH:2;
      uint64_t reservedSpace1:2;
      uint64_t SRCINC:2;
      uint64_t DSTINC:2;
      uint64_t XFERCOUNT:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) XFERCFG;

};

#define DMA1_CHANNEL_31 (*(volatile struct DMA1_CHANNEL_31_tag *) 0x401055f0)

struct FLEXCOMM0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PERSEL:3;
      uint64_t LOCK:1;
      uint64_t USARTPRESENT:1;
      uint64_t SPIPRESENT:1;
      uint64_t I2CPRESENT:1;
      uint64_t I2SPRESENT:1;
      uint64_t reservedSpace0:4;
      uint64_t ID:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PSELID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t Minor_Rev:4;
      uint64_t Major_Rev:4;
      uint64_t ID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PID;

};

#define FLEXCOMM0 (*(volatile struct FLEXCOMM0_tag *) 0x40106ff8)

struct FLEXCOMM1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PERSEL:3;
      uint64_t LOCK:1;
      uint64_t USARTPRESENT:1;
      uint64_t SPIPRESENT:1;
      uint64_t I2CPRESENT:1;
      uint64_t I2SPRESENT:1;
      uint64_t reservedSpace0:4;
      uint64_t ID:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PSELID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t Minor_Rev:4;
      uint64_t Major_Rev:4;
      uint64_t ID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PID;

};

#define FLEXCOMM1 (*(volatile struct FLEXCOMM1_tag *) 0x40107ff8)

struct FLEXCOMM2_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PERSEL:3;
      uint64_t LOCK:1;
      uint64_t USARTPRESENT:1;
      uint64_t SPIPRESENT:1;
      uint64_t I2CPRESENT:1;
      uint64_t I2SPRESENT:1;
      uint64_t reservedSpace0:4;
      uint64_t ID:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PSELID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t Minor_Rev:4;
      uint64_t Major_Rev:4;
      uint64_t ID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PID;

};

#define FLEXCOMM2 (*(volatile struct FLEXCOMM2_tag *) 0x40108ff8)

struct FLEXCOMM3_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PERSEL:3;
      uint64_t LOCK:1;
      uint64_t USARTPRESENT:1;
      uint64_t SPIPRESENT:1;
      uint64_t I2CPRESENT:1;
      uint64_t I2SPRESENT:1;
      uint64_t reservedSpace0:4;
      uint64_t ID:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PSELID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t Minor_Rev:4;
      uint64_t Major_Rev:4;
      uint64_t ID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PID;

