iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/IMXRT685_RAM_GCC/targetInit/iMXRT685_sfr.h
};

#define FLEXCOMM3 (*(volatile struct FLEXCOMM3_tag *) 0x40109ff8)

struct FLEXCOMM4_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PERSEL:3;
      uint64_t LOCK:1;
      uint64_t USARTPRESENT:1;
      uint64_t SPIPRESENT:1;
      uint64_t I2CPRESENT:1;
      uint64_t I2SPRESENT:1;
      uint64_t reservedSpace0:4;
      uint64_t ID:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PSELID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t Minor_Rev:4;
      uint64_t Major_Rev:4;
      uint64_t ID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PID;

};

#define FLEXCOMM4 (*(volatile struct FLEXCOMM4_tag *) 0x40122ff8)

struct FLEXCOMM5_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PERSEL:3;
      uint64_t LOCK:1;
      uint64_t USARTPRESENT:1;
      uint64_t SPIPRESENT:1;
      uint64_t I2CPRESENT:1;
      uint64_t I2SPRESENT:1;
      uint64_t reservedSpace0:4;
      uint64_t ID:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PSELID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t Minor_Rev:4;
      uint64_t Major_Rev:4;
      uint64_t ID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PID;

};

#define FLEXCOMM5 (*(volatile struct FLEXCOMM5_tag *) 0x40123ff8)

struct FLEXCOMM6_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PERSEL:3;
      uint64_t LOCK:1;
      uint64_t USARTPRESENT:1;
      uint64_t SPIPRESENT:1;
      uint64_t I2CPRESENT:1;
      uint64_t I2SPRESENT:1;
      uint64_t reservedSpace0:4;
      uint64_t ID:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PSELID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t Minor_Rev:4;
      uint64_t Major_Rev:4;
      uint64_t ID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PID;

};

#define FLEXCOMM6 (*(volatile struct FLEXCOMM6_tag *) 0x40124ff8)

struct FLEXCOMM7_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PERSEL:3;
      uint64_t LOCK:1;
      uint64_t USARTPRESENT:1;
      uint64_t SPIPRESENT:1;
      uint64_t I2CPRESENT:1;
      uint64_t I2SPRESENT:1;
      uint64_t reservedSpace0:4;
      uint64_t ID:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PSELID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t Minor_Rev:4;
      uint64_t Major_Rev:4;
      uint64_t ID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PID;

};

#define FLEXCOMM7 (*(volatile struct FLEXCOMM7_tag *) 0x40125ff8)

struct FLEXCOMM14_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PERSEL:3;
      uint64_t LOCK:1;
      uint64_t USARTPRESENT:1;
      uint64_t SPIPRESENT:1;
      uint64_t I2CPRESENT:1;
      uint64_t I2SPRESENT:1;
      uint64_t reservedSpace0:4;
      uint64_t ID:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PSELID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t Minor_Rev:4;
      uint64_t Major_Rev:4;
      uint64_t ID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PID;

};

#define FLEXCOMM14 (*(volatile struct FLEXCOMM14_tag *) 0x40126ff8)

struct FLEXCOMM15_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PERSEL:3;
      uint64_t LOCK:1;
      uint64_t USARTPRESENT:1;
      uint64_t SPIPRESENT:1;
      uint64_t I2CPRESENT:1;
      uint64_t I2SPRESENT:1;
      uint64_t reservedSpace0:4;
      uint64_t ID:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PSELID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t Minor_Rev:4;
      uint64_t Major_Rev:4;
      uint64_t ID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PID;

};

#define FLEXCOMM15 (*(volatile struct FLEXCOMM15_tag *) 0x40127ff8)

struct I2C0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t MSTEN:1;
      uint64_t SLVEN:1;
      uint64_t MONEN:1;
      uint64_t TIMEOUTEN:1;
      uint64_t MONCLKSTR:1;
      uint64_t HSCAPABLE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MSTPENDING:1;
      uint64_t MSTSTATE:3;
      uint64_t MSTARBLOSS:1;
      uint64_t reservedSpace0:1;
      uint64_t MSTSTSTPERR:1;
      uint64_t reservedSpace1:1;
      uint64_t SLVPENDING:1;
      uint64_t SLVSTATE:2;
      uint64_t SLVNOTSTR:1;
      uint64_t SLVIDX:2;
      uint64_t SLVSEL:1;
      uint64_t SLVDESEL:1;
      uint64_t MONRDY:1;
      uint64_t MONOV:1;
      uint64_t MONACTIVE:1;
      uint64_t MONIDLE:1;
      uint64_t reservedSpace2:4;
      uint64_t EVENTTIMEOUT:1;
      uint64_t SCLTIMEOUT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MSTPENDINGEN:1;
      uint64_t reservedSpace0:3;
      uint64_t MSTARBLOSSEN:1;
      uint64_t reservedSpace1:1;
      uint64_t MSTSTSTPERREN:1;
      uint64_t reservedSpace2:1;
      uint64_t SLVPENDINGEN:1;
      uint64_t reservedSpace3:2;
      uint64_t SLVNOTSTREN:1;
      uint64_t reservedSpace4:3;
      uint64_t SLVDESELEN:1;
      uint64_t MONRDYEN:1;
      uint64_t MONOVEN:1;
      uint64_t reservedSpace5:1;
      uint64_t MONIDLEEN:1;
      uint64_t reservedSpace6:4;
      uint64_t EVENTTIMEOUTEN:1;
      uint64_t SCLTIMEOUTEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTENSET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MSTPENDINGCLR:1;
      uint64_t reservedSpace0:3;
      uint64_t MSTARBLOSSCLR:1;
      uint64_t reservedSpace1:1;
      uint64_t MSTSTSTPERRCLR:1;
      uint64_t reservedSpace2:1;
      uint64_t SLVPENDINGCLR:1;
      uint64_t reservedSpace3:2;
      uint64_t SLVNOTSTRCLR:1;
      uint64_t reservedSpace4:3;
      uint64_t SLVDESELCLR:1;
      uint64_t MONRDYCLR:1;
      uint64_t MONOVCLR:1;
      uint64_t reservedSpace5:1;
      uint64_t MONIDLECLR:1;
      uint64_t reservedSpace6:4;
      uint64_t EVENTTIMEOUTCLR:1;
      uint64_t SCLTIMEOUTCLR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTENCLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TOMIN:4;
      uint64_t TO:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMEOUT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIVVAL:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLKDIV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MSTPENDING:1;
      uint64_t reservedSpace0:3;
      uint64_t MSTARBLOSS:1;
      uint64_t reservedSpace1:1;
      uint64_t MSTSTSTPERR:1;
      uint64_t reservedSpace2:1;
      uint64_t SLVPENDING:1;
      uint64_t reservedSpace3:2;
      uint64_t SLVNOTSTR:1;
      uint64_t reservedSpace4:3;
      uint64_t SLVDESEL:1;
      uint64_t MONRDY:1;
      uint64_t MONOV:1;
      uint64_t reservedSpace5:1;
      uint64_t MONIDLE:1;
      uint64_t reservedSpace6:4;
      uint64_t EVENTTIMEOUT:1;
      uint64_t SCLTIMEOUT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTSTAT;

