iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/IMXRT685_RAM_GCC/targetInit/iMXRT685_sfr.h
  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MSTCONTINUE:1;
      uint64_t MSTSTART:1;
      uint64_t MSTSTOP:1;
      uint64_t MSTDMA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSTCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MSTSCLLOW:3;
      uint64_t reservedSpace0:1;
      uint64_t MSTSCLHIGH:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSTTIME;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSTDAT;

  uint8_t res1[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SLVCONTINUE:1;
      uint64_t SLVNACK:1;
      uint64_t reservedSpace0:1;
      uint64_t SLVDMA:1;
      uint64_t reservedSpace1:4;
      uint64_t AUTOACK:1;
      uint64_t AUTOMATCHREAD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SLVCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SLVDAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SADISABLE:1;
      uint64_t SLVADR:7;
      uint64_t reservedSpace0:7;
      uint64_t AUTONACK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SLVADR_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SADISABLE:1;
      uint64_t SLVADR:7;
      uint64_t reservedSpace0:7;
      uint64_t AUTONACK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SLVADR_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SADISABLE:1;
      uint64_t SLVADR:7;
      uint64_t reservedSpace0:7;
      uint64_t AUTONACK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SLVADR_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SADISABLE:1;
      uint64_t SLVADR:7;
      uint64_t reservedSpace0:7;
      uint64_t AUTONACK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SLVADR_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t QUALMODE0:1;
      uint64_t SLVQUAL0:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SLVQUAL0;

  uint8_t res2[36];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MONRXDAT:8;
      uint64_t MONSTART:1;
      uint64_t MONRESTART:1;
      uint64_t MONNACK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MONRXDAT;

  uint8_t res3[1912];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t APERTURE:8;
      uint64_t MINOR_REV:4;
      uint64_t MAJOR_REV:4;
      uint64_t ID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ID;

};

#define I2C15 (*(volatile struct I2C15_tag *) 0x40127800)

struct I2S0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAINENABLE:1;
      uint64_t DATAPAUSE:1;
      uint64_t PAIRCOUNT:2;
      uint64_t MSTSLVCFG:2;
      uint64_t MODE:2;
      uint64_t RIGHTLOW:1;
      uint64_t LEFTJUST:1;
      uint64_t ONECHANNEL:1;
      uint64_t PDMDATA:1;
      uint64_t SCK_POL:1;
      uint64_t WS_POL:1;
      uint64_t reservedSpace0:2;
      uint64_t DATALEN:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FRAMELEN:11;
      uint64_t reservedSpace0:5;
      uint64_t POSITION:11;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BUSY:1;
      uint64_t SLVFRMERR:1;
      uint64_t LR:1;
      uint64_t DATAPAUSED:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STAT;

  uint8_t res0[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV;

  uint8_t res1[480];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENABLETX:1;
      uint64_t ENABLERX:1;
      uint64_t TXI2SE0:1;
      uint64_t PACK48:1;
      uint64_t SIZE:2;
      uint64_t reservedSpace0:6;
      uint64_t DMATX:1;
      uint64_t DMARX:1;
      uint64_t WAKETX:1;
      uint64_t WAKERX:1;
      uint64_t EMPTYTX:1;
      uint64_t EMPTYRX:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIFOCFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXERR:1;
      uint64_t RXERR:1;
      uint64_t reservedSpace0:1;
      uint64_t PERINT:1;
      uint64_t TXEMPTY:1;
      uint64_t TXNOTFULL:1;
      uint64_t RXNOTEMPTY:1;
      uint64_t RXFULL:1;
      uint64_t TXLVL:5;
      uint64_t reservedSpace1:3;
      uint64_t RXLVL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIFOSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXLVLENA:1;
      uint64_t RXLVLENA:1;
      uint64_t reservedSpace0:6;
      uint64_t TXLVL:4;
      uint64_t reservedSpace1:4;
      uint64_t RXLVL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIFOTRIG;

  uint8_t res2[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXERR:1;
      uint64_t RXERR:1;
      uint64_t TXLVL:1;
      uint64_t RXLVL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIFOINTENSET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXERR:1;
      uint64_t RXERR:1;
      uint64_t TXLVL:1;
      uint64_t RXLVL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIFOINTENCLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXERR:1;
      uint64_t RXERR:1;
      uint64_t TXLVL:1;
      uint64_t RXLVL:1;
      uint64_t PERINT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIFOINTSTAT;

  uint8_t res3[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIFOWR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIFOWR48H;

