iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/IMXRT685_RAM_GCC/targetInit/iMXRT685_sfr.h
  uint8_t res3[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIFOWR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIFOWR48H;

  uint8_t res4[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIFORD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIFORD48H;

  uint8_t res5[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIFORDNOPOP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIFORD48HNOPOP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FIFOSIZE:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIFOSIZE;

  uint8_t res6[432];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t Aperture:8;
      uint64_t Minor_Rev:4;
      uint64_t Major_Rev:4;
      uint64_t ID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ID;

};

#define I2S4 (*(volatile struct I2S4_tag *) 0x40122c00)

struct I2S4_SECCHANNEL_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PAIRENABLE:1;
      uint64_t reservedSpace0:9;
      uint64_t ONECHANNEL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCFG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t POSITION:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCFG2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BUSY:1;
      uint64_t SLVFRMERR:1;
      uint64_t LR:1;
      uint64_t DATAPAUSED:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PSTAT;

};

#define I2S4_SECCHANNEL_0 (*(volatile struct I2S4_SECCHANNEL_0_tag *) 0x40122c20)

struct I2S4_SECCHANNEL_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PAIRENABLE:1;
      uint64_t reservedSpace0:9;
      uint64_t ONECHANNEL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCFG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t POSITION:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCFG2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BUSY:1;
      uint64_t SLVFRMERR:1;
      uint64_t LR:1;
      uint64_t DATAPAUSED:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PSTAT;

};

#define I2S4_SECCHANNEL_1 (*(volatile struct I2S4_SECCHANNEL_1_tag *) 0x40122c40)

struct I2S4_SECCHANNEL_2_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PAIRENABLE:1;
      uint64_t reservedSpace0:9;
      uint64_t ONECHANNEL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCFG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t POSITION:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCFG2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BUSY:1;
      uint64_t SLVFRMERR:1;
      uint64_t LR:1;
      uint64_t DATAPAUSED:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PSTAT;

};

#define I2S4_SECCHANNEL_2 (*(volatile struct I2S4_SECCHANNEL_2_tag *) 0x40122c60)

struct I2S5_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAINENABLE:1;
      uint64_t DATAPAUSE:1;
      uint64_t PAIRCOUNT:2;
      uint64_t MSTSLVCFG:2;
      uint64_t MODE:2;
      uint64_t RIGHTLOW:1;
      uint64_t LEFTJUST:1;
      uint64_t ONECHANNEL:1;
      uint64_t PDMDATA:1;
      uint64_t SCK_POL:1;
      uint64_t WS_POL:1;
      uint64_t reservedSpace0:2;
      uint64_t DATALEN:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FRAMELEN:11;
      uint64_t reservedSpace0:5;
      uint64_t POSITION:11;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BUSY:1;
      uint64_t SLVFRMERR:1;
      uint64_t LR:1;
      uint64_t DATAPAUSED:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STAT;

  uint8_t res0[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV;

  uint8_t res1[480];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENABLETX:1;
      uint64_t ENABLERX:1;
      uint64_t TXI2SE0:1;
      uint64_t PACK48:1;
      uint64_t SIZE:2;
      uint64_t reservedSpace0:6;
      uint64_t DMATX:1;
      uint64_t DMARX:1;
      uint64_t WAKETX:1;
      uint64_t WAKERX:1;
      uint64_t EMPTYTX:1;
      uint64_t EMPTYRX:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIFOCFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXERR:1;
      uint64_t RXERR:1;
      uint64_t reservedSpace0:1;
      uint64_t PERINT:1;
      uint64_t TXEMPTY:1;
      uint64_t TXNOTFULL:1;
      uint64_t RXNOTEMPTY:1;
      uint64_t RXFULL:1;
      uint64_t TXLVL:5;
      uint64_t reservedSpace1:3;
      uint64_t RXLVL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIFOSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXLVLENA:1;
      uint64_t RXLVLENA:1;
      uint64_t reservedSpace0:6;
      uint64_t TXLVL:4;
      uint64_t reservedSpace1:4;
      uint64_t RXLVL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIFOTRIG;

  uint8_t res2[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXERR:1;
      uint64_t RXERR:1;
      uint64_t TXLVL:1;
      uint64_t RXLVL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIFOINTENSET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXERR:1;
      uint64_t RXERR:1;
      uint64_t TXLVL:1;
      uint64_t RXLVL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIFOINTENCLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXERR:1;
      uint64_t RXERR:1;
      uint64_t TXLVL:1;
      uint64_t RXLVL:1;
      uint64_t PERINT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIFOINTSTAT;

