iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/IMXRT685_RAM_GCC/targetInit/iMXRT685_sfr.h
  uint8_t res2[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXERR:1;
      uint64_t RXERR:1;
      uint64_t TXLVL:1;
      uint64_t RXLVL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIFOINTENSET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXERR:1;
      uint64_t RXERR:1;
      uint64_t TXLVL:1;
      uint64_t RXLVL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIFOINTENCLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXERR:1;
      uint64_t RXERR:1;
      uint64_t TXLVL:1;
      uint64_t RXLVL:1;
      uint64_t PERINT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIFOINTSTAT;

  uint8_t res3[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIFOWR;

  uint8_t res4[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:9;
      uint64_t reservedSpace0:4;
      uint64_t FRAMERR:1;
      uint64_t PARITYERR:1;
      uint64_t RXNOISE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIFORD;

  uint8_t res5[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:9;
      uint64_t reservedSpace0:4;
      uint64_t FRAMERR:1;
      uint64_t PARITYERR:1;
      uint64_t RXNOISE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIFORDNOPOP;

  uint8_t res6[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FIFOSIZE:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIFOSIZE;

  uint8_t res7[432];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t APERTURE:8;
      uint64_t MINOR_REV:4;
      uint64_t MAJOR_REV:4;
      uint64_t ID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ID;

};

#define USART1 (*(volatile struct USART1_tag *) 0x40107000)

struct USART2_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENABLE:1;
      uint64_t reservedSpace0:1;
      uint64_t DATALEN:2;
      uint64_t PARITYSEL:2;
      uint64_t STOPLEN:1;
      uint64_t MODE32K:1;
      uint64_t LINMODE:1;
      uint64_t CTSEN:1;
      uint64_t reservedSpace1:1;
      uint64_t SYNCEN:1;
      uint64_t CLKPOL:1;
      uint64_t reservedSpace2:1;
      uint64_t SYNCMST:1;
      uint64_t LOOP:1;
      uint64_t reservedSpace3:2;
      uint64_t OETA:1;
      uint64_t AUTOADDR:1;
      uint64_t OESEL:1;
      uint64_t OEPOL:1;
      uint64_t RXPOL:1;
      uint64_t TXPOL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t TXBRKEN:1;
      uint64_t ADDRDET:1;
      uint64_t reservedSpace1:3;
      uint64_t TXDIS:1;
      uint64_t reservedSpace2:1;
      uint64_t CC:1;
      uint64_t CLRCCONRX:1;
      uint64_t reservedSpace3:6;
      uint64_t AUTOBAUD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t RXIDLE:1;
      uint64_t reservedSpace1:1;
      uint64_t TXIDLE:1;
      uint64_t CTS:1;
      uint64_t DELTACTS:1;
      uint64_t TXDISSTAT:1;
      uint64_t reservedSpace2:3;
      uint64_t RXBRK:1;
      uint64_t DELTARXBRK:1;
      uint64_t START:1;
      uint64_t FRAMERRINT:1;
      uint64_t PARITYERRINT:1;
      uint64_t RXNOISEINT:1;
      uint64_t ABERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t TXIDLEEN:1;
      uint64_t reservedSpace1:1;
      uint64_t DELTACTSEN:1;
      uint64_t TXDISEN:1;
      uint64_t reservedSpace2:4;
      uint64_t DELTARXBRKEN:1;
      uint64_t STARTEN:1;
      uint64_t FRAMERREN:1;
      uint64_t PARITYERREN:1;
      uint64_t RXNOISEEN:1;
      uint64_t ABERREN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTENSET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t TXIDLECLR:1;
      uint64_t reservedSpace1:1;
      uint64_t DELTACTSCLR:1;
      uint64_t TXDISCLR:1;
      uint64_t reservedSpace2:4;
      uint64_t DELTARXBRKCLR:1;
      uint64_t STARTCLR:1;
      uint64_t FRAMERRCLR:1;
      uint64_t PARITYERRCLR:1;
      uint64_t RXNOISECLR:1;
      uint64_t ABERRCLR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTENCLR;

  uint8_t res0[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BRGVAL:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BRG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t TXIDLE:1;
      uint64_t reservedSpace1:1;
      uint64_t DELTACTS:1;
      uint64_t TXDISINT:1;
      uint64_t reservedSpace2:4;
      uint64_t DELTARXBRK:1;
      uint64_t START:1;
      uint64_t FRAMERRINT:1;
      uint64_t PARITYERRINT:1;
      uint64_t RXNOISEINT:1;
      uint64_t ABERRINT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OSRVAL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDRESS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADDR;

  uint8_t res1[3536];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENABLETX:1;
      uint64_t ENABLERX:1;
      uint64_t reservedSpace0:2;
      uint64_t SIZE:2;
      uint64_t reservedSpace1:6;
      uint64_t DMATX:1;
      uint64_t DMARX:1;
      uint64_t WAKETX:1;
      uint64_t WAKERX:1;
      uint64_t EMPTYTX:1;
      uint64_t EMPTYRX:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIFOCFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXERR:1;
      uint64_t RXERR:1;
      uint64_t reservedSpace0:1;
      uint64_t PERINT:1;
      uint64_t TXEMPTY:1;
      uint64_t TXNOTFULL:1;
      uint64_t RXNOTEMPTY:1;
      uint64_t RXFULL:1;
      uint64_t TXLVL:5;
      uint64_t reservedSpace1:3;
      uint64_t RXLVL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIFOSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXLVLENA:1;
      uint64_t RXLVLENA:1;
      uint64_t reservedSpace0:6;
      uint64_t TXLVL:4;
      uint64_t reservedSpace1:4;
      uint64_t RXLVL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIFOTRIG;

