iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/IMXRT685_RAM_GCC/targetInit/iMXRT685_sfr.h
  uint8_t res2[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXERR:1;
      uint64_t RXERR:1;
      uint64_t TXLVL:1;
      uint64_t RXLVL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIFOINTENSET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXERR:1;
      uint64_t RXERR:1;
      uint64_t TXLVL:1;
      uint64_t RXLVL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIFOINTENCLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXERR:1;
      uint64_t RXERR:1;
      uint64_t TXLVL:1;
      uint64_t RXLVL:1;
      uint64_t PERINT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIFOINTSTAT;

  uint8_t res3[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIFOWR;

  uint8_t res4[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:9;
      uint64_t reservedSpace0:4;
      uint64_t FRAMERR:1;
      uint64_t PARITYERR:1;
      uint64_t RXNOISE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIFORD;

  uint8_t res5[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:9;
      uint64_t reservedSpace0:4;
      uint64_t FRAMERR:1;
      uint64_t PARITYERR:1;
      uint64_t RXNOISE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIFORDNOPOP;

  uint8_t res6[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FIFOSIZE:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIFOSIZE;

  uint8_t res7[432];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t APERTURE:8;
      uint64_t MINOR_REV:4;
      uint64_t MAJOR_REV:4;
      uint64_t ID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ID;

};

#define USART7 (*(volatile struct USART7_tag *) 0x40125000)

struct MUA_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEATURE:16;
      uint64_t MINOR:8;
      uint64_t MAJOR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) VER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAMETER:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAR;

  uint8_t res0[24];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TR_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TR_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TR_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TR_3;

  uint8_t res1[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RR_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RR_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RR_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RR_3;

  uint8_t res2[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t Fn:3;
      uint64_t reservedSpace0:1;
      uint64_t EP:1;
      uint64_t PM:2;
      uint64_t RS:1;
      uint64_t FUP:1;
      uint64_t RDIP:1;
      uint64_t RAIP:1;
      uint64_t reservedSpace1:9;
      uint64_t TEn:4;
      uint64_t RFn:4;
      uint64_t GIPn:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t Fn:3;
      uint64_t reservedSpace0:2;
      uint64_t MUR:1;
      uint64_t RDIE:1;
      uint64_t reservedSpace1:5;
      uint64_t RAIE:1;
      uint64_t reservedSpace2:3;
      uint64_t GIRn:4;
      uint64_t TIEn:4;
      uint64_t RIEn:4;
      uint64_t GIEn:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR;

};

#define MUA (*(volatile struct MUA_tag *) 0x40110000)

struct OSTIMER0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t EVTIMER_COUNT_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EVTIMERL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EVTIMER_COUNT_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EVTIMERH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAPTUREn_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAPTUREn_L;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAPTUREn_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAPTUREn_H;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MATCHn_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MATCHn_L;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MATCHn_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MATCHn_H;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OSTIMER_INTRFLAG:1;
      uint64_t OSTIMER_INTENA:1;
      uint64_t MATCH_WR_RDYn:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OSEVENT_CTRL;

};

#define OSTIMER0 (*(volatile struct OSTIMER0_tag *) 0x40113000)

struct DMIC0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN_CH0:1;
      uint64_t EN_CH1:1;
      uint64_t EN_CH2:1;
      uint64_t EN_CH3:1;
      uint64_t EN_CH4:1;
      uint64_t EN_CH5:1;
      uint64_t EN_CH6:1;
      uint64_t EN_CH7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHANEN;

  uint8_t res0[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t USE2FS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USE2FS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH_SYNC_EN:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GLOBAL_SYNC_EN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CCOUNTVAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GLOBAL_COUNT_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DECRESET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DECRESET;

  uint8_t res1[96];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INPUTGAIN:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HWVADGAIN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HPFS:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HWVADHPFS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ST10:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HWVADST10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RSTT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HWVADRSTT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t THGN:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HWVADTHGN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t THGS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HWVADTHGS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOWZ:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HWVADLOWZ;

