iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/IMXRT685_RAM_GCC/targetInit/iMXRT685_sfr.h
};

#define DMIC0 (*(volatile struct DMIC0_tag *) 0x40121f00)

struct DMIC0_CHANNEL_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t OSR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDMDIV:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIVHFCLK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMP:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PREAC2FSCOEF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMP:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PREAC4FSCOEF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GAIN:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GAINSHIFT;

  uint8_t res0[108];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENABLE:1;
      uint64_t RESETN:1;
      uint64_t INTEN:1;
      uint64_t DMAEN:1;
      uint64_t reservedSpace0:12;
      uint64_t TRIGLVL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIFO_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INT:1;
      uint64_t OVERRUN:1;
      uint64_t UNDERRUN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIFO_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIFO_DATA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PHY_FALL:1;
      uint64_t PHY_HALF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PHY_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCPOLE:2;
      uint64_t reservedSpace0:2;
      uint64_t DCGAIN:4;
      uint64_t SATURATEAT16BIT:1;
      uint64_t SIGNEXTEND:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DC_CTRL;

};

#define DMIC0_CHANNEL_0 (*(volatile struct DMIC0_CHANNEL_0_tag *) 0x40121000)

struct DMIC0_CHANNEL_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t OSR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDMDIV:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIVHFCLK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMP:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PREAC2FSCOEF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMP:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PREAC4FSCOEF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GAIN:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GAINSHIFT;

  uint8_t res0[108];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENABLE:1;
      uint64_t RESETN:1;
      uint64_t INTEN:1;
      uint64_t DMAEN:1;
      uint64_t reservedSpace0:12;
      uint64_t TRIGLVL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIFO_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INT:1;
      uint64_t OVERRUN:1;
      uint64_t UNDERRUN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIFO_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIFO_DATA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PHY_FALL:1;
      uint64_t PHY_HALF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PHY_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCPOLE:2;
      uint64_t reservedSpace0:2;
      uint64_t DCGAIN:4;
      uint64_t SATURATEAT16BIT:1;
      uint64_t SIGNEXTEND:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DC_CTRL;

};

#define DMIC0_CHANNEL_1 (*(volatile struct DMIC0_CHANNEL_1_tag *) 0x40121100)

struct DMIC0_CHANNEL_2_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t OSR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDMDIV:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIVHFCLK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMP:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PREAC2FSCOEF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMP:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PREAC4FSCOEF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GAIN:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GAINSHIFT;

  uint8_t res0[108];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENABLE:1;
      uint64_t RESETN:1;
      uint64_t INTEN:1;
      uint64_t DMAEN:1;
      uint64_t reservedSpace0:12;
      uint64_t TRIGLVL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIFO_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INT:1;
      uint64_t OVERRUN:1;
      uint64_t UNDERRUN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIFO_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIFO_DATA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PHY_FALL:1;
      uint64_t PHY_HALF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PHY_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCPOLE:2;
      uint64_t reservedSpace0:2;
      uint64_t DCGAIN:4;
      uint64_t SATURATEAT16BIT:1;
      uint64_t SIGNEXTEND:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DC_CTRL;

};

#define DMIC0_CHANNEL_2 (*(volatile struct DMIC0_CHANNEL_2_tag *) 0x40121200)

struct DMIC0_CHANNEL_3_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t OSR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDMDIV:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIVHFCLK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMP:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PREAC2FSCOEF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMP:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PREAC4FSCOEF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GAIN:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GAINSHIFT;

  uint8_t res0[108];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENABLE:1;
      uint64_t RESETN:1;
      uint64_t INTEN:1;
      uint64_t DMAEN:1;
      uint64_t reservedSpace0:12;
      uint64_t TRIGLVL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIFO_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INT:1;
      uint64_t OVERRUN:1;
      uint64_t UNDERRUN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIFO_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIFO_DATA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PHY_FALL:1;
      uint64_t PHY_HALF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PHY_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCPOLE:2;
      uint64_t reservedSpace0:2;
      uint64_t DCGAIN:4;
      uint64_t SATURATEAT16BIT:1;
      uint64_t SIGNEXTEND:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DC_CTRL;

