iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/IMXRT685_RAM_GCC/targetInit/iMXRT685_sfr.h
};

#define DMIC0_CHANNEL_7 (*(volatile struct DMIC0_CHANNEL_7_tag *) 0x40121700)

struct OCOTP_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_17;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_18;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_19;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_20;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_21;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_22;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_23;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_24;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_25;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_26;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_27;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_28;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_29;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_30;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_31;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_32;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_33;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_34;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_35;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_36;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_37;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_38;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_39;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_40;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_41;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_42;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_43;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_44;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_45;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_46;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_47;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_48;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_49;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_50;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_51;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_52;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_53;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_54;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_55;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_56;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_57;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_58;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_59;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_60;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_61;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_62;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_63;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_64;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_65;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_66;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_67;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_68;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_69;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_70;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_71;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_72;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_73;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_74;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_75;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_76;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_77;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_78;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_79;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_80;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_81;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_82;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_83;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_84;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_85;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_86;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_87;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_88;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_89;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_90;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_91;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_92;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_93;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_94;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_95;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_96;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_97;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_98;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_99;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_100;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_101;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_102;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_103;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_104;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_105;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_106;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_107;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_108;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_109;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_110;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_111;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_112;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_113;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_114;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_115;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_116;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_117;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_118;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_119;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_120;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_121;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_122;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_123;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_124;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_125;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_126;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_127;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_128;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_129;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_130;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_131;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_132;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_133;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_134;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_135;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_136;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_137;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_138;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_139;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_140;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_141;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_142;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_143;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_144;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_145;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_146;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_147;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_148;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_149;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_150;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_151;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_152;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_153;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_154;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_155;

