iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/IMXRT685_RAM_GCC/targetInit/iMXRT685_sfr.h
  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_156;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_157;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_158;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_159;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_160;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_161;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_162;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_163;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_164;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_165;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_166;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_167;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_168;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_169;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_170;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_171;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_172;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_173;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_174;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_175;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_176;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_177;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_178;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_179;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_180;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_181;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_182;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_183;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_184;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_185;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_186;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_187;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_188;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_189;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_190;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_191;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_192;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_193;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_194;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_195;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_196;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_197;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_198;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_199;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_200;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_201;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_202;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_203;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_204;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_205;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_206;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_207;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_208;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_209;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_210;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_211;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_212;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_213;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_214;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_215;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_216;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_217;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_218;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_219;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_220;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_221;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_222;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_223;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_224;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_225;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_226;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_227;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_228;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_229;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_230;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_231;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_232;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_233;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_234;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_235;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_236;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_237;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_238;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_239;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_240;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_241;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_242;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_243;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_244;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_245;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_246;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_247;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_248;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_249;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_250;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_251;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_252;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_253;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_254;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_255;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_256;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_257;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_258;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_259;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_260;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_261;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_262;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_263;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_264;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_265;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_266;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_267;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_268;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_269;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_270;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_271;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_272;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_273;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_274;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_275;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_276;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_277;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_278;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_279;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_280;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_281;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_282;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_283;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_284;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_285;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_286;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_287;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_288;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_289;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_290;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_291;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_292;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_293;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_294;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_295;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_296;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_297;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_298;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_299;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_300;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_301;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_302;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_303;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_304;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_305;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_306;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_307;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_308;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_309;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_310;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_311;

