iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/IMXRT685_RAM_GCC/targetInit/iMXRT685_sfr.h
  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_312;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_313;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_314;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_315;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_316;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_317;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_318;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_319;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_320;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_321;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_322;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_323;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_324;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_325;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_326;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_327;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_328;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_329;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_330;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_331;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_332;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_333;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_334;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_335;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_336;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_337;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_338;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_339;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_340;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_341;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_342;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_343;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_344;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_345;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_346;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_347;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_348;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_349;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_350;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_351;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_352;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_353;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_354;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_355;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_356;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_357;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_358;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_359;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_360;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_361;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_362;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_363;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_364;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_365;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_366;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_367;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_368;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_369;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_370;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_371;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_372;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_373;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_374;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_375;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_376;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_377;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_378;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_379;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_380;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_381;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_382;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_383;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_384;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_385;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_386;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_387;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_388;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_389;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_390;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_391;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_392;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_393;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_394;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_395;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_396;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_397;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_398;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_399;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_400;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_401;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_402;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_403;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_404;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_405;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_406;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_407;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_408;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_409;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_410;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_411;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_412;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_413;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_414;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_415;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_416;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_417;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_418;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_419;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_420;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_421;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_422;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_423;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_424;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_425;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_426;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_427;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_428;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_429;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_430;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_431;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_432;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_433;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_434;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_435;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_436;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_437;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_438;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_439;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_440;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_441;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_442;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_443;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_444;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_445;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_446;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_447;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_448;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_449;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_450;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_451;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_452;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_453;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_454;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_455;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_456;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_457;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_458;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_459;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_460;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_461;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_462;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_463;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_464;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_465;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_466;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_467;

