iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/IMXRT685_RAM_GCC/targetInit/iMXRT685_sfr.h
  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_468;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_469;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_470;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_471;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_472;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_473;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_474;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_475;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_476;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_477;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_478;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_479;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_480;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_481;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_482;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_483;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_484;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_485;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_486;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_487;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_488;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_489;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_490;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_491;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_492;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_493;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_494;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t shadow:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_SHADOW_495;

  uint8_t res0[64];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDR:9;
      uint64_t reservedSpace0:2;
      uint64_t RELOAD_SHADOWS:1;
      uint64_t CRC_TEST:1;
      uint64_t reservedSpace1:2;
      uint64_t WORDLOCK:1;
      uint64_t WR_UNLOCK:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_PDN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WRITE_DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_WRITE_DATA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t READ:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_READ_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t READ_DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_READ_DATA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV:4;
      uint64_t reservedSpace0:25;
      uint64_t RESET:1;
      uint64_t HALT:1;
      uint64_t REQFLAG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_CLK_DIV;

  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRC_START_ADDR:9;
      uint64_t reservedSpace0:3;
      uint64_t CRC_END_ADDR:9;
      uint64_t reservedSpace1:3;
      uint64_t CRC_REF_ADDR:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_CRC_ADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRC_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_CRC_VALUE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:9;
      uint64_t SEC:1;
      uint64_t DED:1;
      uint64_t LOCKED:1;
      uint64_t PROGFAIL:1;
      uint64_t ACK:1;
      uint64_t PWOK:1;
      uint64_t reservedSpace1:5;
      uint64_t SEC_RELOAD:1;
      uint64_t DED_RELOAD:1;
      uint64_t BUSY:1;
      uint64_t ERROR:1;
      uint64_t CRC_FAIL:1;
      uint64_t FUSE_LATCHED:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_STATUS;

