iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/IMXRT685_RAM_GCC/targetInit/iMXRT685_sfr.h
  uint8_t res2[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STEP_VER:16;
      uint64_t MINOR_VER:8;
      uint64_t MAJOR_VER:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTP_VERSION;

};

#define OCOTP (*(volatile struct OCOTP_tag *) 0x40130000)

struct FLEXSPI_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SWRESET:1;
      uint64_t MDIS:1;
      uint64_t reservedSpace0:2;
      uint64_t RXCLKSRC:2;
      uint64_t reservedSpace1:2;
      uint64_t SERCLKDIV:3;
      uint64_t HSEN:1;
      uint64_t DOZEEN:1;
      uint64_t COMBINATIONEN:1;
      uint64_t SCKFREERUNEN:1;
      uint64_t LEARNEN:1;
      uint64_t IPGRANTWAIT:8;
      uint64_t AHBGRANTWAIT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AHBBUSWAIT:16;
      uint64_t SEQWAIT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:11;
      uint64_t CLRAHBBUFOPT:1;
      uint64_t reservedSpace1:2;
      uint64_t CLRLEARNPHASE:1;
      uint64_t SAMEDEVICEEN:1;
      uint64_t reservedSpace2:3;
      uint64_t SCKBDIFFOPT:1;
      uint64_t reservedSpace3:4;
      uint64_t RESUMEWAIT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t APAREN:1;
      uint64_t reservedSpace0:2;
      uint64_t CACHABLEEN:1;
      uint64_t BUFFERABLEEN:1;
      uint64_t PREFETCHEN:1;
      uint64_t READADDROPT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AHBCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IPCMDDONEEN:1;
      uint64_t IPCMDGEEN:1;
      uint64_t AHBCMDGEEN:1;
      uint64_t IPCMDERREN:1;
      uint64_t AHBCMDERREN:1;
      uint64_t IPRXWAEN:1;
      uint64_t IPTXWEEN:1;
      uint64_t DATALEARNFAILEN:1;
      uint64_t SCKSTOPBYRDEN:1;
      uint64_t SCKSTOPBYWREN:1;
      uint64_t AHBBUSTIMEOUTEN:1;
      uint64_t SEQTIMEOUTEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IPCMDDONE:1;
      uint64_t IPCMDGE:1;
      uint64_t AHBCMDGE:1;
      uint64_t IPCMDERR:1;
      uint64_t AHBCMDERR:1;
      uint64_t IPRXWA:1;
      uint64_t IPTXWE:1;
      uint64_t DATALEARNFAIL:1;
      uint64_t SCKSTOPBYRD:1;
      uint64_t SCKSTOPBYWR:1;
      uint64_t AHBBUSTIMEOUT:1;
      uint64_t SEQTIMEOUT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t KEY:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUTKEY;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCK:1;
      uint64_t UNLOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUTCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BUFSZ:9;
      uint64_t reservedSpace0:7;
      uint64_t MSTRID:4;
      uint64_t reservedSpace1:4;
      uint64_t PRIORITY:3;
      uint64_t reservedSpace2:4;
      uint64_t PREFETCHEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AHBRXBUF0CR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BUFSZ:9;
      uint64_t reservedSpace0:7;
      uint64_t MSTRID:4;
      uint64_t reservedSpace1:4;
      uint64_t PRIORITY:3;
      uint64_t reservedSpace2:4;
      uint64_t PREFETCHEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AHBRXBUF1CR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BUFSZ:9;
      uint64_t reservedSpace0:7;
      uint64_t MSTRID:4;
      uint64_t reservedSpace1:4;
      uint64_t PRIORITY:3;
      uint64_t reservedSpace2:4;
      uint64_t PREFETCHEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AHBRXBUF2CR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BUFSZ:9;
      uint64_t reservedSpace0:7;
      uint64_t MSTRID:4;
      uint64_t reservedSpace1:4;
      uint64_t PRIORITY:3;
      uint64_t reservedSpace2:4;
      uint64_t PREFETCHEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AHBRXBUF3CR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BUFSZ:9;
      uint64_t reservedSpace0:7;
      uint64_t MSTRID:4;
      uint64_t reservedSpace1:4;
      uint64_t PRIORITY:3;
      uint64_t reservedSpace2:4;
      uint64_t PREFETCHEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AHBRXBUF4CR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BUFSZ:9;
      uint64_t reservedSpace0:7;
      uint64_t MSTRID:4;
      uint64_t reservedSpace1:4;
      uint64_t PRIORITY:3;
      uint64_t reservedSpace2:4;
      uint64_t PREFETCHEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AHBRXBUF5CR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BUFSZ:9;
      uint64_t reservedSpace0:7;
      uint64_t MSTRID:4;
      uint64_t reservedSpace1:4;
      uint64_t PRIORITY:3;
      uint64_t reservedSpace2:4;
      uint64_t PREFETCHEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AHBRXBUF6CR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BUFSZ:9;
      uint64_t reservedSpace0:7;
      uint64_t MSTRID:4;
      uint64_t reservedSpace1:4;
      uint64_t PRIORITY:3;
      uint64_t reservedSpace2:4;
      uint64_t PREFETCHEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AHBRXBUF7CR0;

  uint8_t res0[32];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLSHSZ:23;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLSHA1CR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLSHSZ:23;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLSHA2CR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLSHSZ:23;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLSHB1CR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLSHSZ:23;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLSHB2CR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TCSS:5;
      uint64_t TCSH:5;
      uint64_t WA:1;
      uint64_t CAS:4;
      uint64_t CSINTERVALUNIT:1;
      uint64_t CSINTERVAL:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLSHCR1A1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TCSS:5;
      uint64_t TCSH:5;
      uint64_t WA:1;
      uint64_t CAS:4;
      uint64_t CSINTERVALUNIT:1;
      uint64_t CSINTERVAL:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLSHCR1A2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TCSS:5;
      uint64_t TCSH:5;
      uint64_t WA:1;
      uint64_t CAS:4;
      uint64_t CSINTERVALUNIT:1;
      uint64_t CSINTERVAL:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLSHCR1B1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TCSS:5;
      uint64_t TCSH:5;
      uint64_t WA:1;
      uint64_t CAS:4;
      uint64_t CSINTERVALUNIT:1;
      uint64_t CSINTERVAL:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLSHCR1B2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARDSEQID:5;
      uint64_t ARDSEQNUM:3;
      uint64_t AWRSEQID:5;
      uint64_t AWRSEQNUM:3;
      uint64_t AWRWAIT:12;
      uint64_t AWRWAITUNIT:3;
      uint64_t CLRINSTRPTR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLSHCR2A1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARDSEQID:5;
      uint64_t ARDSEQNUM:3;
      uint64_t AWRSEQID:5;
      uint64_t AWRSEQNUM:3;
      uint64_t AWRWAIT:12;
      uint64_t AWRWAITUNIT:3;
      uint64_t CLRINSTRPTR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLSHCR2A2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARDSEQID:5;
      uint64_t ARDSEQNUM:3;
      uint64_t AWRSEQID:5;
      uint64_t AWRSEQNUM:3;
      uint64_t AWRWAIT:12;
      uint64_t AWRWAITUNIT:3;
      uint64_t CLRINSTRPTR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLSHCR2B1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARDSEQID:5;
      uint64_t ARDSEQNUM:3;
      uint64_t AWRSEQID:5;
      uint64_t AWRSEQNUM:3;
      uint64_t AWRWAIT:12;
      uint64_t AWRWAITUNIT:3;
      uint64_t CLRINSTRPTR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLSHCR2B2;

