iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/IMXRT685_RAM_GCC/targetInit/iMXRT685_sfr.h
  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WMOPT1:1;
      uint64_t reservedSpace0:1;
      uint64_t WMENA:1;
      uint64_t WMENB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLSHCR4;

  uint8_t res2[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SFAR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IPCR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IDATSZ:16;
      uint64_t ISEQID:5;
      uint64_t reservedSpace0:3;
      uint64_t ISEQNUM:3;
      uint64_t reservedSpace1:4;
      uint64_t IPAREN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IPCR1;

  uint8_t res3[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IPCMD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DLP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DLPR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLRIPRXF:1;
      uint64_t RXDMAEN:1;
      uint64_t RXWMRK:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IPRXFCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLRIPTXF:1;
      uint64_t TXDMAEN:1;
      uint64_t TXWMRK:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IPTXFCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DLLEN:1;
      uint64_t DLLRESET:1;
      uint64_t reservedSpace0:1;
      uint64_t SLVDLYTARGET:4;
      uint64_t reservedSpace1:1;
      uint64_t OVRDEN:1;
      uint64_t OVRDVAL:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DLLCRA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DLLEN:1;
      uint64_t DLLRESET:1;
      uint64_t reservedSpace0:1;
      uint64_t SLVDLYTARGET:4;
      uint64_t reservedSpace1:1;
      uint64_t OVRDEN:1;
      uint64_t OVRDVAL:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DLLCRB;

  uint8_t res4[24];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEQIDLE:1;
      uint64_t ARBIDLE:1;
      uint64_t ARBCMDSRC:2;
      uint64_t DATALEARNPHASEA:4;
      uint64_t DATALEARNPHASEB:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STS0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AHBCMDERRID:5;
      uint64_t reservedSpace0:3;
      uint64_t AHBCMDERRCODE:4;
      uint64_t reservedSpace1:4;
      uint64_t IPCMDERRID:5;
      uint64_t reservedSpace2:3;
      uint64_t IPCMDERRCODE:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STS1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ASLVLOCK:1;
      uint64_t AREFLOCK:1;
      uint64_t ASLVSEL:6;
      uint64_t AREFSEL:6;
      uint64_t reservedSpace0:2;
      uint64_t BSLVLOCK:1;
      uint64_t BREFLOCK:1;
      uint64_t BSLVSEL:6;
      uint64_t BREFSEL:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STS2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ACTIVE:1;
      uint64_t BUFID:3;
      uint64_t reservedSpace0:12;
      uint64_t DATLFT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AHBSPNDSTS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FILL:8;
      uint64_t reservedSpace0:8;
      uint64_t RDCNTR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IPRXFSTS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FILL:8;
      uint64_t reservedSpace0:8;
      uint64_t WRCNTR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IPTXFSTS;

  uint8_t res5[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RFDR_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RFDR_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RFDR_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RFDR_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RFDR_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RFDR_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RFDR_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RFDR_7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RFDR_8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RFDR_9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RFDR_10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RFDR_11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RFDR_12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RFDR_13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RFDR_14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RFDR_15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RFDR_16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RFDR_17;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RFDR_18;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RFDR_19;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RFDR_20;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RFDR_21;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RFDR_22;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RFDR_23;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RFDR_24;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RFDR_25;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RFDR_26;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RFDR_27;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RFDR_28;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RFDR_29;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RFDR_30;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RFDR_31;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TFDR_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TFDR_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TFDR_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TFDR_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TFDR_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TFDR_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TFDR_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TFDR_7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TFDR_8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TFDR_9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TFDR_10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TFDR_11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TFDR_12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TFDR_13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TFDR_14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TFDR_15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TFDR_16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TFDR_17;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TFDR_18;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TFDR_19;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TFDR_20;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TFDR_21;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TFDR_22;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TFDR_23;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TFDR_24;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TFDR_25;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TFDR_26;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TFDR_27;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TFDR_28;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TFDR_29;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TFDR_30;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TFDR_31;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPERAND0:8;
      uint64_t NUM_PADS0:2;
      uint64_t OPCODE0:6;
      uint64_t OPERAND1:8;
      uint64_t NUM_PADS1:2;
      uint64_t OPCODE1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPERAND0:8;
      uint64_t NUM_PADS0:2;
      uint64_t OPCODE0:6;
      uint64_t OPERAND1:8;
      uint64_t NUM_PADS1:2;
      uint64_t OPCODE1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPERAND0:8;
      uint64_t NUM_PADS0:2;
      uint64_t OPCODE0:6;
      uint64_t OPERAND1:8;
      uint64_t NUM_PADS1:2;
      uint64_t OPCODE1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPERAND0:8;
      uint64_t NUM_PADS0:2;
      uint64_t OPCODE0:6;
      uint64_t OPERAND1:8;
      uint64_t NUM_PADS1:2;
      uint64_t OPCODE1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPERAND0:8;
      uint64_t NUM_PADS0:2;
      uint64_t OPCODE0:6;
      uint64_t OPERAND1:8;
      uint64_t NUM_PADS1:2;
      uint64_t OPCODE1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPERAND0:8;
      uint64_t NUM_PADS0:2;
      uint64_t OPCODE0:6;
      uint64_t OPERAND1:8;
      uint64_t NUM_PADS1:2;
      uint64_t OPCODE1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPERAND0:8;
      uint64_t NUM_PADS0:2;
      uint64_t OPCODE0:6;
      uint64_t OPERAND1:8;
      uint64_t NUM_PADS1:2;
      uint64_t OPCODE1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPERAND0:8;
      uint64_t NUM_PADS0:2;
      uint64_t OPCODE0:6;
      uint64_t OPERAND1:8;
      uint64_t NUM_PADS1:2;
      uint64_t OPCODE1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT_7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPERAND0:8;
      uint64_t NUM_PADS0:2;
      uint64_t OPCODE0:6;
      uint64_t OPERAND1:8;
      uint64_t NUM_PADS1:2;
      uint64_t OPCODE1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT_8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPERAND0:8;
      uint64_t NUM_PADS0:2;
      uint64_t OPCODE0:6;
      uint64_t OPERAND1:8;
      uint64_t NUM_PADS1:2;
      uint64_t OPCODE1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT_9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPERAND0:8;
      uint64_t NUM_PADS0:2;
      uint64_t OPCODE0:6;
      uint64_t OPERAND1:8;
      uint64_t NUM_PADS1:2;
      uint64_t OPCODE1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT_10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPERAND0:8;
      uint64_t NUM_PADS0:2;
      uint64_t OPCODE0:6;
      uint64_t OPERAND1:8;
      uint64_t NUM_PADS1:2;
      uint64_t OPCODE1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT_11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPERAND0:8;
      uint64_t NUM_PADS0:2;
      uint64_t OPCODE0:6;
      uint64_t OPERAND1:8;
      uint64_t NUM_PADS1:2;
      uint64_t OPCODE1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT_12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPERAND0:8;
      uint64_t NUM_PADS0:2;
      uint64_t OPCODE0:6;
      uint64_t OPERAND1:8;
      uint64_t NUM_PADS1:2;
      uint64_t OPCODE1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT_13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPERAND0:8;
      uint64_t NUM_PADS0:2;
      uint64_t OPCODE0:6;
      uint64_t OPERAND1:8;
      uint64_t NUM_PADS1:2;
      uint64_t OPCODE1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT_14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPERAND0:8;
      uint64_t NUM_PADS0:2;
      uint64_t OPCODE0:6;
      uint64_t OPERAND1:8;
      uint64_t NUM_PADS1:2;
      uint64_t OPCODE1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT_15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPERAND0:8;
      uint64_t NUM_PADS0:2;
      uint64_t OPCODE0:6;
      uint64_t OPERAND1:8;
      uint64_t NUM_PADS1:2;
      uint64_t OPCODE1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT_16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPERAND0:8;
      uint64_t NUM_PADS0:2;
      uint64_t OPCODE0:6;
      uint64_t OPERAND1:8;
      uint64_t NUM_PADS1:2;
      uint64_t OPCODE1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT_17;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPERAND0:8;
      uint64_t NUM_PADS0:2;
      uint64_t OPCODE0:6;
      uint64_t OPERAND1:8;
      uint64_t NUM_PADS1:2;
      uint64_t OPCODE1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT_18;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPERAND0:8;
      uint64_t NUM_PADS0:2;
      uint64_t OPCODE0:6;
      uint64_t OPERAND1:8;
      uint64_t NUM_PADS1:2;
      uint64_t OPCODE1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT_19;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPERAND0:8;
      uint64_t NUM_PADS0:2;
      uint64_t OPCODE0:6;
      uint64_t OPERAND1:8;
      uint64_t NUM_PADS1:2;
      uint64_t OPCODE1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT_20;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPERAND0:8;
      uint64_t NUM_PADS0:2;
      uint64_t OPCODE0:6;
      uint64_t OPERAND1:8;
      uint64_t NUM_PADS1:2;
      uint64_t OPCODE1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT_21;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPERAND0:8;
      uint64_t NUM_PADS0:2;
      uint64_t OPCODE0:6;
      uint64_t OPERAND1:8;
      uint64_t NUM_PADS1:2;
      uint64_t OPCODE1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT_22;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPERAND0:8;
      uint64_t NUM_PADS0:2;
      uint64_t OPCODE0:6;
      uint64_t OPERAND1:8;
      uint64_t NUM_PADS1:2;
      uint64_t OPCODE1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT_23;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPERAND0:8;
      uint64_t NUM_PADS0:2;
      uint64_t OPCODE0:6;
      uint64_t OPERAND1:8;
      uint64_t NUM_PADS1:2;
      uint64_t OPCODE1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT_24;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPERAND0:8;
      uint64_t NUM_PADS0:2;
      uint64_t OPCODE0:6;
      uint64_t OPERAND1:8;
      uint64_t NUM_PADS1:2;
      uint64_t OPCODE1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT_25;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPERAND0:8;
      uint64_t NUM_PADS0:2;
      uint64_t OPCODE0:6;
      uint64_t OPERAND1:8;
      uint64_t NUM_PADS1:2;
      uint64_t OPCODE1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT_26;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPERAND0:8;
      uint64_t NUM_PADS0:2;
      uint64_t OPCODE0:6;
      uint64_t OPERAND1:8;
      uint64_t NUM_PADS1:2;
      uint64_t OPCODE1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT_27;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPERAND0:8;
      uint64_t NUM_PADS0:2;
      uint64_t OPCODE0:6;
      uint64_t OPERAND1:8;
      uint64_t NUM_PADS1:2;
      uint64_t OPCODE1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT_28;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPERAND0:8;
      uint64_t NUM_PADS0:2;
      uint64_t OPCODE0:6;
      uint64_t OPERAND1:8;
      uint64_t NUM_PADS1:2;
      uint64_t OPCODE1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT_29;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPERAND0:8;
      uint64_t NUM_PADS0:2;
      uint64_t OPCODE0:6;
      uint64_t OPERAND1:8;
      uint64_t NUM_PADS1:2;
      uint64_t OPCODE1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT_30;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPERAND0:8;
      uint64_t NUM_PADS0:2;
      uint64_t OPCODE0:6;
      uint64_t OPERAND1:8;
      uint64_t NUM_PADS1:2;
      uint64_t OPCODE1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT_31;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPERAND0:8;
      uint64_t NUM_PADS0:2;
      uint64_t OPCODE0:6;
      uint64_t OPERAND1:8;
      uint64_t NUM_PADS1:2;
      uint64_t OPCODE1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT_32;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPERAND0:8;
      uint64_t NUM_PADS0:2;
      uint64_t OPCODE0:6;
      uint64_t OPERAND1:8;
      uint64_t NUM_PADS1:2;
      uint64_t OPCODE1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT_33;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPERAND0:8;
      uint64_t NUM_PADS0:2;
      uint64_t OPCODE0:6;
      uint64_t OPERAND1:8;
      uint64_t NUM_PADS1:2;
      uint64_t OPCODE1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT_34;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPERAND0:8;
      uint64_t NUM_PADS0:2;
      uint64_t OPCODE0:6;
      uint64_t OPERAND1:8;
      uint64_t NUM_PADS1:2;
      uint64_t OPCODE1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT_35;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPERAND0:8;
      uint64_t NUM_PADS0:2;
      uint64_t OPCODE0:6;
      uint64_t OPERAND1:8;
      uint64_t NUM_PADS1:2;
      uint64_t OPCODE1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT_36;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPERAND0:8;
      uint64_t NUM_PADS0:2;
      uint64_t OPCODE0:6;
      uint64_t OPERAND1:8;
      uint64_t NUM_PADS1:2;
      uint64_t OPCODE1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT_37;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPERAND0:8;
      uint64_t NUM_PADS0:2;
      uint64_t OPCODE0:6;
      uint64_t OPERAND1:8;
      uint64_t NUM_PADS1:2;
      uint64_t OPCODE1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT_38;

