iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/IMXRT685_RAM_GCC/targetInit/iMXRT685_sfr.h
  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPERAND0:8;
      uint64_t NUM_PADS0:2;
      uint64_t OPCODE0:6;
      uint64_t OPERAND1:8;
      uint64_t NUM_PADS1:2;
      uint64_t OPCODE1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT_39;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPERAND0:8;
      uint64_t NUM_PADS0:2;
      uint64_t OPCODE0:6;
      uint64_t OPERAND1:8;
      uint64_t NUM_PADS1:2;
      uint64_t OPCODE1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT_40;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPERAND0:8;
      uint64_t NUM_PADS0:2;
      uint64_t OPCODE0:6;
      uint64_t OPERAND1:8;
      uint64_t NUM_PADS1:2;
      uint64_t OPCODE1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT_41;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPERAND0:8;
      uint64_t NUM_PADS0:2;
      uint64_t OPCODE0:6;
      uint64_t OPERAND1:8;
      uint64_t NUM_PADS1:2;
      uint64_t OPCODE1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT_42;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPERAND0:8;
      uint64_t NUM_PADS0:2;
      uint64_t OPCODE0:6;
      uint64_t OPERAND1:8;
      uint64_t NUM_PADS1:2;
      uint64_t OPCODE1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT_43;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPERAND0:8;
      uint64_t NUM_PADS0:2;
      uint64_t OPCODE0:6;
      uint64_t OPERAND1:8;
      uint64_t NUM_PADS1:2;
      uint64_t OPCODE1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT_44;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPERAND0:8;
      uint64_t NUM_PADS0:2;
      uint64_t OPCODE0:6;
      uint64_t OPERAND1:8;
      uint64_t NUM_PADS1:2;
      uint64_t OPCODE1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT_45;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPERAND0:8;
      uint64_t NUM_PADS0:2;
      uint64_t OPCODE0:6;
      uint64_t OPERAND1:8;
      uint64_t NUM_PADS1:2;
      uint64_t OPCODE1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT_46;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPERAND0:8;
      uint64_t NUM_PADS0:2;
      uint64_t OPCODE0:6;
      uint64_t OPERAND1:8;
      uint64_t NUM_PADS1:2;
      uint64_t OPCODE1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT_47;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPERAND0:8;
      uint64_t NUM_PADS0:2;
      uint64_t OPCODE0:6;
      uint64_t OPERAND1:8;
      uint64_t NUM_PADS1:2;
      uint64_t OPCODE1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT_48;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPERAND0:8;
      uint64_t NUM_PADS0:2;
      uint64_t OPCODE0:6;
      uint64_t OPERAND1:8;
      uint64_t NUM_PADS1:2;
      uint64_t OPCODE1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT_49;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPERAND0:8;
      uint64_t NUM_PADS0:2;
      uint64_t OPCODE0:6;
      uint64_t OPERAND1:8;
      uint64_t NUM_PADS1:2;
      uint64_t OPCODE1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT_50;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPERAND0:8;
      uint64_t NUM_PADS0:2;
      uint64_t OPCODE0:6;
      uint64_t OPERAND1:8;
      uint64_t NUM_PADS1:2;
      uint64_t OPCODE1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT_51;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPERAND0:8;
      uint64_t NUM_PADS0:2;
      uint64_t OPCODE0:6;
      uint64_t OPERAND1:8;
      uint64_t NUM_PADS1:2;
      uint64_t OPCODE1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT_52;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPERAND0:8;
      uint64_t NUM_PADS0:2;
      uint64_t OPCODE0:6;
      uint64_t OPERAND1:8;
      uint64_t NUM_PADS1:2;
      uint64_t OPCODE1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT_53;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPERAND0:8;
      uint64_t NUM_PADS0:2;
      uint64_t OPCODE0:6;
      uint64_t OPERAND1:8;
      uint64_t NUM_PADS1:2;
      uint64_t OPCODE1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT_54;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPERAND0:8;
      uint64_t NUM_PADS0:2;
      uint64_t OPCODE0:6;
      uint64_t OPERAND1:8;
      uint64_t NUM_PADS1:2;
      uint64_t OPCODE1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT_55;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPERAND0:8;
      uint64_t NUM_PADS0:2;
      uint64_t OPCODE0:6;
      uint64_t OPERAND1:8;
      uint64_t NUM_PADS1:2;
      uint64_t OPCODE1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT_56;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPERAND0:8;
      uint64_t NUM_PADS0:2;
      uint64_t OPCODE0:6;
      uint64_t OPERAND1:8;
      uint64_t NUM_PADS1:2;
      uint64_t OPCODE1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT_57;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPERAND0:8;
      uint64_t NUM_PADS0:2;
      uint64_t OPCODE0:6;
      uint64_t OPERAND1:8;
      uint64_t NUM_PADS1:2;
      uint64_t OPCODE1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT_58;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPERAND0:8;
      uint64_t NUM_PADS0:2;
      uint64_t OPCODE0:6;
      uint64_t OPERAND1:8;
      uint64_t NUM_PADS1:2;
      uint64_t OPCODE1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT_59;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPERAND0:8;
      uint64_t NUM_PADS0:2;
      uint64_t OPCODE0:6;
      uint64_t OPERAND1:8;
      uint64_t NUM_PADS1:2;
      uint64_t OPCODE1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT_60;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPERAND0:8;
      uint64_t NUM_PADS0:2;
      uint64_t OPCODE0:6;
      uint64_t OPERAND1:8;
      uint64_t NUM_PADS1:2;
      uint64_t OPCODE1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT_61;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPERAND0:8;
      uint64_t NUM_PADS0:2;
      uint64_t OPCODE0:6;
      uint64_t OPERAND1:8;
      uint64_t NUM_PADS1:2;
      uint64_t OPCODE1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT_62;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPERAND0:8;
      uint64_t NUM_PADS0:2;
      uint64_t OPCODE0:6;
      uint64_t OPERAND1:8;
      uint64_t NUM_PADS1:2;
      uint64_t OPCODE1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT_63;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPERAND0:8;
      uint64_t NUM_PADS0:2;
      uint64_t OPCODE0:6;
      uint64_t OPERAND1:8;
      uint64_t NUM_PADS1:2;
      uint64_t OPCODE1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT_64;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPERAND0:8;
      uint64_t NUM_PADS0:2;
      uint64_t OPCODE0:6;
      uint64_t OPERAND1:8;
      uint64_t NUM_PADS1:2;
      uint64_t OPCODE1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT_65;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPERAND0:8;
      uint64_t NUM_PADS0:2;
      uint64_t OPCODE0:6;
      uint64_t OPERAND1:8;
      uint64_t NUM_PADS1:2;
      uint64_t OPCODE1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT_66;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPERAND0:8;
      uint64_t NUM_PADS0:2;
      uint64_t OPCODE0:6;
      uint64_t OPERAND1:8;
      uint64_t NUM_PADS1:2;
      uint64_t OPCODE1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT_67;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPERAND0:8;
      uint64_t NUM_PADS0:2;
      uint64_t OPCODE0:6;
      uint64_t OPERAND1:8;
      uint64_t NUM_PADS1:2;
      uint64_t OPCODE1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT_68;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPERAND0:8;
      uint64_t NUM_PADS0:2;
      uint64_t OPCODE0:6;
      uint64_t OPERAND1:8;
      uint64_t NUM_PADS1:2;
      uint64_t OPCODE1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT_69;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPERAND0:8;
      uint64_t NUM_PADS0:2;
      uint64_t OPCODE0:6;
      uint64_t OPERAND1:8;
      uint64_t NUM_PADS1:2;
      uint64_t OPCODE1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT_70;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPERAND0:8;
      uint64_t NUM_PADS0:2;
      uint64_t OPCODE0:6;
      uint64_t OPERAND1:8;
      uint64_t NUM_PADS1:2;
      uint64_t OPCODE1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT_71;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPERAND0:8;
      uint64_t NUM_PADS0:2;
      uint64_t OPCODE0:6;
      uint64_t OPERAND1:8;
      uint64_t NUM_PADS1:2;
      uint64_t OPCODE1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT_72;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPERAND0:8;
      uint64_t NUM_PADS0:2;
      uint64_t OPCODE0:6;
      uint64_t OPERAND1:8;
      uint64_t NUM_PADS1:2;
      uint64_t OPCODE1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT_73;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPERAND0:8;
      uint64_t NUM_PADS0:2;
      uint64_t OPCODE0:6;
      uint64_t OPERAND1:8;
      uint64_t NUM_PADS1:2;
      uint64_t OPCODE1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT_74;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPERAND0:8;
      uint64_t NUM_PADS0:2;
      uint64_t OPCODE0:6;
      uint64_t OPERAND1:8;
      uint64_t NUM_PADS1:2;
      uint64_t OPCODE1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT_75;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPERAND0:8;
      uint64_t NUM_PADS0:2;
      uint64_t OPCODE0:6;
      uint64_t OPERAND1:8;
      uint64_t NUM_PADS1:2;
      uint64_t OPCODE1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT_76;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPERAND0:8;
      uint64_t NUM_PADS0:2;
      uint64_t OPCODE0:6;
      uint64_t OPERAND1:8;
      uint64_t NUM_PADS1:2;
      uint64_t OPCODE1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT_77;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPERAND0:8;
      uint64_t NUM_PADS0:2;
      uint64_t OPCODE0:6;
      uint64_t OPERAND1:8;
      uint64_t NUM_PADS1:2;
      uint64_t OPCODE1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT_78;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPERAND0:8;
      uint64_t NUM_PADS0:2;
      uint64_t OPCODE0:6;
      uint64_t OPERAND1:8;
      uint64_t NUM_PADS1:2;
      uint64_t OPCODE1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT_79;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPERAND0:8;
      uint64_t NUM_PADS0:2;
      uint64_t OPCODE0:6;
      uint64_t OPERAND1:8;
      uint64_t NUM_PADS1:2;
      uint64_t OPCODE1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT_80;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPERAND0:8;
      uint64_t NUM_PADS0:2;
      uint64_t OPCODE0:6;
      uint64_t OPERAND1:8;
      uint64_t NUM_PADS1:2;
      uint64_t OPCODE1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT_81;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPERAND0:8;
      uint64_t NUM_PADS0:2;
      uint64_t OPCODE0:6;
      uint64_t OPERAND1:8;
      uint64_t NUM_PADS1:2;
      uint64_t OPCODE1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT_82;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPERAND0:8;
      uint64_t NUM_PADS0:2;
      uint64_t OPCODE0:6;
      uint64_t OPERAND1:8;
      uint64_t NUM_PADS1:2;
      uint64_t OPCODE1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT_83;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPERAND0:8;
      uint64_t NUM_PADS0:2;
      uint64_t OPCODE0:6;
      uint64_t OPERAND1:8;
      uint64_t NUM_PADS1:2;
      uint64_t OPCODE1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT_84;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPERAND0:8;
      uint64_t NUM_PADS0:2;
      uint64_t OPCODE0:6;
      uint64_t OPERAND1:8;
      uint64_t NUM_PADS1:2;
      uint64_t OPCODE1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT_85;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPERAND0:8;
      uint64_t NUM_PADS0:2;
      uint64_t OPCODE0:6;
      uint64_t OPERAND1:8;
      uint64_t NUM_PADS1:2;
      uint64_t OPCODE1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT_86;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPERAND0:8;
      uint64_t NUM_PADS0:2;
      uint64_t OPCODE0:6;
      uint64_t OPERAND1:8;
      uint64_t NUM_PADS1:2;
      uint64_t OPCODE1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT_87;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPERAND0:8;
      uint64_t NUM_PADS0:2;
      uint64_t OPCODE0:6;
      uint64_t OPERAND1:8;
      uint64_t NUM_PADS1:2;
      uint64_t OPCODE1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT_88;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPERAND0:8;
      uint64_t NUM_PADS0:2;
      uint64_t OPCODE0:6;
      uint64_t OPERAND1:8;
      uint64_t NUM_PADS1:2;
      uint64_t OPCODE1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT_89;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPERAND0:8;
      uint64_t NUM_PADS0:2;
      uint64_t OPCODE0:6;
      uint64_t OPERAND1:8;
      uint64_t NUM_PADS1:2;
      uint64_t OPCODE1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT_90;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPERAND0:8;
      uint64_t NUM_PADS0:2;
      uint64_t OPCODE0:6;
      uint64_t OPERAND1:8;
      uint64_t NUM_PADS1:2;
      uint64_t OPCODE1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT_91;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPERAND0:8;
      uint64_t NUM_PADS0:2;
      uint64_t OPCODE0:6;
      uint64_t OPERAND1:8;
      uint64_t NUM_PADS1:2;
      uint64_t OPCODE1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT_92;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPERAND0:8;
      uint64_t NUM_PADS0:2;
      uint64_t OPCODE0:6;
      uint64_t OPERAND1:8;
      uint64_t NUM_PADS1:2;
      uint64_t OPCODE1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT_93;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPERAND0:8;
      uint64_t NUM_PADS0:2;
      uint64_t OPCODE0:6;
      uint64_t OPERAND1:8;
      uint64_t NUM_PADS1:2;
      uint64_t OPCODE1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT_94;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPERAND0:8;
      uint64_t NUM_PADS0:2;
      uint64_t OPCODE0:6;
      uint64_t OPERAND1:8;
      uint64_t NUM_PADS1:2;
      uint64_t OPCODE1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT_95;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPERAND0:8;
      uint64_t NUM_PADS0:2;
      uint64_t OPCODE0:6;
      uint64_t OPERAND1:8;
      uint64_t NUM_PADS1:2;
      uint64_t OPCODE1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT_96;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPERAND0:8;
      uint64_t NUM_PADS0:2;
      uint64_t OPCODE0:6;
      uint64_t OPERAND1:8;
      uint64_t NUM_PADS1:2;
      uint64_t OPCODE1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT_97;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPERAND0:8;
      uint64_t NUM_PADS0:2;
      uint64_t OPCODE0:6;
      uint64_t OPERAND1:8;
      uint64_t NUM_PADS1:2;
      uint64_t OPCODE1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT_98;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPERAND0:8;
      uint64_t NUM_PADS0:2;
      uint64_t OPCODE0:6;
      uint64_t OPERAND1:8;
      uint64_t NUM_PADS1:2;
      uint64_t OPCODE1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT_99;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPERAND0:8;
      uint64_t NUM_PADS0:2;
      uint64_t OPCODE0:6;
      uint64_t OPERAND1:8;
      uint64_t NUM_PADS1:2;
      uint64_t OPCODE1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT_100;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPERAND0:8;
      uint64_t NUM_PADS0:2;
      uint64_t OPCODE0:6;
      uint64_t OPERAND1:8;
      uint64_t NUM_PADS1:2;
      uint64_t OPCODE1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT_101;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPERAND0:8;
      uint64_t NUM_PADS0:2;
      uint64_t OPCODE0:6;
      uint64_t OPERAND1:8;
      uint64_t NUM_PADS1:2;
      uint64_t OPCODE1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT_102;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPERAND0:8;
      uint64_t NUM_PADS0:2;
      uint64_t OPCODE0:6;
      uint64_t OPERAND1:8;
      uint64_t NUM_PADS1:2;
      uint64_t OPCODE1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT_103;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPERAND0:8;
      uint64_t NUM_PADS0:2;
      uint64_t OPCODE0:6;
      uint64_t OPERAND1:8;
      uint64_t NUM_PADS1:2;
      uint64_t OPCODE1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT_104;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPERAND0:8;
      uint64_t NUM_PADS0:2;
      uint64_t OPCODE0:6;
      uint64_t OPERAND1:8;
      uint64_t NUM_PADS1:2;
      uint64_t OPCODE1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT_105;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPERAND0:8;
      uint64_t NUM_PADS0:2;
      uint64_t OPCODE0:6;
      uint64_t OPERAND1:8;
      uint64_t NUM_PADS1:2;
      uint64_t OPCODE1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT_106;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPERAND0:8;
      uint64_t NUM_PADS0:2;
      uint64_t OPCODE0:6;
      uint64_t OPERAND1:8;
      uint64_t NUM_PADS1:2;
      uint64_t OPCODE1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT_107;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPERAND0:8;
      uint64_t NUM_PADS0:2;
      uint64_t OPCODE0:6;
      uint64_t OPERAND1:8;
      uint64_t NUM_PADS1:2;
      uint64_t OPCODE1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT_108;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPERAND0:8;
      uint64_t NUM_PADS0:2;
      uint64_t OPCODE0:6;
      uint64_t OPERAND1:8;
      uint64_t NUM_PADS1:2;
      uint64_t OPCODE1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT_109;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPERAND0:8;
      uint64_t NUM_PADS0:2;
      uint64_t OPCODE0:6;
      uint64_t OPERAND1:8;
      uint64_t NUM_PADS1:2;
      uint64_t OPCODE1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT_110;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPERAND0:8;
      uint64_t NUM_PADS0:2;
      uint64_t OPCODE0:6;
      uint64_t OPERAND1:8;
      uint64_t NUM_PADS1:2;
      uint64_t OPCODE1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT_111;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPERAND0:8;
      uint64_t NUM_PADS0:2;
      uint64_t OPCODE0:6;
      uint64_t OPERAND1:8;
      uint64_t NUM_PADS1:2;
      uint64_t OPCODE1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT_112;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPERAND0:8;
      uint64_t NUM_PADS0:2;
      uint64_t OPCODE0:6;
      uint64_t OPERAND1:8;
      uint64_t NUM_PADS1:2;
      uint64_t OPCODE1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT_113;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPERAND0:8;
      uint64_t NUM_PADS0:2;
      uint64_t OPCODE0:6;
      uint64_t OPERAND1:8;
      uint64_t NUM_PADS1:2;
      uint64_t OPCODE1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT_114;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPERAND0:8;
      uint64_t NUM_PADS0:2;
      uint64_t OPCODE0:6;
      uint64_t OPERAND1:8;
      uint64_t NUM_PADS1:2;
      uint64_t OPCODE1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT_115;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPERAND0:8;
      uint64_t NUM_PADS0:2;
      uint64_t OPCODE0:6;
      uint64_t OPERAND1:8;
      uint64_t NUM_PADS1:2;
      uint64_t OPCODE1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT_116;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPERAND0:8;
      uint64_t NUM_PADS0:2;
      uint64_t OPCODE0:6;
      uint64_t OPERAND1:8;
      uint64_t NUM_PADS1:2;
      uint64_t OPCODE1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT_117;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPERAND0:8;
      uint64_t NUM_PADS0:2;
      uint64_t OPCODE0:6;
      uint64_t OPERAND1:8;
      uint64_t NUM_PADS1:2;
      uint64_t OPCODE1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT_118;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPERAND0:8;
      uint64_t NUM_PADS0:2;
      uint64_t OPCODE0:6;
      uint64_t OPERAND1:8;
      uint64_t NUM_PADS1:2;
      uint64_t OPCODE1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT_119;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPERAND0:8;
      uint64_t NUM_PADS0:2;
      uint64_t OPCODE0:6;
      uint64_t OPERAND1:8;
      uint64_t NUM_PADS1:2;
      uint64_t OPCODE1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT_120;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPERAND0:8;
      uint64_t NUM_PADS0:2;
      uint64_t OPCODE0:6;
      uint64_t OPERAND1:8;
      uint64_t NUM_PADS1:2;
      uint64_t OPCODE1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT_121;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPERAND0:8;
      uint64_t NUM_PADS0:2;
      uint64_t OPCODE0:6;
      uint64_t OPERAND1:8;
      uint64_t NUM_PADS1:2;
      uint64_t OPCODE1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT_122;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPERAND0:8;
      uint64_t NUM_PADS0:2;
      uint64_t OPCODE0:6;
      uint64_t OPERAND1:8;
      uint64_t NUM_PADS1:2;
      uint64_t OPCODE1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT_123;

