iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/IMXRT685_RAM_GCC/targetInit/iMXRT685_sfr.h
  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPERAND0:8;
      uint64_t NUM_PADS0:2;
      uint64_t OPCODE0:6;
      uint64_t OPERAND1:8;
      uint64_t NUM_PADS1:2;
      uint64_t OPCODE1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT_124;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPERAND0:8;
      uint64_t NUM_PADS0:2;
      uint64_t OPCODE0:6;
      uint64_t OPERAND1:8;
      uint64_t NUM_PADS1:2;
      uint64_t OPCODE1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT_125;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPERAND0:8;
      uint64_t NUM_PADS0:2;
      uint64_t OPCODE0:6;
      uint64_t OPERAND1:8;
      uint64_t NUM_PADS1:2;
      uint64_t OPCODE1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT_126;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPERAND0:8;
      uint64_t NUM_PADS0:2;
      uint64_t OPCODE0:6;
      uint64_t OPERAND1:8;
      uint64_t NUM_PADS1:2;
      uint64_t OPCODE1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT_127;

};

#define FLEXSPI (*(volatile struct FLEXSPI_tag *) 0x40134000)

struct OTFAD_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t FLDM:1;
      uint64_t reservedSpace1:3;
      uint64_t RRAE:1;
      uint64_t reservedSpace2:23;
      uint64_t GE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t MDPCP:1;
      uint64_t MODE:2;
      uint64_t NCTX:4;
      uint64_t reservedSpace1:16;
      uint64_t HRL:4;
      uint64_t RRAM:1;
      uint64_t GEM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SR;

};

#define OTFAD (*(volatile struct OTFAD_tag *) 0x40134c00)

struct OTFAD_CTX_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t KEY:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTX_KEY0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t KEY:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTX_KEY1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t KEY:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTX_KEY2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t KEY:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTX_KEY3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CTR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTX_CTR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CTR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTX_CTR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:10;
      uint64_t SRTADDR:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTX_RGD_W0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VLD:1;
      uint64_t ADE:1;
      uint64_t RO:1;
      uint64_t reservedSpace0:7;
      uint64_t ENDADDR:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTX_RGD_W1;

};

#define OTFAD_CTX_0 (*(volatile struct OTFAD_CTX_0_tag *) 0x40134d00)

struct OTFAD_CTX_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t KEY:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTX_KEY0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t KEY:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTX_KEY1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t KEY:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTX_KEY2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t KEY:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTX_KEY3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CTR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTX_CTR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CTR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTX_CTR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:10;
      uint64_t SRTADDR:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTX_RGD_W0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VLD:1;
      uint64_t ADE:1;
      uint64_t RO:1;
      uint64_t reservedSpace0:7;
      uint64_t ENDADDR:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTX_RGD_W1;

};

#define OTFAD_CTX_1 (*(volatile struct OTFAD_CTX_1_tag *) 0x40134d40)

struct OTFAD_CTX_2_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t KEY:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTX_KEY0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t KEY:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTX_KEY1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t KEY:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTX_KEY2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t KEY:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTX_KEY3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CTR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTX_CTR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CTR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTX_CTR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:10;
      uint64_t SRTADDR:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTX_RGD_W0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VLD:1;
      uint64_t ADE:1;
      uint64_t RO:1;
      uint64_t reservedSpace0:7;
      uint64_t ENDADDR:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTX_RGD_W1;

};

#define OTFAD_CTX_2 (*(volatile struct OTFAD_CTX_2_tag *) 0x40134d80)

