iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/IMXRT685_RAM_GCC/targetInit/iMXRT685_sfr.h
  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEVTAC12NE:1;
      uint64_t FEVTAC12TOE:1;
      uint64_t FEVTAC12CE:1;
      uint64_t FEVTAC12EBE:1;
      uint64_t FEVTAC12IE:1;
      uint64_t reservedSpace0:2;
      uint64_t FEVTCNIBAC12E:1;
      uint64_t reservedSpace1:8;
      uint64_t FEVTCTOE:1;
      uint64_t FEVTCCE:1;
      uint64_t FEVTCEBE:1;
      uint64_t FEVTCIE:1;
      uint64_t FEVTDTOE:1;
      uint64_t FEVTDCE:1;
      uint64_t FEVTDEBE:1;
      uint64_t reservedSpace2:1;
      uint64_t FEVTAC12E:1;
      uint64_t reservedSpace3:1;
      uint64_t FEVTTNE:1;
      uint64_t reservedSpace4:1;
      uint64_t FEVTDMAE:1;
      uint64_t reservedSpace5:2;
      uint64_t FEVTCINT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FORCE_EVENT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADMAES:2;
      uint64_t ADMALME:1;
      uint64_t ADMADCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADMA_ERR_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t ADS_ADDR:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADMA_SYS_ADDR;

  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DLL_CTRL_ENABLE:1;
      uint64_t DLL_CTRL_RESET:1;
      uint64_t DLL_CTRL_SLV_FORCE_UPD:1;
      uint64_t DLL_CTRL_SLV_DLY_TARGET0:4;
      uint64_t DLL_CTRL_GATE_UPDATE:1;
      uint64_t DLL_CTRL_SLV_OVERRIDE:1;
      uint64_t DLL_CTRL_SLV_OVERRIDE_VAL:7;
      uint64_t DLL_CTRL_SLV_DLY_TARGET1:3;
      uint64_t reservedSpace0:1;
      uint64_t DLL_CTRL_SLV_UPDATE_INT:8;
      uint64_t DLL_CTRL_REF_UPDATE_INT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DLL_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DLL_STS_SLV_LOCK:1;
      uint64_t DLL_STS_REF_LOCK:1;
      uint64_t DLL_STS_SLV_SEL:7;
      uint64_t DLL_STS_REF_SEL:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DLL_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DLY_CELL_SET_POST:4;
      uint64_t DLY_CELL_SET_OUT:4;
      uint64_t DLY_CELL_SET_PRE:7;
      uint64_t NXT_ERR:1;
      uint64_t TAP_SEL_POST:4;
      uint64_t TAP_SEL_OUT:4;
      uint64_t TAP_SEL_PRE:7;
      uint64_t PRE_ERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_TUNE_CTRL_STATUS;

  uint8_t res2[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STROBE_DLL_CTRL_ENABLE:1;
      uint64_t STROBE_DLL_CTRL_RESET:1;
      uint64_t STROBE_DLL_CTRL_SLV_FORCE_UPD:1;
      uint64_t STROBE_DLL_CTRL_SLV_DLY_TARGET:3;
      uint64_t STROBE_DLL_CTRL_GATE_UPDATE_0:1;
      uint64_t STROBE_DLL_CTRL_GATE_UPDATE_1:1;
      uint64_t STROBE_DLL_CTRL_SLV_OVERRIDE:1;
      uint64_t STROBE_DLL_CTRL_SLV_OVERRIDE_VAL:7;
      uint64_t reservedSpace0:4;
      uint64_t STROBE_DLL_CTRL_SLV_UPDATE_INT:8;
      uint64_t STROBE_DLL_CTRL_REF_UPDATE_INT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STROBE_DLL_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STROBE_DLL_STS_SLV_LOCK:1;
      uint64_t STROBE_DLL_STS_REF_LOCK:1;
      uint64_t STROBE_DLL_STS_SLV_SEL:7;
      uint64_t STROBE_DLL_STS_REF_SEL:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STROBE_DLL_STATUS;

  uint8_t res3[72];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t VSELECT:1;
      uint64_t reservedSpace1:1;
      uint64_t AC12_WR_CHKBUSY_EN:1;
      uint64_t reservedSpace2:4;
      uint64_t FRC_SDCLK_ON:1;
      uint64_t reservedSpace3:6;
      uint64_t CRC_CHK_DIS:1;
      uint64_t reservedSpace4:15;
      uint64_t CMD_BYTE_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) VEND_SPEC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DTOCV_ACK:4;
      uint64_t BOOT_ACK:1;
      uint64_t BOOT_MODE:1;
      uint64_t BOOT_EN:1;
      uint64_t AUTO_SABG_EN:1;
      uint64_t DISABLE_TIME_OUT:1;
      uint64_t reservedSpace0:7;
      uint64_t BOOT_BLK_CNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MMC_BOOT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t CARD_INT_D3_TEST:1;
      uint64_t TUNING_8bit_EN:1;
      uint64_t TUNING_1bit_EN:1;
      uint64_t TUNING_CMD_EN:1;
      uint64_t reservedSpace1:3;
      uint64_t HS400_WR_CLK_STOP_EN:1;
      uint64_t HS400_RD_CLK_STOP_EN:1;
      uint64_t ACMD23_ARGU2_EN:1;
      uint64_t reservedSpace2:1;
      uint64_t AHB_RST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) VEND_SPEC2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TUNING_START_TAP:8;
      uint64_t TUNING_COUNTER:8;
      uint64_t TUNING_STEP:3;
      uint64_t reservedSpace0:1;
      uint64_t TUNING_WINDOW:3;
      uint64_t reservedSpace1:1;
      uint64_t STD_TUNING_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TUNING_CTRL;

};

#define USDHC0 (*(volatile struct USDHC0_tag *) 0x40136000)

struct USDHC1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t DS_ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DS_ADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BLKSIZE:13;
      uint64_t reservedSpace0:3;
      uint64_t BLKCNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BLK_ATT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMDARG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMD_ARG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t RSPTYP:2;
      uint64_t reservedSpace1:1;
      uint64_t CCCEN:1;
      uint64_t CICEN:1;
      uint64_t DPSEL:1;
      uint64_t CMDTYP:2;
      uint64_t CMDINX:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMD_XFR_TYP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMDRSP0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMD_RSP0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMDRSP1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMD_RSP1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMDRSP2:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMD_RSP2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMDRSP3:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMD_RSP3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATCONT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATA_BUFF_ACC_PORT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CIHB:1;
      uint64_t CDIHB:1;
      uint64_t DLA:1;
      uint64_t SDSTB:1;
      uint64_t IPGOFF:1;
      uint64_t HCKOFF:1;
      uint64_t PEROFF:1;
      uint64_t SDOFF:1;
      uint64_t WTA:1;
      uint64_t RTA:1;
      uint64_t BWEN:1;
      uint64_t BREN:1;
      uint64_t RTR:1;
      uint64_t reservedSpace0:2;
      uint64_t TSCD:1;
      uint64_t CINST:1;
      uint64_t reservedSpace1:1;
      uint64_t CDPL:1;
      uint64_t WPSPL:1;
      uint64_t reservedSpace2:3;
      uint64_t CLSL:1;
      uint64_t DLSL:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRES_STATE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t DTW:2;
      uint64_t D3CD:1;
      uint64_t EMODE:2;
      uint64_t CDTL:1;
      uint64_t CDSS:1;
      uint64_t DMASEL:2;
      uint64_t reservedSpace1:6;
      uint64_t SABGREQ:1;
      uint64_t CREQ:1;
      uint64_t RWCTL:1;
      uint64_t IABG:1;
      uint64_t RD_DONE_NO_8CLK:1;
      uint64_t RD_WAIT_POINT:3;
      uint64_t WECINT:1;
      uint64_t WECINS:1;
      uint64_t WECRM:1;
      uint64_t BURST_LEN_EN:3;
      uint64_t NON_EXACT_BLK_RD:1;
      uint64_t RD_NO8CLK_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PROT_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t DVS:4;
      uint64_t SDCLKFS:8;
      uint64_t DTOCV:4;
      uint64_t reservedSpace1:3;
      uint64_t IPP_RST_N:1;
      uint64_t RSTA:1;
      uint64_t RSTC:1;
      uint64_t RSTD:1;
      uint64_t INITA:1;
      uint64_t RSTT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYS_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CC:1;
      uint64_t TC:1;
      uint64_t BGE:1;
      uint64_t DINT:1;
      uint64_t BWR:1;
      uint64_t BRR:1;
      uint64_t CINS:1;
      uint64_t CRM:1;
      uint64_t CINT:1;
      uint64_t reservedSpace0:3;
      uint64_t RTE:1;
      uint64_t reservedSpace1:1;
      uint64_t TP:1;
      uint64_t reservedSpace2:1;
      uint64_t CTOE:1;
      uint64_t CCE:1;
      uint64_t CEBE:1;
      uint64_t CIE:1;
      uint64_t DTOE:1;
      uint64_t DCE:1;
      uint64_t DEBE:1;
      uint64_t reservedSpace3:1;
      uint64_t AC12E:1;
      uint64_t reservedSpace4:1;
      uint64_t TNE:1;
      uint64_t reservedSpace5:1;
      uint64_t DMAE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INT_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CCSEN:1;
      uint64_t TCSEN:1;
      uint64_t BGESEN:1;
      uint64_t DINTSEN:1;
      uint64_t BWRSEN:1;
      uint64_t BRRSEN:1;
      uint64_t CINSSEN:1;
      uint64_t CRMSEN:1;
      uint64_t CINTSEN:1;
      uint64_t reservedSpace0:3;
      uint64_t RTESEN:1;
      uint64_t reservedSpace1:1;
      uint64_t TPSEN:1;
      uint64_t reservedSpace2:1;
      uint64_t CTOESEN:1;
      uint64_t CCESEN:1;
      uint64_t CEBESEN:1;
      uint64_t CIESEN:1;
      uint64_t DTOESEN:1;
      uint64_t DCESEN:1;
      uint64_t DEBESEN:1;
      uint64_t reservedSpace3:1;
      uint64_t AC12ESEN:1;
      uint64_t reservedSpace4:1;
      uint64_t TNESEN:1;
      uint64_t reservedSpace5:1;
      uint64_t DMAESEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INT_STATUS_EN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CCIEN:1;
      uint64_t TCIEN:1;
      uint64_t BGEIEN:1;
      uint64_t DINTIEN:1;
      uint64_t BWRIEN:1;
      uint64_t BRRIEN:1;
      uint64_t CINSIEN:1;
      uint64_t CRMIEN:1;
      uint64_t CINTIEN:1;
      uint64_t reservedSpace0:3;
      uint64_t RTEIEN:1;
      uint64_t reservedSpace1:1;
      uint64_t TPIEN:1;
      uint64_t reservedSpace2:1;
      uint64_t CTOEIEN:1;
      uint64_t CCEIEN:1;
      uint64_t CEBEIEN:1;
      uint64_t CIEIEN:1;
      uint64_t DTOEIEN:1;
      uint64_t DCEIEN:1;
      uint64_t DEBEIEN:1;
      uint64_t reservedSpace3:1;
      uint64_t AC12EIEN:1;
      uint64_t reservedSpace4:1;
      uint64_t TNEIEN:1;
      uint64_t reservedSpace5:1;
      uint64_t DMAEIEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INT_SIGNAL_EN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AC12NE:1;
      uint64_t AC12TOE:1;
      uint64_t AC12EBE:1;
      uint64_t AC12CE:1;
      uint64_t AC12IE:1;
      uint64_t reservedSpace0:2;
      uint64_t CNIBAC12E:1;
      uint64_t reservedSpace1:14;
      uint64_t EXECUTE_TUNING:1;
      uint64_t SMP_CLK_SEL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AUTOCMD12_ERR_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SDR50_SUPPORT:1;
      uint64_t SDR104_SUPPORT:1;
      uint64_t DDR50_SUPPORT:1;
      uint64_t reservedSpace0:5;
      uint64_t TIME_COUNT_RETUNING:4;
      uint64_t reservedSpace1:1;
      uint64_t USE_TUNING_SDR50:1;
      uint64_t RETUNING_MODE:2;
      uint64_t MBL:3;
      uint64_t reservedSpace2:1;
      uint64_t ADMAS:1;
      uint64_t HSS:1;
      uint64_t DMAS:1;
      uint64_t SRS:1;
      uint64_t VS33:1;
      uint64_t VS30:1;
      uint64_t VS18:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HOST_CTRL_CAP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RD_WML:8;
      uint64_t RD_BRST_LEN:5;
      uint64_t reservedSpace0:3;
      uint64_t WR_WML:8;
      uint64_t WR_BRST_LEN:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WTMK_LVL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMAEN:1;
      uint64_t BCEN:1;
      uint64_t AC12EN:1;
      uint64_t DDR_EN:1;
      uint64_t DTDSEL:1;
      uint64_t MSBSEL:1;
      uint64_t NIBBLE_POS:1;
      uint64_t AC23EN:1;
      uint64_t reservedSpace0:14;
      uint64_t EXE_TUNE:1;
      uint64_t SMP_CLK_SEL:1;
      uint64_t AUTO_TUNE_EN:1;
      uint64_t FBCLK_SEL:1;
      uint64_t HS400_MODE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MIX_CTRL;

