iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/IMXRT685_RAM_GCC/targetInit/iMXRT685_sfr.h
  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEVTAC12NE:1;
      uint64_t FEVTAC12TOE:1;
      uint64_t FEVTAC12CE:1;
      uint64_t FEVTAC12EBE:1;
      uint64_t FEVTAC12IE:1;
      uint64_t reservedSpace0:2;
      uint64_t FEVTCNIBAC12E:1;
      uint64_t reservedSpace1:8;
      uint64_t FEVTCTOE:1;
      uint64_t FEVTCCE:1;
      uint64_t FEVTCEBE:1;
      uint64_t FEVTCIE:1;
      uint64_t FEVTDTOE:1;
      uint64_t FEVTDCE:1;
      uint64_t FEVTDEBE:1;
      uint64_t reservedSpace2:1;
      uint64_t FEVTAC12E:1;
      uint64_t reservedSpace3:1;
      uint64_t FEVTTNE:1;
      uint64_t reservedSpace4:1;
      uint64_t FEVTDMAE:1;
      uint64_t reservedSpace5:2;
      uint64_t FEVTCINT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FORCE_EVENT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADMAES:2;
      uint64_t ADMALME:1;
      uint64_t ADMADCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADMA_ERR_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t ADS_ADDR:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADMA_SYS_ADDR;

  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DLL_CTRL_ENABLE:1;
      uint64_t DLL_CTRL_RESET:1;
      uint64_t DLL_CTRL_SLV_FORCE_UPD:1;
      uint64_t DLL_CTRL_SLV_DLY_TARGET0:4;
      uint64_t DLL_CTRL_GATE_UPDATE:1;
      uint64_t DLL_CTRL_SLV_OVERRIDE:1;
      uint64_t DLL_CTRL_SLV_OVERRIDE_VAL:7;
      uint64_t DLL_CTRL_SLV_DLY_TARGET1:3;
      uint64_t reservedSpace0:1;
      uint64_t DLL_CTRL_SLV_UPDATE_INT:8;
      uint64_t DLL_CTRL_REF_UPDATE_INT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DLL_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DLL_STS_SLV_LOCK:1;
      uint64_t DLL_STS_REF_LOCK:1;
      uint64_t DLL_STS_SLV_SEL:7;
      uint64_t DLL_STS_REF_SEL:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DLL_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DLY_CELL_SET_POST:4;
      uint64_t DLY_CELL_SET_OUT:4;
      uint64_t DLY_CELL_SET_PRE:7;
      uint64_t NXT_ERR:1;
      uint64_t TAP_SEL_POST:4;
      uint64_t TAP_SEL_OUT:4;
      uint64_t TAP_SEL_PRE:7;
      uint64_t PRE_ERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_TUNE_CTRL_STATUS;

  uint8_t res2[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STROBE_DLL_CTRL_ENABLE:1;
      uint64_t STROBE_DLL_CTRL_RESET:1;
      uint64_t STROBE_DLL_CTRL_SLV_FORCE_UPD:1;
      uint64_t STROBE_DLL_CTRL_SLV_DLY_TARGET:3;
      uint64_t STROBE_DLL_CTRL_GATE_UPDATE_0:1;
      uint64_t STROBE_DLL_CTRL_GATE_UPDATE_1:1;
      uint64_t STROBE_DLL_CTRL_SLV_OVERRIDE:1;
      uint64_t STROBE_DLL_CTRL_SLV_OVERRIDE_VAL:7;
      uint64_t reservedSpace0:4;
      uint64_t STROBE_DLL_CTRL_SLV_UPDATE_INT:8;
      uint64_t STROBE_DLL_CTRL_REF_UPDATE_INT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STROBE_DLL_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STROBE_DLL_STS_SLV_LOCK:1;
      uint64_t STROBE_DLL_STS_REF_LOCK:1;
      uint64_t STROBE_DLL_STS_SLV_SEL:7;
      uint64_t STROBE_DLL_STS_REF_SEL:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STROBE_DLL_STATUS;

  uint8_t res3[72];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t VSELECT:1;
      uint64_t reservedSpace1:1;
      uint64_t AC12_WR_CHKBUSY_EN:1;
      uint64_t reservedSpace2:4;
      uint64_t FRC_SDCLK_ON:1;
      uint64_t reservedSpace3:6;
      uint64_t CRC_CHK_DIS:1;
      uint64_t reservedSpace4:15;
      uint64_t CMD_BYTE_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) VEND_SPEC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DTOCV_ACK:4;
      uint64_t BOOT_ACK:1;
      uint64_t BOOT_MODE:1;
      uint64_t BOOT_EN:1;
      uint64_t AUTO_SABG_EN:1;
      uint64_t DISABLE_TIME_OUT:1;
      uint64_t reservedSpace0:7;
      uint64_t BOOT_BLK_CNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MMC_BOOT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t CARD_INT_D3_TEST:1;
      uint64_t TUNING_8bit_EN:1;
      uint64_t TUNING_1bit_EN:1;
      uint64_t TUNING_CMD_EN:1;
      uint64_t reservedSpace1:3;
      uint64_t HS400_WR_CLK_STOP_EN:1;
      uint64_t HS400_RD_CLK_STOP_EN:1;
      uint64_t ACMD23_ARGU2_EN:1;
      uint64_t reservedSpace2:1;
      uint64_t AHB_RST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) VEND_SPEC2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TUNING_START_TAP:8;
      uint64_t TUNING_COUNTER:8;
      uint64_t TUNING_STEP:3;
      uint64_t reservedSpace0:1;
      uint64_t TUNING_WINDOW:3;
      uint64_t reservedSpace1:1;
      uint64_t STD_TUNING_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TUNING_CTRL;

};

#define USDHC1 (*(volatile struct USDHC1_tag *) 0x40137000)

struct CMP_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEATURE:16;
      uint64_t MINOR:8;
      uint64_t MAJOR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) VERID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARAM:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PARAM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HYSTCTR:2;
      uint64_t reservedSpace0:2;
      uint64_t FILTER_CNT:3;
      uint64_t reservedSpace1:1;
      uint64_t EN:1;
      uint64_t OPE:1;
      uint64_t COS:1;
      uint64_t INVT:1;
      uint64_t PMODE:1;
      uint64_t reservedSpace2:1;
      uint64_t WE:1;
      uint64_t SE:1;
      uint64_t FPR:8;
      uint64_t COUT:1;
      uint64_t CFF:1;
      uint64_t CFR:1;
      uint64_t IEF:1;
      uint64_t IER:1;
      uint64_t reservedSpace3:1;
      uint64_t DMAEN:1;
      uint64_t LINKEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VOSEL:8;
      uint64_t DMODE:1;
      uint64_t VRSEL:1;
      uint64_t DACEN:1;
      uint64_t reservedSpace0:5;
      uint64_t CHN0:1;
      uint64_t CHN1:1;
      uint64_t CHN2:1;
      uint64_t CHN3:1;
      uint64_t CHN4:1;
      uint64_t CHN5:1;
      uint64_t reservedSpace1:2;
      uint64_t MSEL:3;
      uint64_t reservedSpace2:1;
      uint64_t PSEL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ACOn:6;
      uint64_t reservedSpace0:2;
      uint64_t INITMOD:6;
      uint64_t NSAM:2;
      uint64_t CH0F:1;
      uint64_t CH1F:1;
      uint64_t CH2F:1;
      uint64_t CH3F:1;
      uint64_t CH4F:1;
      uint64_t CH5F:1;
      uint64_t reservedSpace1:3;
      uint64_t FXMXCH:3;
      uint64_t reservedSpace2:1;
      uint64_t FXMP:1;
      uint64_t RRIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t ACPH2TC:3;
      uint64_t reservedSpace1:1;
      uint64_t ACPH1TC:3;
      uint64_t reservedSpace2:1;
      uint64_t ACSAT:3;
      uint64_t reservedSpace3:1;
      uint64_t DMCS:1;
      uint64_t reservedSpace4:3;
      uint64_t RDIVE:1;
      uint64_t reservedSpace5:3;
      uint64_t NCHCTEN:1;
      uint64_t reservedSpace6:3;
      uint64_t PCHCTEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RR_TIMER_RELOAD:28;
      uint64_t reservedSpace0:3;
      uint64_t RR_TIMER_ENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RR_TIMER_CR;

