iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/IMXRT685_RAM_GCC/targetInit/iMXRT685_sfr.h
};

#define CMP (*(volatile struct CMP_tag *) 0x40139000)

struct ADC0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRIG_NUM:8;
      uint64_t FIFOSIZE:8;
      uint64_t CV_NUM:8;
      uint64_t CMD_NUM:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PARAM;

  uint8_t res0[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADCEN:1;
      uint64_t RST:1;
      uint64_t DOZEN:1;
      uint64_t reservedSpace0:5;
      uint64_t RSTFIFO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RDY:1;
      uint64_t FOF:1;
      uint64_t reservedSpace0:14;
      uint64_t TRGACT:4;
      uint64_t reservedSpace1:4;
      uint64_t CMDACT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FWMIE:1;
      uint64_t FOFIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FWMDE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TPRICTRL:1;
      uint64_t reservedSpace0:3;
      uint64_t PWRSEL:2;
      uint64_t REFSEL:2;
      uint64_t reservedSpace1:8;
      uint64_t PUDLY:8;
      uint64_t reservedSpace2:4;
      uint64_t PWREN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PAUSEDLY:9;
      uint64_t reservedSpace0:22;
      uint64_t PAUSEEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAUSE;

  uint8_t res1[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FCOUNT:5;
      uint64_t reservedSpace0:11;
      uint64_t FWMARK:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SWT0:1;
      uint64_t SWT1:1;
      uint64_t SWT2:1;
      uint64_t SWT3:1;
      uint64_t SWT4:1;
      uint64_t SWT5:1;
      uint64_t SWT6:1;
      uint64_t SWT7:1;
      uint64_t SWT8:1;
      uint64_t SWT9:1;
      uint64_t SWT10:1;
      uint64_t SWT11:1;
      uint64_t SWT12:1;
      uint64_t SWT13:1;
      uint64_t SWT14:1;
      uint64_t SWT15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SWTRIG;

  uint8_t res2[136];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HTEN:1;
      uint64_t reservedSpace0:7;
      uint64_t TPRI:4;
      uint64_t reservedSpace1:4;
      uint64_t TDLY:4;
      uint64_t reservedSpace2:4;
      uint64_t TCMD:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCTRL_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HTEN:1;
      uint64_t reservedSpace0:7;
      uint64_t TPRI:4;
      uint64_t reservedSpace1:4;
      uint64_t TDLY:4;
      uint64_t reservedSpace2:4;
      uint64_t TCMD:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCTRL_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HTEN:1;
      uint64_t reservedSpace0:7;
      uint64_t TPRI:4;
      uint64_t reservedSpace1:4;
      uint64_t TDLY:4;
      uint64_t reservedSpace2:4;
      uint64_t TCMD:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCTRL_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HTEN:1;
      uint64_t reservedSpace0:7;
      uint64_t TPRI:4;
      uint64_t reservedSpace1:4;
      uint64_t TDLY:4;
      uint64_t reservedSpace2:4;
      uint64_t TCMD:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCTRL_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HTEN:1;
      uint64_t reservedSpace0:7;
      uint64_t TPRI:4;
      uint64_t reservedSpace1:4;
      uint64_t TDLY:4;
      uint64_t reservedSpace2:4;
      uint64_t TCMD:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCTRL_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HTEN:1;
      uint64_t reservedSpace0:7;
      uint64_t TPRI:4;
      uint64_t reservedSpace1:4;
      uint64_t TDLY:4;
      uint64_t reservedSpace2:4;
      uint64_t TCMD:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCTRL_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HTEN:1;
      uint64_t reservedSpace0:7;
      uint64_t TPRI:4;
      uint64_t reservedSpace1:4;
      uint64_t TDLY:4;
      uint64_t reservedSpace2:4;
      uint64_t TCMD:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCTRL_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HTEN:1;
      uint64_t reservedSpace0:7;
      uint64_t TPRI:4;
      uint64_t reservedSpace1:4;
      uint64_t TDLY:4;
      uint64_t reservedSpace2:4;
      uint64_t TCMD:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCTRL_7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HTEN:1;
      uint64_t reservedSpace0:7;
      uint64_t TPRI:4;
      uint64_t reservedSpace1:4;
      uint64_t TDLY:4;
      uint64_t reservedSpace2:4;
      uint64_t TCMD:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCTRL_8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HTEN:1;
      uint64_t reservedSpace0:7;
      uint64_t TPRI:4;
      uint64_t reservedSpace1:4;
      uint64_t TDLY:4;
      uint64_t reservedSpace2:4;
      uint64_t TCMD:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCTRL_9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HTEN:1;
      uint64_t reservedSpace0:7;
      uint64_t TPRI:4;
      uint64_t reservedSpace1:4;
      uint64_t TDLY:4;
      uint64_t reservedSpace2:4;
      uint64_t TCMD:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCTRL_10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HTEN:1;
      uint64_t reservedSpace0:7;
      uint64_t TPRI:4;
      uint64_t reservedSpace1:4;
      uint64_t TDLY:4;
      uint64_t reservedSpace2:4;
      uint64_t TCMD:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCTRL_11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HTEN:1;
      uint64_t reservedSpace0:7;
      uint64_t TPRI:4;
      uint64_t reservedSpace1:4;
      uint64_t TDLY:4;
      uint64_t reservedSpace2:4;
      uint64_t TCMD:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCTRL_12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HTEN:1;
      uint64_t reservedSpace0:7;
      uint64_t TPRI:4;
      uint64_t reservedSpace1:4;
      uint64_t TDLY:4;
      uint64_t reservedSpace2:4;
      uint64_t TCMD:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCTRL_13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HTEN:1;
      uint64_t reservedSpace0:7;
      uint64_t TPRI:4;
      uint64_t reservedSpace1:4;
      uint64_t TDLY:4;
      uint64_t reservedSpace2:4;
      uint64_t TCMD:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCTRL_14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HTEN:1;
      uint64_t reservedSpace0:7;
      uint64_t TPRI:4;
      uint64_t reservedSpace1:4;
      uint64_t TDLY:4;
      uint64_t reservedSpace2:4;
      uint64_t TCMD:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCTRL_15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADCH:5;
      uint64_t ABSEL:1;
      uint64_t DIFF:1;
      uint64_t reservedSpace0:6;
      uint64_t CSCALE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMDL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMPEN:2;
      uint64_t reservedSpace0:5;
      uint64_t LWI:1;
      uint64_t STS:3;
      uint64_t reservedSpace1:1;
      uint64_t AVGS:3;
      uint64_t reservedSpace2:1;
      uint64_t LOOP:4;
      uint64_t reservedSpace3:4;
      uint64_t NEXT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMDH1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADCH:5;
      uint64_t ABSEL:1;
      uint64_t DIFF:1;
      uint64_t reservedSpace0:6;
      uint64_t CSCALE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMDL2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMPEN:2;
      uint64_t reservedSpace0:5;
      uint64_t LWI:1;
      uint64_t STS:3;
      uint64_t reservedSpace1:1;
      uint64_t AVGS:3;
      uint64_t reservedSpace2:1;
      uint64_t LOOP:4;
      uint64_t reservedSpace3:4;
      uint64_t NEXT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMDH2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADCH:5;
      uint64_t ABSEL:1;
      uint64_t DIFF:1;
      uint64_t reservedSpace0:6;
      uint64_t CSCALE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMDL3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMPEN:2;
      uint64_t reservedSpace0:5;
      uint64_t LWI:1;
      uint64_t STS:3;
      uint64_t reservedSpace1:1;
      uint64_t AVGS:3;
      uint64_t reservedSpace2:1;
      uint64_t LOOP:4;
      uint64_t reservedSpace3:4;
      uint64_t NEXT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMDH3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADCH:5;
      uint64_t ABSEL:1;
      uint64_t DIFF:1;
      uint64_t reservedSpace0:6;
      uint64_t CSCALE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMDL4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMPEN:2;
      uint64_t reservedSpace0:5;
      uint64_t LWI:1;
      uint64_t STS:3;
      uint64_t reservedSpace1:1;
      uint64_t AVGS:3;
      uint64_t reservedSpace2:1;
      uint64_t LOOP:4;
      uint64_t reservedSpace3:4;
      uint64_t NEXT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMDH4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADCH:5;
      uint64_t ABSEL:1;
      uint64_t DIFF:1;
      uint64_t reservedSpace0:6;
      uint64_t CSCALE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMDL5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:7;
      uint64_t LWI:1;
      uint64_t STS:3;
      uint64_t reservedSpace1:1;
      uint64_t AVGS:3;
      uint64_t reservedSpace2:1;
      uint64_t LOOP:4;
      uint64_t reservedSpace3:4;
      uint64_t NEXT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMDH5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADCH:5;
      uint64_t ABSEL:1;
      uint64_t DIFF:1;
      uint64_t reservedSpace0:6;
      uint64_t CSCALE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMDL6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:7;
      uint64_t LWI:1;
      uint64_t STS:3;
      uint64_t reservedSpace1:1;
      uint64_t AVGS:3;
      uint64_t reservedSpace2:1;
      uint64_t LOOP:4;
      uint64_t reservedSpace3:4;
      uint64_t NEXT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMDH6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADCH:5;
      uint64_t ABSEL:1;
      uint64_t DIFF:1;
      uint64_t reservedSpace0:6;
      uint64_t CSCALE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMDL7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:7;
      uint64_t LWI:1;
      uint64_t STS:3;
      uint64_t reservedSpace1:1;
      uint64_t AVGS:3;
      uint64_t reservedSpace2:1;
      uint64_t LOOP:4;
      uint64_t reservedSpace3:4;
      uint64_t NEXT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMDH7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADCH:5;
      uint64_t ABSEL:1;
      uint64_t DIFF:1;
      uint64_t reservedSpace0:6;
      uint64_t CSCALE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMDL8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:7;
      uint64_t LWI:1;
      uint64_t STS:3;
      uint64_t reservedSpace1:1;
      uint64_t AVGS:3;
      uint64_t reservedSpace2:1;
      uint64_t LOOP:4;
      uint64_t reservedSpace3:4;
      uint64_t NEXT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMDH8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADCH:5;
      uint64_t ABSEL:1;
      uint64_t DIFF:1;
      uint64_t reservedSpace0:6;
      uint64_t CSCALE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMDL9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:7;
      uint64_t LWI:1;
      uint64_t STS:3;
      uint64_t reservedSpace1:1;
      uint64_t AVGS:3;
      uint64_t reservedSpace2:1;
      uint64_t LOOP:4;
      uint64_t reservedSpace3:4;
      uint64_t NEXT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMDH9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADCH:5;
      uint64_t ABSEL:1;
      uint64_t DIFF:1;
      uint64_t reservedSpace0:6;
      uint64_t CSCALE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMDL10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:7;
      uint64_t LWI:1;
      uint64_t STS:3;
      uint64_t reservedSpace1:1;
      uint64_t AVGS:3;
      uint64_t reservedSpace2:1;
      uint64_t LOOP:4;
      uint64_t reservedSpace3:4;
      uint64_t NEXT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMDH10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADCH:5;
      uint64_t ABSEL:1;
      uint64_t DIFF:1;
      uint64_t reservedSpace0:6;
      uint64_t CSCALE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMDL11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:7;
      uint64_t LWI:1;
      uint64_t STS:3;
      uint64_t reservedSpace1:1;
      uint64_t AVGS:3;
      uint64_t reservedSpace2:1;
      uint64_t LOOP:4;
      uint64_t reservedSpace3:4;
      uint64_t NEXT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMDH11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADCH:5;
      uint64_t ABSEL:1;
      uint64_t DIFF:1;
      uint64_t reservedSpace0:6;
      uint64_t CSCALE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMDL12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:7;
      uint64_t LWI:1;
      uint64_t STS:3;
      uint64_t reservedSpace1:1;
      uint64_t AVGS:3;
      uint64_t reservedSpace2:1;
      uint64_t LOOP:4;
      uint64_t reservedSpace3:4;
      uint64_t NEXT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMDH12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADCH:5;
      uint64_t ABSEL:1;
      uint64_t DIFF:1;
      uint64_t reservedSpace0:6;
      uint64_t CSCALE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMDL13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:7;
      uint64_t LWI:1;
      uint64_t STS:3;
      uint64_t reservedSpace1:1;
      uint64_t AVGS:3;
      uint64_t reservedSpace2:1;
      uint64_t LOOP:4;
      uint64_t reservedSpace3:4;
      uint64_t NEXT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMDH13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADCH:5;
      uint64_t ABSEL:1;
      uint64_t DIFF:1;
      uint64_t reservedSpace0:6;
      uint64_t CSCALE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMDL14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:7;
      uint64_t LWI:1;
      uint64_t STS:3;
      uint64_t reservedSpace1:1;
      uint64_t AVGS:3;
      uint64_t reservedSpace2:1;
      uint64_t LOOP:4;
      uint64_t reservedSpace3:4;
      uint64_t NEXT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMDH14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADCH:5;
      uint64_t ABSEL:1;
      uint64_t DIFF:1;
      uint64_t reservedSpace0:6;
      uint64_t CSCALE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMDL15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:7;
      uint64_t LWI:1;
      uint64_t STS:3;
      uint64_t reservedSpace1:1;
      uint64_t AVGS:3;
      uint64_t reservedSpace2:1;
      uint64_t LOOP:4;
      uint64_t reservedSpace3:4;
      uint64_t NEXT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMDH15;

