iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/IMXRT685_RAM_GCC/targetInit/iMXRT685_sfr.h
  uint8_t res3[136];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CVL:16;
      uint64_t CVH:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CV1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CVL:16;
      uint64_t CVH:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CV2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CVL:16;
      uint64_t CVH:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CV3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CVL:16;
      uint64_t CVH:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CV4;

  uint8_t res4[240];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D:16;
      uint64_t TSRC:4;
      uint64_t LOOPCNT:4;
      uint64_t CMDSRC:4;
      uint64_t reservedSpace0:3;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RESFIFO;

};

#define ADC0 (*(volatile struct ADC0_tag *) 0x4013a004)

struct USBPHY_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:10;
      uint64_t TXPWDFS:1;
      uint64_t TXPWDIBIAS:1;
      uint64_t TXPWDV2I:1;
      uint64_t reservedSpace1:4;
      uint64_t RXPWDENV:1;
      uint64_t RXPWD1PT1:1;
      uint64_t RXPWDDIFF:1;
      uint64_t RXPWDRX:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:10;
      uint64_t TXPWDFS:1;
      uint64_t TXPWDIBIAS:1;
      uint64_t TXPWDV2I:1;
      uint64_t reservedSpace1:4;
      uint64_t RXPWDENV:1;
      uint64_t RXPWD1PT1:1;
      uint64_t RXPWDDIFF:1;
      uint64_t RXPWDRX:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWD_SET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:10;
      uint64_t TXPWDFS:1;
      uint64_t TXPWDIBIAS:1;
      uint64_t TXPWDV2I:1;
      uint64_t reservedSpace1:4;
      uint64_t RXPWDENV:1;
      uint64_t RXPWD1PT1:1;
      uint64_t RXPWDDIFF:1;
      uint64_t RXPWDRX:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWD_CLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:10;
      uint64_t TXPWDFS:1;
      uint64_t TXPWDIBIAS:1;
      uint64_t TXPWDV2I:1;
      uint64_t reservedSpace1:4;
      uint64_t RXPWDENV:1;
      uint64_t RXPWD1PT1:1;
      uint64_t RXPWDDIFF:1;
      uint64_t RXPWDRX:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWD_TOG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D_CAL:4;
      uint64_t reservedSpace0:4;
      uint64_t TXCAL45DM:4;
      uint64_t reservedSpace1:1;
      uint64_t TXENCAL45DN:1;
      uint64_t reservedSpace2:2;
      uint64_t TXCAL45DP:4;
      uint64_t reservedSpace3:1;
      uint64_t TXENCAL45DP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TX;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D_CAL:4;
      uint64_t reservedSpace0:4;
      uint64_t TXCAL45DM:4;
      uint64_t reservedSpace1:1;
      uint64_t TXENCAL45DN:1;
      uint64_t reservedSpace2:2;
      uint64_t TXCAL45DP:4;
      uint64_t reservedSpace3:1;
      uint64_t TXENCAL45DP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TX_SET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D_CAL:4;
      uint64_t reservedSpace0:4;
      uint64_t TXCAL45DM:4;
      uint64_t reservedSpace1:1;
      uint64_t TXENCAL45DN:1;
      uint64_t reservedSpace2:2;
      uint64_t TXCAL45DP:4;
      uint64_t reservedSpace3:1;
      uint64_t TXENCAL45DP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TX_CLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D_CAL:4;
      uint64_t reservedSpace0:4;
      uint64_t TXCAL45DM:4;
      uint64_t reservedSpace1:1;
      uint64_t TXENCAL45DN:1;
      uint64_t reservedSpace2:2;
      uint64_t TXCAL45DP:4;
      uint64_t reservedSpace3:1;
      uint64_t TXENCAL45DP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TX_TOG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENVADJ:3;
      uint64_t reservedSpace0:1;
      uint64_t DISCONADJ:3;
      uint64_t reservedSpace1:15;
      uint64_t RXDBYPASS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RX;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENVADJ:3;
      uint64_t reservedSpace0:1;
      uint64_t DISCONADJ:3;
      uint64_t reservedSpace1:15;
      uint64_t RXDBYPASS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RX_SET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENVADJ:3;
      uint64_t reservedSpace0:1;
      uint64_t DISCONADJ:3;
      uint64_t reservedSpace1:15;
      uint64_t RXDBYPASS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RX_CLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENVADJ:3;
      uint64_t reservedSpace0:1;
      uint64_t DISCONADJ:3;
      uint64_t reservedSpace1:15;
      uint64_t RXDBYPASS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RX_TOG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t ENHOSTDISCONDETECT:1;
      uint64_t reservedSpace1:1;
      uint64_t HOSTDISCONDETECT_IRQ:1;
      uint64_t ENDEVPLUGINDET:1;
      uint64_t reservedSpace2:7;
      uint64_t DEVPLUGIN_IRQ:1;
      uint64_t reservedSpace3:1;
      uint64_t ENUTMILEVEL2:1;
      uint64_t ENUTMILEVEL3:1;
      uint64_t reservedSpace4:2;
      uint64_t AUTORESUME_EN:1;
      uint64_t ENAUTOCLR_CLKGATE:1;
      uint64_t ENAUTOCLR_PHY_PWD:1;
      uint64_t reservedSpace5:3;
      uint64_t FSDLL_RST_EN:1;
      uint64_t reservedSpace6:3;
      uint64_t HOST_FORCE_LS_SE0:1;
      uint64_t UTMI_SUSPENDM:1;
      uint64_t CLKGATE:1;
      uint64_t SFTRST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t ENHOSTDISCONDETECT:1;
      uint64_t reservedSpace1:1;
      uint64_t HOSTDISCONDETECT_IRQ:1;
      uint64_t ENDEVPLUGINDET:1;
      uint64_t reservedSpace2:7;
      uint64_t DEVPLUGIN_IRQ:1;
      uint64_t reservedSpace3:1;
      uint64_t ENUTMILEVEL2:1;
      uint64_t ENUTMILEVEL3:1;
      uint64_t reservedSpace4:2;
      uint64_t AUTORESUME_EN:1;
      uint64_t ENAUTOCLR_CLKGATE:1;
      uint64_t ENAUTOCLR_PHY_PWD:1;
      uint64_t reservedSpace5:3;
      uint64_t FSDLL_RST_EN:1;
      uint64_t reservedSpace6:3;
      uint64_t HOST_FORCE_LS_SE0:1;
      uint64_t UTMI_SUSPENDM:1;
      uint64_t CLKGATE:1;
      uint64_t SFTRST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL_SET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t ENHOSTDISCONDETECT:1;
      uint64_t reservedSpace1:1;
      uint64_t HOSTDISCONDETECT_IRQ:1;
      uint64_t ENDEVPLUGINDET:1;
      uint64_t reservedSpace2:7;
      uint64_t DEVPLUGIN_IRQ:1;
      uint64_t reservedSpace3:1;
      uint64_t ENUTMILEVEL2:1;
      uint64_t ENUTMILEVEL3:1;
      uint64_t reservedSpace4:2;
      uint64_t AUTORESUME_EN:1;
      uint64_t ENAUTOCLR_CLKGATE:1;
      uint64_t ENAUTOCLR_PHY_PWD:1;
      uint64_t reservedSpace5:3;
      uint64_t FSDLL_RST_EN:1;
      uint64_t reservedSpace6:3;
      uint64_t HOST_FORCE_LS_SE0:1;
      uint64_t UTMI_SUSPENDM:1;
      uint64_t CLKGATE:1;
      uint64_t SFTRST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL_CLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t ENHOSTDISCONDETECT:1;
      uint64_t reservedSpace1:1;
      uint64_t HOSTDISCONDETECT_IRQ:1;
      uint64_t ENDEVPLUGINDET:1;
      uint64_t reservedSpace2:7;
      uint64_t DEVPLUGIN_IRQ:1;
      uint64_t reservedSpace3:1;
      uint64_t ENUTMILEVEL2:1;
      uint64_t ENUTMILEVEL3:1;
      uint64_t reservedSpace4:2;
      uint64_t AUTORESUME_EN:1;
      uint64_t ENAUTOCLR_CLKGATE:1;
      uint64_t ENAUTOCLR_PHY_PWD:1;
      uint64_t reservedSpace5:3;
      uint64_t FSDLL_RST_EN:1;
      uint64_t reservedSpace6:3;
      uint64_t HOST_FORCE_LS_SE0:1;
      uint64_t UTMI_SUSPENDM:1;
      uint64_t CLKGATE:1;
      uint64_t SFTRST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL_TOG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t HOSTDISCONDETECT_STATUS:1;
      uint64_t reservedSpace1:2;
      uint64_t DEVPLUGIN_STATUS:1;
      uint64_t reservedSpace2:3;
      uint64_t RESUME_STATUS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATUS;

  uint8_t res0[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t DEBUG_INTERFACE_HOLD:1;
      uint64_t HSTPULLDOWN:2;
      uint64_t ENHSTPULLDOWN:2;
      uint64_t reservedSpace1:2;
      uint64_t TX2RXCOUNT:4;
      uint64_t ENTX2RXCOUNT:1;
      uint64_t reservedSpace2:3;
      uint64_t SQUELCHRESETCOUNT:5;
      uint64_t reservedSpace3:3;
      uint64_t ENSQUELCHRESET:1;
      uint64_t SQUELCHRESETLENGTH:4;
      uint64_t HOST_RESUME_DEBUG:1;
      uint64_t CLKGATE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DEBUG0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t DEBUG_INTERFACE_HOLD:1;
      uint64_t HSTPULLDOWN:2;
      uint64_t ENHSTPULLDOWN:2;
      uint64_t reservedSpace1:2;
      uint64_t TX2RXCOUNT:4;
      uint64_t ENTX2RXCOUNT:1;
      uint64_t reservedSpace2:3;
      uint64_t SQUELCHRESETCOUNT:5;
      uint64_t reservedSpace3:3;
      uint64_t ENSQUELCHRESET:1;
      uint64_t SQUELCHRESETLENGTH:4;
      uint64_t HOST_RESUME_DEBUG:1;
      uint64_t CLKGATE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DEBUG0_SET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t DEBUG_INTERFACE_HOLD:1;
      uint64_t HSTPULLDOWN:2;
      uint64_t ENHSTPULLDOWN:2;
      uint64_t reservedSpace1:2;
      uint64_t TX2RXCOUNT:4;
      uint64_t ENTX2RXCOUNT:1;
      uint64_t reservedSpace2:3;
      uint64_t SQUELCHRESETCOUNT:5;
      uint64_t reservedSpace3:3;
      uint64_t ENSQUELCHRESET:1;
      uint64_t SQUELCHRESETLENGTH:4;
      uint64_t HOST_RESUME_DEBUG:1;
      uint64_t CLKGATE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DEBUG0_CLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t DEBUG_INTERFACE_HOLD:1;
      uint64_t HSTPULLDOWN:2;
      uint64_t ENHSTPULLDOWN:2;
      uint64_t reservedSpace1:2;
      uint64_t TX2RXCOUNT:4;
      uint64_t ENTX2RXCOUNT:1;
      uint64_t reservedSpace2:3;
      uint64_t SQUELCHRESETCOUNT:5;
      uint64_t reservedSpace3:3;
      uint64_t ENSQUELCHRESET:1;
      uint64_t SQUELCHRESETLENGTH:4;
      uint64_t HOST_RESUME_DEBUG:1;
      uint64_t CLKGATE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DEBUG0_TOG;

  uint8_t res1[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:13;
      uint64_t ENTAILADJVD:2;
      uint64_t reservedSpace1:3;
      uint64_t USB2_REFBIAS_VBGADJ:3;
      uint64_t USB2_REFBIAS_TST:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DEBUG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:13;
      uint64_t ENTAILADJVD:2;
      uint64_t reservedSpace1:3;
      uint64_t USB2_REFBIAS_VBGADJ:3;
      uint64_t USB2_REFBIAS_TST:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DEBUG1_SET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:13;
      uint64_t ENTAILADJVD:2;
      uint64_t reservedSpace1:3;
      uint64_t USB2_REFBIAS_VBGADJ:3;
      uint64_t USB2_REFBIAS_TST:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DEBUG1_CLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:13;
      uint64_t ENTAILADJVD:2;
      uint64_t reservedSpace1:3;
      uint64_t USB2_REFBIAS_VBGADJ:3;
      uint64_t USB2_REFBIAS_TST:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DEBUG1_TOG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STEP:16;
      uint64_t MINOR:8;
      uint64_t MAJOR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) VERSION;

