iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/IMXRT685_RAM_GCC/targetInit/iMXRT685_sfr.h
  uint8_t res2[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:6;
      uint64_t PLL_EN_USB_CLKS:1;
      uint64_t reservedSpace1:5;
      uint64_t PLL_POWER:1;
      uint64_t PLL_ENABLE:1;
      uint64_t reservedSpace2:2;
      uint64_t PLL_BYPASS:1;
      uint64_t reservedSpace3:2;
      uint64_t REFBIAS_PWD_SEL:1;
      uint64_t REFBIAS_PWD:1;
      uint64_t PLL_REG_ENABLE:1;
      uint64_t PLL_DIV_SEL:3;
      uint64_t reservedSpace4:6;
      uint64_t PLL_LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLL_SIC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:6;
      uint64_t PLL_EN_USB_CLKS:1;
      uint64_t reservedSpace1:5;
      uint64_t PLL_POWER:1;
      uint64_t PLL_ENABLE:1;
      uint64_t reservedSpace2:2;
      uint64_t PLL_BYPASS:1;
      uint64_t reservedSpace3:2;
      uint64_t REFBIAS_PWD_SEL:1;
      uint64_t REFBIAS_PWD:1;
      uint64_t PLL_REG_ENABLE:1;
      uint64_t PLL_DIV_SEL:3;
      uint64_t reservedSpace4:6;
      uint64_t PLL_LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLL_SIC_SET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:6;
      uint64_t PLL_EN_USB_CLKS:1;
      uint64_t reservedSpace1:5;
      uint64_t PLL_POWER:1;
      uint64_t PLL_ENABLE:1;
      uint64_t reservedSpace2:2;
      uint64_t PLL_BYPASS:1;
      uint64_t reservedSpace3:2;
      uint64_t REFBIAS_PWD_SEL:1;
      uint64_t REFBIAS_PWD:1;
      uint64_t PLL_REG_ENABLE:1;
      uint64_t PLL_DIV_SEL:3;
      uint64_t reservedSpace4:6;
      uint64_t PLL_LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLL_SIC_CLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:6;
      uint64_t PLL_EN_USB_CLKS:1;
      uint64_t reservedSpace1:5;
      uint64_t PLL_POWER:1;
      uint64_t PLL_ENABLE:1;
      uint64_t reservedSpace2:2;
      uint64_t PLL_BYPASS:1;
      uint64_t reservedSpace3:2;
      uint64_t REFBIAS_PWD_SEL:1;
      uint64_t REFBIAS_PWD:1;
      uint64_t PLL_REG_ENABLE:1;
      uint64_t PLL_DIV_SEL:3;
      uint64_t reservedSpace4:6;
      uint64_t PLL_LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLL_SIC_TOG;

  uint8_t res3[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VBUSVALID_THRESH:3;
      uint64_t VBUS_OVERRIDE_EN:1;
      uint64_t SESSEND_OVERRIDE:1;
      uint64_t BVALID_OVERRIDE:1;
      uint64_t AVALID_OVERRIDE:1;
      uint64_t VBUSVALID_OVERRIDE:1;
      uint64_t VBUSVALID_SEL:1;
      uint64_t VBUS_SOURCE_SEL:2;
      uint64_t reservedSpace0:7;
      uint64_t VBUSVALID_TO_SESSVALID:1;
      uint64_t reservedSpace1:1;
      uint64_t PWRUP_CMPS:1;
      uint64_t reservedSpace2:5;
      uint64_t DISCHARGE_VBUS:1;
      uint64_t reservedSpace3:4;
      uint64_t EN_CHARGER_RESISTOR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USB1_VBUS_DETECT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VBUSVALID_THRESH:3;
      uint64_t VBUS_OVERRIDE_EN:1;
      uint64_t SESSEND_OVERRIDE:1;
      uint64_t BVALID_OVERRIDE:1;
      uint64_t AVALID_OVERRIDE:1;
      uint64_t VBUSVALID_OVERRIDE:1;
      uint64_t VBUSVALID_SEL:1;
      uint64_t VBUS_SOURCE_SEL:2;
      uint64_t reservedSpace0:7;
      uint64_t VBUSVALID_TO_SESSVALID:1;
      uint64_t reservedSpace1:1;
      uint64_t PWRUP_CMPS:1;
      uint64_t reservedSpace2:5;
      uint64_t DISCHARGE_VBUS:1;
      uint64_t reservedSpace3:4;
      uint64_t EN_CHARGER_RESISTOR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USB1_VBUS_DETECT_SET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VBUSVALID_THRESH:3;
      uint64_t VBUS_OVERRIDE_EN:1;
      uint64_t SESSEND_OVERRIDE:1;
      uint64_t BVALID_OVERRIDE:1;
      uint64_t AVALID_OVERRIDE:1;
      uint64_t VBUSVALID_OVERRIDE:1;
      uint64_t VBUSVALID_SEL:1;
      uint64_t VBUS_SOURCE_SEL:2;
      uint64_t reservedSpace0:7;
      uint64_t VBUSVALID_TO_SESSVALID:1;
      uint64_t reservedSpace1:1;
      uint64_t PWRUP_CMPS:1;
      uint64_t reservedSpace2:5;
      uint64_t DISCHARGE_VBUS:1;
      uint64_t reservedSpace3:4;
      uint64_t EN_CHARGER_RESISTOR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USB1_VBUS_DETECT_CLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VBUSVALID_THRESH:3;
      uint64_t VBUS_OVERRIDE_EN:1;
      uint64_t SESSEND_OVERRIDE:1;
      uint64_t BVALID_OVERRIDE:1;
      uint64_t AVALID_OVERRIDE:1;
      uint64_t VBUSVALID_OVERRIDE:1;
      uint64_t VBUSVALID_SEL:1;
      uint64_t VBUS_SOURCE_SEL:2;
      uint64_t reservedSpace0:7;
      uint64_t VBUSVALID_TO_SESSVALID:1;
      uint64_t reservedSpace1:1;
      uint64_t PWRUP_CMPS:1;
      uint64_t reservedSpace2:5;
      uint64_t DISCHARGE_VBUS:1;
      uint64_t reservedSpace3:4;
      uint64_t EN_CHARGER_RESISTOR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USB1_VBUS_DETECT_TOG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SESSEND:1;
      uint64_t BVALID:1;
      uint64_t AVALID:1;
      uint64_t VBUS_VALID:1;
      uint64_t VBUS_VALID_3V:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USB1_VBUS_DET_STAT;

  uint8_t res4[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t PULLUP_DP:1;
      uint64_t reservedSpace1:20;
      uint64_t BGR_IBIAS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USB1_CHRG_DETECT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t PULLUP_DP:1;
      uint64_t reservedSpace1:20;
      uint64_t BGR_IBIAS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USB1_CHRG_DETECT_SET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t PULLUP_DP:1;
      uint64_t reservedSpace1:20;
      uint64_t BGR_IBIAS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USB1_CHRG_DETECT_CLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t PULLUP_DP:1;
      uint64_t reservedSpace1:20;
      uint64_t BGR_IBIAS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USB1_CHRG_DETECT_TOG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PLUG_CONTACT:1;
      uint64_t CHRG_DETECTED:1;
      uint64_t DM_STATE:1;
      uint64_t DP_STATE:1;
      uint64_t SECDET_DCP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USB1_CHRG_DET_STAT;

