iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/IMXRT685_RAM_GCC/targetInit/iMXRT685_sfr.h
  uint8_t res5[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:10;
      uint64_t DEV_PULLDOWN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ANACTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:10;
      uint64_t DEV_PULLDOWN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ANACTRL_SET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:10;
      uint64_t DEV_PULLDOWN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ANACTRL_CLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:10;
      uint64_t DEV_PULLDOWN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ANACTRL_TOG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UTMI_TESTSTART:1;
      uint64_t UTMI_DIG_TST0:1;
      uint64_t UTMI_DIG_TST1:1;
      uint64_t TSTI_TX_HS_MODE:1;
      uint64_t TSTI_TX_LS_MODE:1;
      uint64_t TSTI_TX_EN:1;
      uint64_t TSTI_TX_HIZ:1;
      uint64_t UTMO_DIG_TST0:1;
      uint64_t UTMO_DIG_TST1:1;
      uint64_t reservedSpace0:6;
      uint64_t TSTI_HSFS_MODE_EN:1;
      uint64_t TSTPKT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USB1_LOOPBACK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UTMI_TESTSTART:1;
      uint64_t UTMI_DIG_TST0:1;
      uint64_t UTMI_DIG_TST1:1;
      uint64_t TSTI_TX_HS_MODE:1;
      uint64_t TSTI_TX_LS_MODE:1;
      uint64_t TSTI_TX_EN:1;
      uint64_t TSTI_TX_HIZ:1;
      uint64_t UTMO_DIG_TST0:1;
      uint64_t UTMO_DIG_TST1:1;
      uint64_t reservedSpace0:6;
      uint64_t TSTI_HSFS_MODE_EN:1;
      uint64_t TSTPKT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USB1_LOOPBACK_SET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UTMI_TESTSTART:1;
      uint64_t UTMI_DIG_TST0:1;
      uint64_t UTMI_DIG_TST1:1;
      uint64_t TSTI_TX_HS_MODE:1;
      uint64_t TSTI_TX_LS_MODE:1;
      uint64_t TSTI_TX_EN:1;
      uint64_t TSTI_TX_HIZ:1;
      uint64_t UTMO_DIG_TST0:1;
      uint64_t UTMO_DIG_TST1:1;
      uint64_t reservedSpace0:6;
      uint64_t TSTI_HSFS_MODE_EN:1;
      uint64_t TSTPKT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USB1_LOOPBACK_CLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UTMI_TESTSTART:1;
      uint64_t UTMI_DIG_TST0:1;
      uint64_t UTMI_DIG_TST1:1;
      uint64_t TSTI_TX_HS_MODE:1;
      uint64_t TSTI_TX_LS_MODE:1;
      uint64_t TSTI_TX_EN:1;
      uint64_t TSTI_TX_HIZ:1;
      uint64_t UTMO_DIG_TST0:1;
      uint64_t UTMO_DIG_TST1:1;
      uint64_t reservedSpace0:6;
      uint64_t TSTI_HSFS_MODE_EN:1;
      uint64_t TSTPKT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USB1_LOOPBACK_TOG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSTI_HS_NUMBER:16;
      uint64_t TSTI_FS_NUMBER:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USB1_LOOPBACK_HSFSCNT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSTI_HS_NUMBER:16;
      uint64_t TSTI_FS_NUMBER:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USB1_LOOPBACK_HSFSCNT_SET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSTI_HS_NUMBER:16;
      uint64_t TSTI_FS_NUMBER:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USB1_LOOPBACK_HSFSCNT_CLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSTI_HS_NUMBER:16;
      uint64_t TSTI_FS_NUMBER:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USB1_LOOPBACK_HSFSCNT_TOG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRIM_DIV_SEL_OVERRIDE:1;
      uint64_t TRIM_ENV_TAIL_ADJ_VD_OVERRIDE:1;
      uint64_t TRIM_TX_D_CAL_OVERRIDE:1;
      uint64_t TRIM_TX_CAL45DP_OVERRIDE:1;
      uint64_t TRIM_TX_CAL45DM_OVERRIDE:1;
      uint64_t TRIM_REFBIAS_VBGADJ_OVERRIDE:1;
      uint64_t TRIM_REFBIAS_TST_OVERRIDE:1;
      uint64_t reservedSpace0:3;
      uint64_t TRIM_USB2_REFBIAS_VBGADJ:3;
      uint64_t TRIM_USB2_REFBIAS_TST:2;
      uint64_t TRIM_PLL_CTRL0_DIV_SEL:3;
      uint64_t TRIM_USB_REG_ENV_TAIL_ADJ_VD:2;
      uint64_t TRIM_USBPHY_TX_D_CAL:4;
      uint64_t TRIM_USBPHY_TX_CAL45DP:4;
      uint64_t TRIM_USBPHY_TX_CAL45DM:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRIM_OVERRIDE_EN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRIM_DIV_SEL_OVERRIDE:1;
      uint64_t TRIM_ENV_TAIL_ADJ_VD_OVERRIDE:1;
      uint64_t TRIM_TX_D_CAL_OVERRIDE:1;
      uint64_t TRIM_TX_CAL45DP_OVERRIDE:1;
      uint64_t TRIM_TX_CAL45DM_OVERRIDE:1;
      uint64_t TRIM_REFBIAS_VBGADJ_OVERRIDE:1;
      uint64_t TRIM_REFBIAS_TST_OVERRIDE:1;
      uint64_t reservedSpace0:3;
      uint64_t TRIM_USB2_REFBIAS_VBGADJ:3;
      uint64_t TRIM_USB2_REFBIAS_TST:2;
      uint64_t TRIM_PLL_CTRL0_DIV_SEL:3;
      uint64_t TRIM_USB_REG_ENV_TAIL_ADJ_VD:2;
      uint64_t TRIM_USBPHY_TX_D_CAL:4;
      uint64_t TRIM_USBPHY_TX_CAL45DP:4;
      uint64_t TRIM_USBPHY_TX_CAL45DM:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRIM_OVERRIDE_EN_SET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRIM_DIV_SEL_OVERRIDE:1;
      uint64_t TRIM_ENV_TAIL_ADJ_VD_OVERRIDE:1;
      uint64_t TRIM_TX_D_CAL_OVERRIDE:1;
      uint64_t TRIM_TX_CAL45DP_OVERRIDE:1;
      uint64_t TRIM_TX_CAL45DM_OVERRIDE:1;
      uint64_t TRIM_REFBIAS_VBGADJ_OVERRIDE:1;
      uint64_t TRIM_REFBIAS_TST_OVERRIDE:1;
      uint64_t reservedSpace0:3;
      uint64_t TRIM_USB2_REFBIAS_VBGADJ:3;
      uint64_t TRIM_USB2_REFBIAS_TST:2;
      uint64_t TRIM_PLL_CTRL0_DIV_SEL:3;
      uint64_t TRIM_USB_REG_ENV_TAIL_ADJ_VD:2;
      uint64_t TRIM_USBPHY_TX_D_CAL:4;
      uint64_t TRIM_USBPHY_TX_CAL45DP:4;
      uint64_t TRIM_USBPHY_TX_CAL45DM:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRIM_OVERRIDE_EN_CLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRIM_DIV_SEL_OVERRIDE:1;
      uint64_t TRIM_ENV_TAIL_ADJ_VD_OVERRIDE:1;
      uint64_t TRIM_TX_D_CAL_OVERRIDE:1;
      uint64_t TRIM_TX_CAL45DP_OVERRIDE:1;
      uint64_t TRIM_TX_CAL45DM_OVERRIDE:1;
      uint64_t TRIM_REFBIAS_VBGADJ_OVERRIDE:1;
      uint64_t TRIM_REFBIAS_TST_OVERRIDE:1;
      uint64_t reservedSpace0:3;
      uint64_t TRIM_USB2_REFBIAS_VBGADJ:3;
      uint64_t TRIM_USB2_REFBIAS_TST:2;
      uint64_t TRIM_PLL_CTRL0_DIV_SEL:3;
      uint64_t TRIM_USB_REG_ENV_TAIL_ADJ_VD:2;
      uint64_t TRIM_USBPHY_TX_D_CAL:4;
      uint64_t TRIM_USBPHY_TX_CAL45DP:4;
      uint64_t TRIM_USBPHY_TX_CAL45DM:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRIM_OVERRIDE_EN_TOG;

