iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/IMXRT685_RAM_GCC/targetInit/iMXRT685_sfr.h
};

#define USBPHY (*(volatile struct USBPHY_tag *) 0x4013b000)

struct USBHSD_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t DEV_ADDR:7;
      uint64_t DEV_EN:1;
      uint64_t SETUP:1;
      uint64_t FORCE_NEEDCLK:1;
      uint64_t FORCE_VBUS:1;
      uint64_t LPM_SUP:1;
      uint64_t INTONNAK_AO:1;
      uint64_t INTONNAK_AI:1;
      uint64_t INTONNAK_CO:1;
      uint64_t INTONNAK_CI:1;
      uint64_t DCON:1;
      uint64_t DSUS:1;
      uint64_t reservedSpace0:1;
      uint64_t LPM_SUS:1;
      uint64_t LPM_REWP:1;
      uint64_t reservedSpace1:1;
      uint64_t SPEED:2;
      uint64_t DCON_C:1;
      uint64_t DSUS_C:1;
      uint64_t DRES_C:1;
      uint64_t reservedSpace2:1;
      uint64_t VBUS_DEBOUNCED:1;
      uint64_t PHY_TEST_MODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DEVCMDSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FRAME_NR:11;
      uint64_t ERR_CODE:4;
      uint64_t reservedSpace0:1;
      uint64_t Minrev:8;
      uint64_t Majrev:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INFO;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t EP_LIST_PRG:12;
      uint64_t EP_LIST_FIXED:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EPLISTSTART;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DA_BUF_FIXED:18;
      uint64_t DA_BUF:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATABUFSTART;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HIRD_HW:4;
      uint64_t HIRD_SW:4;
      uint64_t DATA_PENDING:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LPM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SKIP:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EPSKIP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t BUF:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EPINUSE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t BUF_SB:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EPBUFCFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EP0OUT:1;
      uint64_t EP0IN:1;
      uint64_t EP1OUT:1;
      uint64_t EP1IN:1;
      uint64_t EP2OUT:1;
      uint64_t EP2IN:1;
      uint64_t EP3OUT:1;
      uint64_t EP3IN:1;
      uint64_t EP4OUT:1;
      uint64_t EP4IN:1;
      uint64_t EP5OUT:1;
      uint64_t EP5IN:1;
      uint64_t reservedSpace0:18;
      uint64_t FRAME_INT:1;
      uint64_t DEV_INT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EP_INT_EN:12;
      uint64_t reservedSpace0:18;
      uint64_t FRAME_INT_EN:1;
      uint64_t DEV_INT_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EP_SET_INT:12;
      uint64_t reservedSpace0:18;
      uint64_t FRAME_SET_INT:1;
      uint64_t DEV_SET_INT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTSETSTAT;

  uint8_t res0[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TOGGLE:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EPTOGGLE;

};

#define USBHSD (*(volatile struct USBHSD_tag *) 0x40144000)

struct USBHSH_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAPLENGTH:8;
      uint64_t reservedSpace0:8;
      uint64_t CHIPID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAPLENGTH_CHIPID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t N_PORTS:4;
      uint64_t PPC:1;
      uint64_t reservedSpace0:11;
      uint64_t P_INDICATOR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCSPARAMS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:17;
      uint64_t LPMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCCPARAMS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLADJ:6;
      uint64_t reservedSpace0:10;
      uint64_t FRINDEX:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLADJ_FRINDEX;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t ATL_CUR:5;
      uint64_t ATL_BASE:23;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ATLPTD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:5;
      uint64_t ISO_FIRST:5;
      uint64_t ISO_BASE:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ISOPTD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:5;
      uint64_t INT_FIRST:5;
      uint64_t INT_BASE:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPTD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t DAT_BASE:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATAPAYLOAD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RS:1;
      uint64_t HCRESET:1;
      uint64_t FLS:2;
      uint64_t reservedSpace0:3;
      uint64_t LHCR:1;
      uint64_t ATL_EN:1;
      uint64_t ISO_EN:1;
      uint64_t INT_EN:1;
      uint64_t reservedSpace1:13;
      uint64_t HIRD:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USBCMD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t PCD:1;
      uint64_t FLR:1;
      uint64_t reservedSpace1:12;
      uint64_t ATL_IRQ:1;
      uint64_t ISO_IRQ:1;
      uint64_t INT_IRQ:1;
      uint64_t SOF_IRQ:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USBSTS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t PCDE:1;
      uint64_t FLRE:1;
      uint64_t reservedSpace1:12;
      uint64_t ATL_IRQ_E:1;
      uint64_t ISO_IRQ_E:1;
      uint64_t INT_IRQ_E:1;
      uint64_t SOF_E:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USBINTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CCS:1;
      uint64_t CSC:1;
      uint64_t PED:1;
      uint64_t PEDC:1;
      uint64_t OCA:1;
      uint64_t OCC:1;
      uint64_t FPR:1;
      uint64_t SUSP:1;
      uint64_t PR:1;
      uint64_t SUS_L1:1;
      uint64_t LS:2;
      uint64_t PP:1;
      uint64_t reservedSpace0:1;
      uint64_t PIC:2;
      uint64_t PTC:4;
      uint64_t PSPD:2;
      uint64_t WOO:1;
      uint64_t SUS_STAT:2;
      uint64_t DEV_ADD:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTSC1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ATL_DONE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ATLPTDD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ATL_SKIP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ATLPTDS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ISO_DONE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ISOPTDD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ISO_SKIP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ISOPTDS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INT_DONE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPTDD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INT_SKIP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTPTDS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ATL_LAST:5;
      uint64_t reservedSpace0:3;
      uint64_t ISO_LAST:5;
      uint64_t reservedSpace1:3;
      uint64_t INT_LAST:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LASTPTD;

