iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/IMXRT685_RAM_GCC/targetInit/iMXRT685_sfr.h
  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t DEV_ENABLE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTMODE;

};

#define USBHSH (*(volatile struct USBHSH_tag *) 0x40145000)

struct SCT0_EV_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t STATEMSKn:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MATCHSEL:4;
      uint64_t HEVENT:1;
      uint64_t OUTSEL:1;
      uint64_t IOSEL:4;
      uint64_t IOCOND:2;
      uint64_t COMBMODE:2;
      uint64_t STATELD:1;
      uint64_t STATEV:5;
      uint64_t MATCHMEM:1;
      uint64_t DIRECTION:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL;

};

#define SCT0_EV_0 (*(volatile struct SCT0_EV_0_tag *) 0x40146300)

struct SCT0_EV_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t STATEMSKn:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MATCHSEL:4;
      uint64_t HEVENT:1;
      uint64_t OUTSEL:1;
      uint64_t IOSEL:4;
      uint64_t IOCOND:2;
      uint64_t COMBMODE:2;
      uint64_t STATELD:1;
      uint64_t STATEV:5;
      uint64_t MATCHMEM:1;
      uint64_t DIRECTION:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL;

};

#define SCT0_EV_1 (*(volatile struct SCT0_EV_1_tag *) 0x40146308)

struct SCT0_EV_2_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t STATEMSKn:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MATCHSEL:4;
      uint64_t HEVENT:1;
      uint64_t OUTSEL:1;
      uint64_t IOSEL:4;
      uint64_t IOCOND:2;
      uint64_t COMBMODE:2;
      uint64_t STATELD:1;
      uint64_t STATEV:5;
      uint64_t MATCHMEM:1;
      uint64_t DIRECTION:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL;

};

#define SCT0_EV_2 (*(volatile struct SCT0_EV_2_tag *) 0x40146310)

struct SCT0_EV_3_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t STATEMSKn:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MATCHSEL:4;
      uint64_t HEVENT:1;
      uint64_t OUTSEL:1;
      uint64_t IOSEL:4;
      uint64_t IOCOND:2;
      uint64_t COMBMODE:2;
      uint64_t STATELD:1;
      uint64_t STATEV:5;
      uint64_t MATCHMEM:1;
      uint64_t DIRECTION:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL;

};

#define SCT0_EV_3 (*(volatile struct SCT0_EV_3_tag *) 0x40146318)

struct SCT0_EV_4_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t STATEMSKn:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MATCHSEL:4;
      uint64_t HEVENT:1;
      uint64_t OUTSEL:1;
      uint64_t IOSEL:4;
      uint64_t IOCOND:2;
      uint64_t COMBMODE:2;
      uint64_t STATELD:1;
      uint64_t STATEV:5;
      uint64_t MATCHMEM:1;
      uint64_t DIRECTION:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL;

};

#define SCT0_EV_4 (*(volatile struct SCT0_EV_4_tag *) 0x40146320)

struct SCT0_EV_5_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t STATEMSKn:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MATCHSEL:4;
      uint64_t HEVENT:1;
      uint64_t OUTSEL:1;
      uint64_t IOSEL:4;
      uint64_t IOCOND:2;
      uint64_t COMBMODE:2;
      uint64_t STATELD:1;
      uint64_t STATEV:5;
      uint64_t MATCHMEM:1;
      uint64_t DIRECTION:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL;

};

#define SCT0_EV_5 (*(volatile struct SCT0_EV_5_tag *) 0x40146328)

struct SCT0_EV_6_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t STATEMSKn:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MATCHSEL:4;
      uint64_t HEVENT:1;
      uint64_t OUTSEL:1;
      uint64_t IOSEL:4;
      uint64_t IOCOND:2;
      uint64_t COMBMODE:2;
      uint64_t STATELD:1;
      uint64_t STATEV:5;
      uint64_t MATCHMEM:1;
      uint64_t DIRECTION:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL;

};

#define SCT0_EV_6 (*(volatile struct SCT0_EV_6_tag *) 0x40146330)

struct SCT0_EV_7_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t STATEMSKn:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MATCHSEL:4;
      uint64_t HEVENT:1;
      uint64_t OUTSEL:1;
      uint64_t IOSEL:4;
      uint64_t IOCOND:2;
      uint64_t COMBMODE:2;
      uint64_t STATELD:1;
      uint64_t STATEV:5;
      uint64_t MATCHMEM:1;
      uint64_t DIRECTION:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL;

};

#define SCT0_EV_7 (*(volatile struct SCT0_EV_7_tag *) 0x40146338)

struct SCT0_EV_8_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t STATEMSKn:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MATCHSEL:4;
      uint64_t HEVENT:1;
      uint64_t OUTSEL:1;
      uint64_t IOSEL:4;
      uint64_t IOCOND:2;
      uint64_t COMBMODE:2;
      uint64_t STATELD:1;
      uint64_t STATEV:5;
      uint64_t MATCHMEM:1;
      uint64_t DIRECTION:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL;

};

#define SCT0_EV_8 (*(volatile struct SCT0_EV_8_tag *) 0x40146340)

struct SCT0_EV_9_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t STATEMSKn:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MATCHSEL:4;
      uint64_t HEVENT:1;
      uint64_t OUTSEL:1;
      uint64_t IOSEL:4;
      uint64_t IOCOND:2;
      uint64_t COMBMODE:2;
      uint64_t STATELD:1;
      uint64_t STATEV:5;
      uint64_t MATCHMEM:1;
      uint64_t DIRECTION:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL;

