iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/IMXRT685_RAM_GCC/targetInit/iMXRT685_sfr.h
};

#define SCT0_EV_9 (*(volatile struct SCT0_EV_9_tag *) 0x40146348)

struct SCT0_EV_10_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t STATEMSKn:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MATCHSEL:4;
      uint64_t HEVENT:1;
      uint64_t OUTSEL:1;
      uint64_t IOSEL:4;
      uint64_t IOCOND:2;
      uint64_t COMBMODE:2;
      uint64_t STATELD:1;
      uint64_t STATEV:5;
      uint64_t MATCHMEM:1;
      uint64_t DIRECTION:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL;

};

#define SCT0_EV_10 (*(volatile struct SCT0_EV_10_tag *) 0x40146350)

struct SCT0_EV_11_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t STATEMSKn:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MATCHSEL:4;
      uint64_t HEVENT:1;
      uint64_t OUTSEL:1;
      uint64_t IOSEL:4;
      uint64_t IOCOND:2;
      uint64_t COMBMODE:2;
      uint64_t STATELD:1;
      uint64_t STATEV:5;
      uint64_t MATCHMEM:1;
      uint64_t DIRECTION:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL;

};

#define SCT0_EV_11 (*(volatile struct SCT0_EV_11_tag *) 0x40146358)

struct SCT0_EV_12_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t STATEMSKn:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MATCHSEL:4;
      uint64_t HEVENT:1;
      uint64_t OUTSEL:1;
      uint64_t IOSEL:4;
      uint64_t IOCOND:2;
      uint64_t COMBMODE:2;
      uint64_t STATELD:1;
      uint64_t STATEV:5;
      uint64_t MATCHMEM:1;
      uint64_t DIRECTION:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL;

};

#define SCT0_EV_12 (*(volatile struct SCT0_EV_12_tag *) 0x40146360)

struct SCT0_EV_13_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t STATEMSKn:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MATCHSEL:4;
      uint64_t HEVENT:1;
      uint64_t OUTSEL:1;
      uint64_t IOSEL:4;
      uint64_t IOCOND:2;
      uint64_t COMBMODE:2;
      uint64_t STATELD:1;
      uint64_t STATEV:5;
      uint64_t MATCHMEM:1;
      uint64_t DIRECTION:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL;

};

#define SCT0_EV_13 (*(volatile struct SCT0_EV_13_tag *) 0x40146368)

struct SCT0_EV_14_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t STATEMSKn:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MATCHSEL:4;
      uint64_t HEVENT:1;
      uint64_t OUTSEL:1;
      uint64_t IOSEL:4;
      uint64_t IOCOND:2;
      uint64_t COMBMODE:2;
      uint64_t STATELD:1;
      uint64_t STATEV:5;
      uint64_t MATCHMEM:1;
      uint64_t DIRECTION:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL;

};

#define SCT0_EV_14 (*(volatile struct SCT0_EV_14_tag *) 0x40146370)

struct SCT0_EV_15_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t STATEMSKn:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MATCHSEL:4;
      uint64_t HEVENT:1;
      uint64_t OUTSEL:1;
      uint64_t IOSEL:4;
      uint64_t IOCOND:2;
      uint64_t COMBMODE:2;
      uint64_t STATELD:1;
      uint64_t STATEV:5;
      uint64_t MATCHMEM:1;
      uint64_t DIRECTION:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL;

};

#define SCT0_EV_15 (*(volatile struct SCT0_EV_15_tag *) 0x40146378)

struct SCT0_OUT_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SET:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLR;

};

#define SCT0_OUT_0 (*(volatile struct SCT0_OUT_0_tag *) 0x40146500)

struct SCT0_OUT_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SET:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLR;

};

#define SCT0_OUT_1 (*(volatile struct SCT0_OUT_1_tag *) 0x40146508)

struct SCT0_OUT_2_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SET:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLR;

};

#define SCT0_OUT_2 (*(volatile struct SCT0_OUT_2_tag *) 0x40146510)

struct SCT0_OUT_3_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SET:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLR;

};

#define SCT0_OUT_3 (*(volatile struct SCT0_OUT_3_tag *) 0x40146518)

struct SCT0_OUT_4_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SET:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLR;

};

#define SCT0_OUT_4 (*(volatile struct SCT0_OUT_4_tag *) 0x40146520)

struct SCT0_OUT_5_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SET:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLR;

};

#define SCT0_OUT_5 (*(volatile struct SCT0_OUT_5_tag *) 0x40146528)

struct SCT0_OUT_6_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SET:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLR;

