iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/IMXRT685_RAM_GCC/targetInit/iMXRT685_sfr.h
};

#define SCT0_OUT_6 (*(volatile struct SCT0_OUT_6_tag *) 0x40146530)

struct SCT0_OUT_7_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SET:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLR;

};

#define SCT0_OUT_7 (*(volatile struct SCT0_OUT_7_tag *) 0x40146538)

struct SCT0_OUT_8_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SET:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLR;

};

#define SCT0_OUT_8 (*(volatile struct SCT0_OUT_8_tag *) 0x40146540)

struct SCT0_OUT_9_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SET:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLR;

};

#define SCT0_OUT_9 (*(volatile struct SCT0_OUT_9_tag *) 0x40146548)

struct AHB_SECURE_CTRL_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
      uint64_t reservedSpace3:2;
      uint64_t RULE4:2;
      uint64_t reservedSpace4:2;
      uint64_t RULE5:2;
      uint64_t reservedSpace5:2;
      uint64_t RULE6:2;
      uint64_t reservedSpace6:2;
      uint64_t RULE7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ROM_MEM_RULE_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
      uint64_t reservedSpace3:2;
      uint64_t RULE4:2;
      uint64_t reservedSpace4:2;
      uint64_t RULE5:2;
      uint64_t reservedSpace5:2;
      uint64_t RULE6:2;
      uint64_t reservedSpace6:2;
      uint64_t RULE7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ROM_MEM_RULE_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
      uint64_t reservedSpace3:2;
      uint64_t RULE4:2;
      uint64_t reservedSpace4:2;
      uint64_t RULE5:2;
      uint64_t reservedSpace5:2;
      uint64_t RULE6:2;
      uint64_t reservedSpace6:2;
      uint64_t RULE7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ROM_MEM_RULE_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
      uint64_t reservedSpace3:2;
      uint64_t RULE4:2;
      uint64_t reservedSpace4:2;
      uint64_t RULE5:2;
      uint64_t reservedSpace5:2;
      uint64_t RULE6:2;
      uint64_t reservedSpace6:2;
      uint64_t RULE7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ROM_MEM_RULE_3;

  uint8_t res0[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
      uint64_t reservedSpace3:2;
      uint64_t RULE4:2;
      uint64_t reservedSpace4:2;
      uint64_t RULE5:2;
      uint64_t reservedSpace5:2;
      uint64_t RULE6:2;
      uint64_t reservedSpace6:2;
      uint64_t RULE7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLEXSPI0_REGION0_RULE_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
      uint64_t reservedSpace3:2;
      uint64_t RULE4:2;
      uint64_t reservedSpace4:2;
      uint64_t RULE5:2;
      uint64_t reservedSpace5:2;
      uint64_t RULE6:2;
      uint64_t reservedSpace6:2;
      uint64_t RULE7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLEXSPI0_REGION0_RULE_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
      uint64_t reservedSpace3:2;
      uint64_t RULE4:2;
      uint64_t reservedSpace4:2;
      uint64_t RULE5:2;
      uint64_t reservedSpace5:2;
      uint64_t RULE6:2;
      uint64_t reservedSpace6:2;
      uint64_t RULE7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLEXSPI0_REGION0_RULE_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
      uint64_t reservedSpace3:2;
      uint64_t RULE4:2;
      uint64_t reservedSpace4:2;
      uint64_t RULE5:2;
      uint64_t reservedSpace5:2;
      uint64_t RULE6:2;
      uint64_t reservedSpace6:2;
      uint64_t RULE7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLEXSPI0_REGION0_RULE_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLEXSPI0_REGION1_RULE0;

  uint8_t res1[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLEXSPI0_REGION2_RULE0;

