iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/IMXRT685_RAM_GCC/targetInit/iMXRT685_sfr.h
  uint8_t res2[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLEXSPI0_REGION3_RULE0;

  uint8_t res3[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLEXSPI0_REGION4_RULE0;

  uint8_t res4[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
      uint64_t reservedSpace3:2;
      uint64_t RULE4:2;
      uint64_t reservedSpace4:2;
      uint64_t RULE5:2;
      uint64_t reservedSpace5:2;
      uint64_t RULE6:2;
      uint64_t reservedSpace6:2;
      uint64_t RULE7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAM00_RULE_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
      uint64_t reservedSpace3:2;
      uint64_t RULE4:2;
      uint64_t reservedSpace4:2;
      uint64_t RULE5:2;
      uint64_t reservedSpace5:2;
      uint64_t RULE6:2;
      uint64_t reservedSpace6:2;
      uint64_t RULE7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAM00_RULE_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
      uint64_t reservedSpace3:2;
      uint64_t RULE4:2;
      uint64_t reservedSpace4:2;
      uint64_t RULE5:2;
      uint64_t reservedSpace5:2;
      uint64_t RULE6:2;
      uint64_t reservedSpace6:2;
      uint64_t RULE7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAM00_RULE_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
      uint64_t reservedSpace3:2;
      uint64_t RULE4:2;
      uint64_t reservedSpace4:2;
      uint64_t RULE5:2;
      uint64_t reservedSpace5:2;
      uint64_t RULE6:2;
      uint64_t reservedSpace6:2;
      uint64_t RULE7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAM00_RULE_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
      uint64_t reservedSpace3:2;
      uint64_t RULE4:2;
      uint64_t reservedSpace4:2;
      uint64_t RULE5:2;
      uint64_t reservedSpace5:2;
      uint64_t RULE6:2;
      uint64_t reservedSpace6:2;
      uint64_t RULE7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAM01_RULE_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
      uint64_t reservedSpace3:2;
      uint64_t RULE4:2;
      uint64_t reservedSpace4:2;
      uint64_t RULE5:2;
      uint64_t reservedSpace5:2;
      uint64_t RULE6:2;
      uint64_t reservedSpace6:2;
      uint64_t RULE7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAM01_RULE_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
      uint64_t reservedSpace3:2;
      uint64_t RULE4:2;
      uint64_t reservedSpace4:2;
      uint64_t RULE5:2;
      uint64_t reservedSpace5:2;
      uint64_t RULE6:2;
      uint64_t reservedSpace6:2;
      uint64_t RULE7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAM01_RULE_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
      uint64_t reservedSpace3:2;
      uint64_t RULE4:2;
      uint64_t reservedSpace4:2;
      uint64_t RULE5:2;
      uint64_t reservedSpace5:2;
      uint64_t RULE6:2;
      uint64_t reservedSpace6:2;
      uint64_t RULE7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAM01_RULE_3;

  uint8_t res5[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
      uint64_t reservedSpace3:2;
      uint64_t RULE4:2;
      uint64_t reservedSpace4:2;
      uint64_t RULE5:2;
      uint64_t reservedSpace5:2;
      uint64_t RULE6:2;
      uint64_t reservedSpace6:2;
      uint64_t RULE7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAM02_RULE_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
      uint64_t reservedSpace3:2;
      uint64_t RULE4:2;
      uint64_t reservedSpace4:2;
      uint64_t RULE5:2;
      uint64_t reservedSpace5:2;
      uint64_t RULE6:2;
      uint64_t reservedSpace6:2;
      uint64_t RULE7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAM02_RULE_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
      uint64_t reservedSpace3:2;
      uint64_t RULE4:2;
      uint64_t reservedSpace4:2;
      uint64_t RULE5:2;
      uint64_t reservedSpace5:2;
      uint64_t RULE6:2;
      uint64_t reservedSpace6:2;
      uint64_t RULE7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAM02_RULE_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
      uint64_t reservedSpace3:2;
      uint64_t RULE4:2;
      uint64_t reservedSpace4:2;
      uint64_t RULE5:2;
      uint64_t reservedSpace5:2;
      uint64_t RULE6:2;
      uint64_t reservedSpace6:2;
      uint64_t RULE7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAM02_RULE_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
      uint64_t reservedSpace3:2;
      uint64_t RULE4:2;
      uint64_t reservedSpace4:2;
      uint64_t RULE5:2;
      uint64_t reservedSpace5:2;
      uint64_t RULE6:2;
      uint64_t reservedSpace6:2;
      uint64_t RULE7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAM03_RULE_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
      uint64_t reservedSpace3:2;
      uint64_t RULE4:2;
      uint64_t reservedSpace4:2;
      uint64_t RULE5:2;
      uint64_t reservedSpace5:2;
      uint64_t RULE6:2;
      uint64_t reservedSpace6:2;
      uint64_t RULE7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAM03_RULE_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
      uint64_t reservedSpace3:2;
      uint64_t RULE4:2;
      uint64_t reservedSpace4:2;
      uint64_t RULE5:2;
      uint64_t reservedSpace5:2;
      uint64_t RULE6:2;
      uint64_t reservedSpace6:2;
      uint64_t RULE7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAM03_RULE_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
      uint64_t reservedSpace3:2;
      uint64_t RULE4:2;
      uint64_t reservedSpace4:2;
      uint64_t RULE5:2;
      uint64_t reservedSpace5:2;
      uint64_t RULE6:2;
      uint64_t reservedSpace6:2;
      uint64_t RULE7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAM03_RULE_3;

  uint8_t res6[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
      uint64_t reservedSpace3:2;
      uint64_t RULE4:2;
      uint64_t reservedSpace4:2;
      uint64_t RULE5:2;
      uint64_t reservedSpace5:2;
      uint64_t RULE6:2;
      uint64_t reservedSpace6:2;
      uint64_t RULE7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAM04_RULE_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
      uint64_t reservedSpace3:2;
      uint64_t RULE4:2;
      uint64_t reservedSpace4:2;
      uint64_t RULE5:2;
      uint64_t reservedSpace5:2;
      uint64_t RULE6:2;
      uint64_t reservedSpace6:2;
      uint64_t RULE7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAM04_RULE_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
      uint64_t reservedSpace3:2;
      uint64_t RULE4:2;
      uint64_t reservedSpace4:2;
      uint64_t RULE5:2;
      uint64_t reservedSpace5:2;
      uint64_t RULE6:2;
      uint64_t reservedSpace6:2;
      uint64_t RULE7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAM04_RULE_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
      uint64_t reservedSpace3:2;
      uint64_t RULE4:2;
      uint64_t reservedSpace4:2;
      uint64_t RULE5:2;
      uint64_t reservedSpace5:2;
      uint64_t RULE6:2;
      uint64_t reservedSpace6:2;
      uint64_t RULE7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAM04_RULE_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
      uint64_t reservedSpace3:2;
      uint64_t RULE4:2;
      uint64_t reservedSpace4:2;
      uint64_t RULE5:2;
      uint64_t reservedSpace5:2;
      uint64_t RULE6:2;
      uint64_t reservedSpace6:2;
      uint64_t RULE7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAM05_RULE_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
      uint64_t reservedSpace3:2;
      uint64_t RULE4:2;
      uint64_t reservedSpace4:2;
      uint64_t RULE5:2;
      uint64_t reservedSpace5:2;
      uint64_t RULE6:2;
      uint64_t reservedSpace6:2;
      uint64_t RULE7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAM05_RULE_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
      uint64_t reservedSpace3:2;
      uint64_t RULE4:2;
      uint64_t reservedSpace4:2;
      uint64_t RULE5:2;
      uint64_t reservedSpace5:2;
      uint64_t RULE6:2;
      uint64_t reservedSpace6:2;
      uint64_t RULE7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAM05_RULE_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
      uint64_t reservedSpace3:2;
      uint64_t RULE4:2;
      uint64_t reservedSpace4:2;
      uint64_t RULE5:2;
      uint64_t reservedSpace5:2;
      uint64_t RULE6:2;
      uint64_t reservedSpace6:2;
      uint64_t RULE7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAM05_RULE_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
      uint64_t reservedSpace3:2;
      uint64_t RULE4:2;
      uint64_t reservedSpace4:2;
      uint64_t RULE5:2;
      uint64_t reservedSpace5:2;
      uint64_t RULE6:2;
      uint64_t reservedSpace6:2;
      uint64_t RULE7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAM06_RULE_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
      uint64_t reservedSpace3:2;
      uint64_t RULE4:2;
      uint64_t reservedSpace4:2;
      uint64_t RULE5:2;
      uint64_t reservedSpace5:2;
      uint64_t RULE6:2;
      uint64_t reservedSpace6:2;
      uint64_t RULE7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAM06_RULE_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
      uint64_t reservedSpace3:2;
      uint64_t RULE4:2;
      uint64_t reservedSpace4:2;
      uint64_t RULE5:2;
      uint64_t reservedSpace5:2;
      uint64_t RULE6:2;
      uint64_t reservedSpace6:2;
      uint64_t RULE7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAM06_RULE_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
      uint64_t reservedSpace3:2;
      uint64_t RULE4:2;
      uint64_t reservedSpace4:2;
      uint64_t RULE5:2;
      uint64_t reservedSpace5:2;
      uint64_t RULE6:2;
      uint64_t reservedSpace6:2;
      uint64_t RULE7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAM06_RULE_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
      uint64_t reservedSpace3:2;
      uint64_t RULE4:2;
      uint64_t reservedSpace4:2;
      uint64_t RULE5:2;
      uint64_t reservedSpace5:2;
      uint64_t RULE6:2;
      uint64_t reservedSpace6:2;
      uint64_t RULE7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAM07_RULE_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
      uint64_t reservedSpace3:2;
      uint64_t RULE4:2;
      uint64_t reservedSpace4:2;
      uint64_t RULE5:2;
      uint64_t reservedSpace5:2;
      uint64_t RULE6:2;
      uint64_t reservedSpace6:2;
      uint64_t RULE7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAM07_RULE_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
      uint64_t reservedSpace3:2;
      uint64_t RULE4:2;
      uint64_t reservedSpace4:2;
      uint64_t RULE5:2;
      uint64_t reservedSpace5:2;
      uint64_t RULE6:2;
      uint64_t reservedSpace6:2;
      uint64_t RULE7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAM07_RULE_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
      uint64_t reservedSpace3:2;
      uint64_t RULE4:2;
      uint64_t reservedSpace4:2;
      uint64_t RULE5:2;
      uint64_t reservedSpace5:2;
      uint64_t RULE6:2;
      uint64_t reservedSpace6:2;
      uint64_t RULE7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAM07_RULE_3;

  uint8_t res7[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
      uint64_t reservedSpace3:2;
      uint64_t RULE4:2;
      uint64_t reservedSpace4:2;
      uint64_t RULE5:2;
      uint64_t reservedSpace5:2;
      uint64_t RULE6:2;
      uint64_t reservedSpace6:2;
      uint64_t RULE7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAM08_RULE_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
      uint64_t reservedSpace3:2;
      uint64_t RULE4:2;
      uint64_t reservedSpace4:2;
      uint64_t RULE5:2;
      uint64_t reservedSpace5:2;
      uint64_t RULE6:2;
      uint64_t reservedSpace6:2;
      uint64_t RULE7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAM08_RULE_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
      uint64_t reservedSpace3:2;
      uint64_t RULE4:2;
      uint64_t reservedSpace4:2;
      uint64_t RULE5:2;
      uint64_t reservedSpace5:2;
      uint64_t RULE6:2;
      uint64_t reservedSpace6:2;
      uint64_t RULE7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAM08_RULE_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
      uint64_t reservedSpace3:2;
      uint64_t RULE4:2;
      uint64_t reservedSpace4:2;
      uint64_t RULE5:2;
      uint64_t reservedSpace5:2;
      uint64_t RULE6:2;
      uint64_t reservedSpace6:2;
      uint64_t RULE7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAM08_RULE_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
      uint64_t reservedSpace3:2;
      uint64_t RULE4:2;
      uint64_t reservedSpace4:2;
      uint64_t RULE5:2;
      uint64_t reservedSpace5:2;
      uint64_t RULE6:2;
      uint64_t reservedSpace6:2;
      uint64_t RULE7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAM09_RULE_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
      uint64_t reservedSpace3:2;
      uint64_t RULE4:2;
      uint64_t reservedSpace4:2;
      uint64_t RULE5:2;
      uint64_t reservedSpace5:2;
      uint64_t RULE6:2;
      uint64_t reservedSpace6:2;
      uint64_t RULE7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAM09_RULE_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
      uint64_t reservedSpace3:2;
      uint64_t RULE4:2;
      uint64_t reservedSpace4:2;
      uint64_t RULE5:2;
      uint64_t reservedSpace5:2;
      uint64_t RULE6:2;
      uint64_t reservedSpace6:2;
      uint64_t RULE7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAM09_RULE_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
      uint64_t reservedSpace3:2;
      uint64_t RULE4:2;
      uint64_t reservedSpace4:2;
      uint64_t RULE5:2;
      uint64_t reservedSpace5:2;
      uint64_t RULE6:2;
      uint64_t reservedSpace6:2;
      uint64_t RULE7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAM09_RULE_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
      uint64_t reservedSpace3:2;
      uint64_t RULE4:2;
      uint64_t reservedSpace4:2;
      uint64_t RULE5:2;
      uint64_t reservedSpace5:2;
      uint64_t RULE6:2;
      uint64_t reservedSpace6:2;
      uint64_t RULE7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAM10_RULE_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
      uint64_t reservedSpace3:2;
      uint64_t RULE4:2;
      uint64_t reservedSpace4:2;
      uint64_t RULE5:2;
      uint64_t reservedSpace5:2;
      uint64_t RULE6:2;
      uint64_t reservedSpace6:2;
      uint64_t RULE7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAM10_RULE_1;

