iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/IMXRT685_RAM_GCC/targetInit/iMXRT685_sfr.h
  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
      uint64_t reservedSpace3:2;
      uint64_t RULE4:2;
      uint64_t reservedSpace4:2;
      uint64_t RULE5:2;
      uint64_t reservedSpace5:2;
      uint64_t RULE6:2;
      uint64_t reservedSpace6:2;
      uint64_t RULE7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAM10_RULE_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
      uint64_t reservedSpace3:2;
      uint64_t RULE4:2;
      uint64_t reservedSpace4:2;
      uint64_t RULE5:2;
      uint64_t reservedSpace5:2;
      uint64_t RULE6:2;
      uint64_t reservedSpace6:2;
      uint64_t RULE7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAM10_RULE_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
      uint64_t reservedSpace3:2;
      uint64_t RULE4:2;
      uint64_t reservedSpace4:2;
      uint64_t RULE5:2;
      uint64_t reservedSpace5:2;
      uint64_t RULE6:2;
      uint64_t reservedSpace6:2;
      uint64_t RULE7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAM11_RULE_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
      uint64_t reservedSpace3:2;
      uint64_t RULE4:2;
      uint64_t reservedSpace4:2;
      uint64_t RULE5:2;
      uint64_t reservedSpace5:2;
      uint64_t RULE6:2;
      uint64_t reservedSpace6:2;
      uint64_t RULE7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAM11_RULE_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
      uint64_t reservedSpace3:2;
      uint64_t RULE4:2;
      uint64_t reservedSpace4:2;
      uint64_t RULE5:2;
      uint64_t reservedSpace5:2;
      uint64_t RULE6:2;
      uint64_t reservedSpace6:2;
      uint64_t RULE7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAM11_RULE_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
      uint64_t reservedSpace3:2;
      uint64_t RULE4:2;
      uint64_t reservedSpace4:2;
      uint64_t RULE5:2;
      uint64_t reservedSpace5:2;
      uint64_t RULE6:2;
      uint64_t reservedSpace6:2;
      uint64_t RULE7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAM11_RULE_3;

  uint8_t res8[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
      uint64_t reservedSpace3:2;
      uint64_t RULE4:2;
      uint64_t reservedSpace4:2;
      uint64_t RULE5:2;
      uint64_t reservedSpace5:2;
      uint64_t RULE6:2;
      uint64_t reservedSpace6:2;
      uint64_t RULE7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAM12_RULE_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
      uint64_t reservedSpace3:2;
      uint64_t RULE4:2;
      uint64_t reservedSpace4:2;
      uint64_t RULE5:2;
      uint64_t reservedSpace5:2;
      uint64_t RULE6:2;
      uint64_t reservedSpace6:2;
      uint64_t RULE7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAM12_RULE_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
      uint64_t reservedSpace3:2;
      uint64_t RULE4:2;
      uint64_t reservedSpace4:2;
      uint64_t RULE5:2;
      uint64_t reservedSpace5:2;
      uint64_t RULE6:2;
      uint64_t reservedSpace6:2;
      uint64_t RULE7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAM12_RULE_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
      uint64_t reservedSpace3:2;
      uint64_t RULE4:2;
      uint64_t reservedSpace4:2;
      uint64_t RULE5:2;
      uint64_t reservedSpace5:2;
      uint64_t RULE6:2;
      uint64_t reservedSpace6:2;
      uint64_t RULE7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAM12_RULE_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
      uint64_t reservedSpace3:2;
      uint64_t RULE4:2;
      uint64_t reservedSpace4:2;
      uint64_t RULE5:2;
      uint64_t reservedSpace5:2;
      uint64_t RULE6:2;
      uint64_t reservedSpace6:2;
      uint64_t RULE7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAM13_RULE_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
      uint64_t reservedSpace3:2;
      uint64_t RULE4:2;
      uint64_t reservedSpace4:2;
      uint64_t RULE5:2;
      uint64_t reservedSpace5:2;
      uint64_t RULE6:2;
      uint64_t reservedSpace6:2;
      uint64_t RULE7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAM13_RULE_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
      uint64_t reservedSpace3:2;
      uint64_t RULE4:2;
      uint64_t reservedSpace4:2;
      uint64_t RULE5:2;
      uint64_t reservedSpace5:2;
      uint64_t RULE6:2;
      uint64_t reservedSpace6:2;
      uint64_t RULE7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAM13_RULE_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
      uint64_t reservedSpace3:2;
      uint64_t RULE4:2;
      uint64_t reservedSpace4:2;
      uint64_t RULE5:2;
      uint64_t reservedSpace5:2;
      uint64_t RULE6:2;
      uint64_t reservedSpace6:2;
      uint64_t RULE7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAM13_RULE_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
      uint64_t reservedSpace3:2;
      uint64_t RULE4:2;
      uint64_t reservedSpace4:2;
      uint64_t RULE5:2;
      uint64_t reservedSpace5:2;
      uint64_t RULE6:2;
      uint64_t reservedSpace6:2;
      uint64_t RULE7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAM14_RULE_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
      uint64_t reservedSpace3:2;
      uint64_t RULE4:2;
      uint64_t reservedSpace4:2;
      uint64_t RULE5:2;
      uint64_t reservedSpace5:2;
      uint64_t RULE6:2;
      uint64_t reservedSpace6:2;
      uint64_t RULE7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAM14_RULE_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
      uint64_t reservedSpace3:2;
      uint64_t RULE4:2;
      uint64_t reservedSpace4:2;
      uint64_t RULE5:2;
      uint64_t reservedSpace5:2;
      uint64_t RULE6:2;
      uint64_t reservedSpace6:2;
      uint64_t RULE7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAM14_RULE_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
      uint64_t reservedSpace3:2;
      uint64_t RULE4:2;
      uint64_t reservedSpace4:2;
      uint64_t RULE5:2;
      uint64_t reservedSpace5:2;
      uint64_t RULE6:2;
      uint64_t reservedSpace6:2;
      uint64_t RULE7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAM14_RULE_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
      uint64_t reservedSpace3:2;
      uint64_t RULE4:2;
      uint64_t reservedSpace4:2;
      uint64_t RULE5:2;
      uint64_t reservedSpace5:2;
      uint64_t RULE6:2;
      uint64_t reservedSpace6:2;
      uint64_t RULE7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAM15_RULE_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
      uint64_t reservedSpace3:2;
      uint64_t RULE4:2;
      uint64_t reservedSpace4:2;
      uint64_t RULE5:2;
      uint64_t reservedSpace5:2;
      uint64_t RULE6:2;
      uint64_t reservedSpace6:2;
      uint64_t RULE7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAM15_RULE_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
      uint64_t reservedSpace3:2;
      uint64_t RULE4:2;
      uint64_t reservedSpace4:2;
      uint64_t RULE5:2;
      uint64_t reservedSpace5:2;
      uint64_t RULE6:2;
      uint64_t reservedSpace6:2;
      uint64_t RULE7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAM15_RULE_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
      uint64_t reservedSpace3:2;
      uint64_t RULE4:2;
      uint64_t reservedSpace4:2;
      uint64_t RULE5:2;
      uint64_t reservedSpace5:2;
      uint64_t RULE6:2;
      uint64_t reservedSpace6:2;
      uint64_t RULE7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAM15_RULE_3;

  uint8_t res9[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
      uint64_t reservedSpace3:2;
      uint64_t RULE4:2;
      uint64_t reservedSpace4:2;
      uint64_t RULE5:2;
      uint64_t reservedSpace5:2;
      uint64_t RULE6:2;
      uint64_t reservedSpace6:2;
      uint64_t RULE7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAM16_RULE_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
      uint64_t reservedSpace3:2;
      uint64_t RULE4:2;
      uint64_t reservedSpace4:2;
      uint64_t RULE5:2;
      uint64_t reservedSpace5:2;
      uint64_t RULE6:2;
      uint64_t reservedSpace6:2;
      uint64_t RULE7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAM16_RULE_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
      uint64_t reservedSpace3:2;
      uint64_t RULE4:2;
      uint64_t reservedSpace4:2;
      uint64_t RULE5:2;
      uint64_t reservedSpace5:2;
      uint64_t RULE6:2;
      uint64_t reservedSpace6:2;
      uint64_t RULE7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAM16_RULE_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
      uint64_t reservedSpace3:2;
      uint64_t RULE4:2;
      uint64_t reservedSpace4:2;
      uint64_t RULE5:2;
      uint64_t reservedSpace5:2;
      uint64_t RULE6:2;
      uint64_t reservedSpace6:2;
      uint64_t RULE7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAM16_RULE_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
      uint64_t reservedSpace3:2;
      uint64_t RULE4:2;
      uint64_t reservedSpace4:2;
      uint64_t RULE5:2;
      uint64_t reservedSpace5:2;
      uint64_t RULE6:2;
      uint64_t reservedSpace6:2;
      uint64_t RULE7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAM17_RULE_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
      uint64_t reservedSpace3:2;
      uint64_t RULE4:2;
      uint64_t reservedSpace4:2;
      uint64_t RULE5:2;
      uint64_t reservedSpace5:2;
      uint64_t RULE6:2;
      uint64_t reservedSpace6:2;
      uint64_t RULE7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAM17_RULE_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
      uint64_t reservedSpace3:2;
      uint64_t RULE4:2;
      uint64_t reservedSpace4:2;
      uint64_t RULE5:2;
      uint64_t reservedSpace5:2;
      uint64_t RULE6:2;
      uint64_t reservedSpace6:2;
      uint64_t RULE7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAM17_RULE_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
      uint64_t reservedSpace3:2;
      uint64_t RULE4:2;
      uint64_t reservedSpace4:2;
      uint64_t RULE5:2;
      uint64_t reservedSpace5:2;
      uint64_t RULE6:2;
      uint64_t reservedSpace6:2;
      uint64_t RULE7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAM17_RULE_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
      uint64_t reservedSpace3:2;
      uint64_t RULE4:2;
      uint64_t reservedSpace4:2;
      uint64_t RULE5:2;
      uint64_t reservedSpace5:2;
      uint64_t RULE6:2;
      uint64_t reservedSpace6:2;
      uint64_t RULE7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAM18_RULE_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
      uint64_t reservedSpace3:2;
      uint64_t RULE4:2;
      uint64_t reservedSpace4:2;
      uint64_t RULE5:2;
      uint64_t reservedSpace5:2;
      uint64_t RULE6:2;
      uint64_t reservedSpace6:2;
      uint64_t RULE7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAM18_RULE_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
      uint64_t reservedSpace3:2;
      uint64_t RULE4:2;
      uint64_t reservedSpace4:2;
      uint64_t RULE5:2;
      uint64_t reservedSpace5:2;
      uint64_t RULE6:2;
      uint64_t reservedSpace6:2;
      uint64_t RULE7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAM18_RULE_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
      uint64_t reservedSpace3:2;
      uint64_t RULE4:2;
      uint64_t reservedSpace4:2;
      uint64_t RULE5:2;
      uint64_t reservedSpace5:2;
      uint64_t RULE6:2;
      uint64_t reservedSpace6:2;
      uint64_t RULE7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAM18_RULE_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
      uint64_t reservedSpace3:2;
      uint64_t RULE4:2;
      uint64_t reservedSpace4:2;
      uint64_t RULE5:2;
      uint64_t reservedSpace5:2;
      uint64_t RULE6:2;
      uint64_t reservedSpace6:2;
      uint64_t RULE7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAM19_RULE_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
      uint64_t reservedSpace3:2;
      uint64_t RULE4:2;
      uint64_t reservedSpace4:2;
      uint64_t RULE5:2;
      uint64_t reservedSpace5:2;
      uint64_t RULE6:2;
      uint64_t reservedSpace6:2;
      uint64_t RULE7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAM19_RULE_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
      uint64_t reservedSpace3:2;
      uint64_t RULE4:2;
      uint64_t reservedSpace4:2;
      uint64_t RULE5:2;
      uint64_t reservedSpace5:2;
      uint64_t RULE6:2;
      uint64_t reservedSpace6:2;
      uint64_t RULE7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAM19_RULE_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
      uint64_t reservedSpace3:2;
      uint64_t RULE4:2;
      uint64_t reservedSpace4:2;
      uint64_t RULE5:2;
      uint64_t reservedSpace5:2;
      uint64_t RULE6:2;
      uint64_t reservedSpace6:2;
      uint64_t RULE7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAM19_RULE_3;

  uint8_t res10[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
      uint64_t reservedSpace3:2;
      uint64_t RULE4:2;
      uint64_t reservedSpace4:2;
      uint64_t RULE5:2;
      uint64_t reservedSpace5:2;
      uint64_t RULE6:2;
      uint64_t reservedSpace6:2;
      uint64_t RULE7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAM20_RULE_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
      uint64_t reservedSpace3:2;
      uint64_t RULE4:2;
      uint64_t reservedSpace4:2;
      uint64_t RULE5:2;
      uint64_t reservedSpace5:2;
      uint64_t RULE6:2;
      uint64_t reservedSpace6:2;
      uint64_t RULE7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAM20_RULE_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
      uint64_t reservedSpace3:2;
      uint64_t RULE4:2;
      uint64_t reservedSpace4:2;
      uint64_t RULE5:2;
      uint64_t reservedSpace5:2;
      uint64_t RULE6:2;
      uint64_t reservedSpace6:2;
      uint64_t RULE7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAM20_RULE_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
      uint64_t reservedSpace3:2;
      uint64_t RULE4:2;
      uint64_t reservedSpace4:2;
      uint64_t RULE5:2;
      uint64_t reservedSpace5:2;
      uint64_t RULE6:2;
      uint64_t reservedSpace6:2;
      uint64_t RULE7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAM20_RULE_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
      uint64_t reservedSpace3:2;
      uint64_t RULE4:2;
      uint64_t reservedSpace4:2;
      uint64_t RULE5:2;
      uint64_t reservedSpace5:2;
      uint64_t RULE6:2;
      uint64_t reservedSpace6:2;
      uint64_t RULE7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAM21_RULE_0;

