iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/IMXRT685_RAM_GCC/targetInit/iMXRT685_sfr.h
  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
      uint64_t reservedSpace3:2;
      uint64_t RULE4:2;
      uint64_t reservedSpace4:2;
      uint64_t RULE5:2;
      uint64_t reservedSpace5:2;
      uint64_t RULE6:2;
      uint64_t reservedSpace6:2;
      uint64_t RULE7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAM21_RULE_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
      uint64_t reservedSpace3:2;
      uint64_t RULE4:2;
      uint64_t reservedSpace4:2;
      uint64_t RULE5:2;
      uint64_t reservedSpace5:2;
      uint64_t RULE6:2;
      uint64_t reservedSpace6:2;
      uint64_t RULE7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAM21_RULE_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
      uint64_t reservedSpace3:2;
      uint64_t RULE4:2;
      uint64_t reservedSpace4:2;
      uint64_t RULE5:2;
      uint64_t reservedSpace5:2;
      uint64_t RULE6:2;
      uint64_t reservedSpace6:2;
      uint64_t RULE7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAM21_RULE_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
      uint64_t reservedSpace3:2;
      uint64_t RULE4:2;
      uint64_t reservedSpace4:2;
      uint64_t RULE5:2;
      uint64_t reservedSpace5:2;
      uint64_t RULE6:2;
      uint64_t reservedSpace6:2;
      uint64_t RULE7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAM22_RULE_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
      uint64_t reservedSpace3:2;
      uint64_t RULE4:2;
      uint64_t reservedSpace4:2;
      uint64_t RULE5:2;
      uint64_t reservedSpace5:2;
      uint64_t RULE6:2;
      uint64_t reservedSpace6:2;
      uint64_t RULE7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAM22_RULE_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
      uint64_t reservedSpace3:2;
      uint64_t RULE4:2;
      uint64_t reservedSpace4:2;
      uint64_t RULE5:2;
      uint64_t reservedSpace5:2;
      uint64_t RULE6:2;
      uint64_t reservedSpace6:2;
      uint64_t RULE7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAM22_RULE_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
      uint64_t reservedSpace3:2;
      uint64_t RULE4:2;
      uint64_t reservedSpace4:2;
      uint64_t RULE5:2;
      uint64_t reservedSpace5:2;
      uint64_t RULE6:2;
      uint64_t reservedSpace6:2;
      uint64_t RULE7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAM22_RULE_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
      uint64_t reservedSpace3:2;
      uint64_t RULE4:2;
      uint64_t reservedSpace4:2;
      uint64_t RULE5:2;
      uint64_t reservedSpace5:2;
      uint64_t RULE6:2;
      uint64_t reservedSpace6:2;
      uint64_t RULE7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAM23_RULE_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
      uint64_t reservedSpace3:2;
      uint64_t RULE4:2;
      uint64_t reservedSpace4:2;
      uint64_t RULE5:2;
      uint64_t reservedSpace5:2;
      uint64_t RULE6:2;
      uint64_t reservedSpace6:2;
      uint64_t RULE7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAM23_RULE_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
      uint64_t reservedSpace3:2;
      uint64_t RULE4:2;
      uint64_t reservedSpace4:2;
      uint64_t RULE5:2;
      uint64_t reservedSpace5:2;
      uint64_t RULE6:2;
      uint64_t reservedSpace6:2;
      uint64_t RULE7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAM23_RULE_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
      uint64_t reservedSpace3:2;
      uint64_t RULE4:2;
      uint64_t reservedSpace4:2;
      uint64_t RULE5:2;
      uint64_t reservedSpace5:2;
      uint64_t RULE6:2;
      uint64_t reservedSpace6:2;
      uint64_t RULE7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAM23_RULE_3;

  uint8_t res11[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
      uint64_t reservedSpace3:2;
      uint64_t RULE4:2;
      uint64_t reservedSpace4:2;
      uint64_t RULE5:2;
      uint64_t reservedSpace5:2;
      uint64_t RULE6:2;
      uint64_t reservedSpace6:2;
      uint64_t RULE7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAM24_RULE_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
      uint64_t reservedSpace3:2;
      uint64_t RULE4:2;
      uint64_t reservedSpace4:2;
      uint64_t RULE5:2;
      uint64_t reservedSpace5:2;
      uint64_t RULE6:2;
      uint64_t reservedSpace6:2;
      uint64_t RULE7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAM24_RULE_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
      uint64_t reservedSpace3:2;
      uint64_t RULE4:2;
      uint64_t reservedSpace4:2;
      uint64_t RULE5:2;
      uint64_t reservedSpace5:2;
      uint64_t RULE6:2;
      uint64_t reservedSpace6:2;
      uint64_t RULE7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAM24_RULE_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
      uint64_t reservedSpace3:2;
      uint64_t RULE4:2;
      uint64_t reservedSpace4:2;
      uint64_t RULE5:2;
      uint64_t reservedSpace5:2;
      uint64_t RULE6:2;
      uint64_t reservedSpace6:2;
      uint64_t RULE7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAM24_RULE_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
      uint64_t reservedSpace3:2;
      uint64_t RULE4:2;
      uint64_t reservedSpace4:2;
      uint64_t RULE5:2;
      uint64_t reservedSpace5:2;
      uint64_t RULE6:2;
      uint64_t reservedSpace6:2;
      uint64_t RULE7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAM25_RULE_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
      uint64_t reservedSpace3:2;
      uint64_t RULE4:2;
      uint64_t reservedSpace4:2;
      uint64_t RULE5:2;
      uint64_t reservedSpace5:2;
      uint64_t RULE6:2;
      uint64_t reservedSpace6:2;
      uint64_t RULE7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAM25_RULE_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
      uint64_t reservedSpace3:2;
      uint64_t RULE4:2;
      uint64_t reservedSpace4:2;
      uint64_t RULE5:2;
      uint64_t reservedSpace5:2;
      uint64_t RULE6:2;
      uint64_t reservedSpace6:2;
      uint64_t RULE7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAM25_RULE_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
      uint64_t reservedSpace3:2;
      uint64_t RULE4:2;
      uint64_t reservedSpace4:2;
      uint64_t RULE5:2;
      uint64_t reservedSpace5:2;
      uint64_t RULE6:2;
      uint64_t reservedSpace6:2;
      uint64_t RULE7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAM25_RULE_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
      uint64_t reservedSpace3:2;
      uint64_t RULE4:2;
      uint64_t reservedSpace4:2;
      uint64_t RULE5:2;
      uint64_t reservedSpace5:2;
      uint64_t RULE6:2;
      uint64_t reservedSpace6:2;
      uint64_t RULE7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAM26_RULE_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
      uint64_t reservedSpace3:2;
      uint64_t RULE4:2;
      uint64_t reservedSpace4:2;
      uint64_t RULE5:2;
      uint64_t reservedSpace5:2;
      uint64_t RULE6:2;
      uint64_t reservedSpace6:2;
      uint64_t RULE7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAM26_RULE_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
      uint64_t reservedSpace3:2;
      uint64_t RULE4:2;
      uint64_t reservedSpace4:2;
      uint64_t RULE5:2;
      uint64_t reservedSpace5:2;
      uint64_t RULE6:2;
      uint64_t reservedSpace6:2;
      uint64_t RULE7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAM26_RULE_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
      uint64_t reservedSpace3:2;
      uint64_t RULE4:2;
      uint64_t reservedSpace4:2;
      uint64_t RULE5:2;
      uint64_t reservedSpace5:2;
      uint64_t RULE6:2;
      uint64_t reservedSpace6:2;
      uint64_t RULE7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAM26_RULE_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
      uint64_t reservedSpace3:2;
      uint64_t RULE4:2;
      uint64_t reservedSpace4:2;
      uint64_t RULE5:2;
      uint64_t reservedSpace5:2;
      uint64_t RULE6:2;
      uint64_t reservedSpace6:2;
      uint64_t RULE7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAM27_RULE_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
      uint64_t reservedSpace3:2;
      uint64_t RULE4:2;
      uint64_t reservedSpace4:2;
      uint64_t RULE5:2;
      uint64_t reservedSpace5:2;
      uint64_t RULE6:2;
      uint64_t reservedSpace6:2;
      uint64_t RULE7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAM27_RULE_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
      uint64_t reservedSpace3:2;
      uint64_t RULE4:2;
      uint64_t reservedSpace4:2;
      uint64_t RULE5:2;
      uint64_t reservedSpace5:2;
      uint64_t RULE6:2;
      uint64_t reservedSpace6:2;
      uint64_t RULE7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAM27_RULE_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
      uint64_t reservedSpace3:2;
      uint64_t RULE4:2;
      uint64_t reservedSpace4:2;
      uint64_t RULE5:2;
      uint64_t reservedSpace5:2;
      uint64_t RULE6:2;
      uint64_t reservedSpace6:2;
      uint64_t RULE7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAM27_RULE_3;

