iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/IMXRT685_RAM_GCC/targetInit/iMXRT685_sfr.h
  uint8_t res12[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
      uint64_t reservedSpace3:2;
      uint64_t RULE4:2;
      uint64_t reservedSpace4:2;
      uint64_t RULE5:2;
      uint64_t reservedSpace5:2;
      uint64_t RULE6:2;
      uint64_t reservedSpace6:2;
      uint64_t RULE7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAM28_RULE_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
      uint64_t reservedSpace3:2;
      uint64_t RULE4:2;
      uint64_t reservedSpace4:2;
      uint64_t RULE5:2;
      uint64_t reservedSpace5:2;
      uint64_t RULE6:2;
      uint64_t reservedSpace6:2;
      uint64_t RULE7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAM28_RULE_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
      uint64_t reservedSpace3:2;
      uint64_t RULE4:2;
      uint64_t reservedSpace4:2;
      uint64_t RULE5:2;
      uint64_t reservedSpace5:2;
      uint64_t RULE6:2;
      uint64_t reservedSpace6:2;
      uint64_t RULE7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAM28_RULE_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
      uint64_t reservedSpace3:2;
      uint64_t RULE4:2;
      uint64_t reservedSpace4:2;
      uint64_t RULE5:2;
      uint64_t reservedSpace5:2;
      uint64_t RULE6:2;
      uint64_t reservedSpace6:2;
      uint64_t RULE7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAM28_RULE_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
      uint64_t reservedSpace3:2;
      uint64_t RULE4:2;
      uint64_t reservedSpace4:2;
      uint64_t RULE5:2;
      uint64_t reservedSpace5:2;
      uint64_t RULE6:2;
      uint64_t reservedSpace6:2;
      uint64_t RULE7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAM29_RULE_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
      uint64_t reservedSpace3:2;
      uint64_t RULE4:2;
      uint64_t reservedSpace4:2;
      uint64_t RULE5:2;
      uint64_t reservedSpace5:2;
      uint64_t RULE6:2;
      uint64_t reservedSpace6:2;
      uint64_t RULE7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAM29_RULE_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
      uint64_t reservedSpace3:2;
      uint64_t RULE4:2;
      uint64_t reservedSpace4:2;
      uint64_t RULE5:2;
      uint64_t reservedSpace5:2;
      uint64_t RULE6:2;
      uint64_t reservedSpace6:2;
      uint64_t RULE7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAM29_RULE_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
      uint64_t reservedSpace3:2;
      uint64_t RULE4:2;
      uint64_t reservedSpace4:2;
      uint64_t RULE5:2;
      uint64_t reservedSpace5:2;
      uint64_t RULE6:2;
      uint64_t reservedSpace6:2;
      uint64_t RULE7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAM29_RULE_3;

  uint8_t res13[48];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:10;
      uint64_t RULE4:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE5:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) pif_hifi4_x_mem_rule0;

  uint8_t res14[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RSTCTL0_RULE:2;
      uint64_t reservedSpace0:2;
      uint64_t CLKCTL0_RULE:2;
      uint64_t reservedSpace1:2;
      uint64_t SYSCTL0_RULE:2;
      uint64_t reservedSpace2:6;
      uint64_t IOPCTL_RULE:2;
      uint64_t reservedSpace3:6;
      uint64_t PUFCTRL_RULE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) apb_grp0_mem_rule0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t WWDT0_RULE:2;
      uint64_t reservedSpace1:2;
      uint64_t UTICK_RULE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) apb_grp0_mem_rule1;

  uint8_t res15[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RSTCTL1_RULE:2;
      uint64_t reservedSpace0:2;
      uint64_t CLKCTL1_RULE:2;
      uint64_t reservedSpace1:2;
      uint64_t SYSCTL1_RULE:2;
      uint64_t reservedSpace2:10;
      uint64_t GPIO_INTR_CTRL_RULE:2;
      uint64_t reservedSpace3:2;
      uint64_t PERIPH_INPUT_MUX_RULE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) apb_grp1_mem_rule0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CT32BIT0_RULE:2;
      uint64_t reservedSpace0:2;
      uint64_t CT32BIT1_RULE:2;
      uint64_t reservedSpace1:2;
      uint64_t CT32BIT2_RULE:2;
      uint64_t reservedSpace2:2;
      uint64_t CT32BIT3_RULE:2;
      uint64_t reservedSpace3:2;
      uint64_t CT32BIT4_RULE:2;
      uint64_t reservedSpace4:2;
      uint64_t MRT_RULE:2;
      uint64_t reservedSpace5:2;
      uint64_t WWDT1_RULE:2;
      uint64_t reservedSpace6:2;
      uint64_t FREQME_RULE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) apb_grp1_mem_rule1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RTC_RULE:2;
      uint64_t reservedSpace0:22;
      uint64_t I3C0_RULE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) apb_grp1_mem_rule2;

  uint8_t res16[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HSGPIO_RULE:2;
      uint64_t reservedSpace0:2;
      uint64_t DMA0_RULE:2;
      uint64_t reservedSpace1:2;
      uint64_t DMA1_RULE:2;
      uint64_t reservedSpace2:2;
      uint64_t FLEXCOMM0_RULE:2;
      uint64_t reservedSpace3:2;
      uint64_t FLEXCOMM1_RULE:2;
      uint64_t reservedSpace4:2;
      uint64_t FLEXCOMM2_RULE:2;
      uint64_t reservedSpace5:2;
      uint64_t FLEXCOMM3_RULE:2;
      uint64_t reservedSpace6:2;
      uint64_t DEBUG_MAILBOX_RULE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ahb_periph0_slave_rule0;

  uint8_t res17[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MU0_M33_RULE:2;
      uint64_t reservedSpace0:2;
      uint64_t MU0_DSP_RULE:2;
      uint64_t reservedSpace1:2;
      uint64_t SEMAPHORE_RULE:2;
      uint64_t reservedSpace2:2;
      uint64_t OS_EVENT_TIMER_M33_RULE:2;
      uint64_t reservedSpace3:2;
      uint64_t OS_EVENT_TIMER_DSP_RULE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) aips_bridge0_mem_rule0;

  uint8_t res18[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRC_RULE:2;
      uint64_t reservedSpace0:2;
      uint64_t DMIC_RULE:2;
      uint64_t reservedSpace1:2;
      uint64_t FLEXCOMM4_RULE:2;
      uint64_t reservedSpace2:2;
      uint64_t FLEXCOMM5_RULE:2;
      uint64_t reservedSpace3:2;
      uint64_t FLEXCOMM6_RULE:2;
      uint64_t reservedSpace4:2;
      uint64_t FLEXCOMM7_RULE:2;
      uint64_t reservedSpace5:2;
      uint64_t FLEXCOMM14_RULE:2;
      uint64_t reservedSpace6:2;
      uint64_t FLEXCOMM15_RULE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ahb_periph1_slave_rule0;

  uint8_t res19[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OTP_RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t OTP_RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t OTP_RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t OTP_RULE3:2;
      uint64_t reservedSpace3:2;
      uint64_t FLEXSPI_AND_OTFAD_RULE:2;
      uint64_t reservedSpace4:6;
      uint64_t SDIO0_RULE:2;
      uint64_t reservedSpace5:2;
      uint64_t SDIO1_RULE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) aips_bridge1_mem_rule0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RNG_RULE:2;
      uint64_t reservedSpace0:2;
      uint64_t ACMP0_RULE:2;
      uint64_t reservedSpace1:2;
      uint64_t ADC0_RULE:2;
      uint64_t reservedSpace2:2;
      uint64_t USB_HS_PHY_RULE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) aips_bridge1_mem_rule1;

  uint8_t res20[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t USB_HS_RAM_RULE:2;
      uint64_t reservedSpace0:2;
      uint64_t USB_HS_DEV_RULE:2;
      uint64_t reservedSpace1:2;
      uint64_t USB_HS_HOST_RULE:2;
      uint64_t reservedSpace2:2;
      uint64_t SCT_RULE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ahb_periph2_slave_rule0;

  uint8_t res21[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RULE0:2;
      uint64_t reservedSpace0:2;
      uint64_t RULE1:2;
      uint64_t reservedSpace1:2;
      uint64_t RULE2:2;
      uint64_t reservedSpace2:2;
      uint64_t RULE3:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) security_ctrl_mem_rule0;

  uint8_t res22[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PQ_COPRO_RULE:2;
      uint64_t reservedSpace0:2;
      uint64_t CASPER_COPRO_RULE:2;
      uint64_t reservedSpace1:2;
      uint64_t CASPER_RAM_RULE:2;
      uint64_t reservedSpace2:2;
      uint64_t SECURE_GPIO_RULE:2;
      uint64_t reservedSpace3:2;
      uint64_t HASH_RULE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ahb_periph3_slave_rule0;

  uint8_t res23[2604];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEC_VIO_ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) sec_vio_addr_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEC_VIO_ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) sec_vio_addr_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEC_VIO_ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) sec_vio_addr_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEC_VIO_ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) sec_vio_addr_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEC_VIO_ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) sec_vio_addr_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEC_VIO_ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) sec_vio_addr_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEC_VIO_ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) sec_vio_addr_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEC_VIO_ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) sec_vio_addr_7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEC_VIO_ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) sec_vio_addr_8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEC_VIO_ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) sec_vio_addr_9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEC_VIO_ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) sec_vio_addr_10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEC_VIO_ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) sec_vio_addr_11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEC_VIO_ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) sec_vio_addr_12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEC_VIO_ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) sec_vio_addr_13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEC_VIO_ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) sec_vio_addr_14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEC_VIO_ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) sec_vio_addr_15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEC_VIO_ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) sec_vio_addr_16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEC_VIO_ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) sec_vio_addr_17;

  uint8_t res24[56];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEC_VIO_INFO_WRITE:1;
      uint64_t SEC_VIO_INFO_DATA_ACCESS:1;
      uint64_t reservedSpace0:2;
      uint64_t SEC_VIO_INFO_MASTER_SEC_LEVEL:4;
      uint64_t SEC_VIO_INFO_MASTER:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) sec_vio_misc_info_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEC_VIO_INFO_WRITE:1;
      uint64_t SEC_VIO_INFO_DATA_ACCESS:1;
      uint64_t reservedSpace0:2;
      uint64_t SEC_VIO_INFO_MASTER_SEC_LEVEL:4;
      uint64_t SEC_VIO_INFO_MASTER:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) sec_vio_misc_info_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEC_VIO_INFO_WRITE:1;
      uint64_t SEC_VIO_INFO_DATA_ACCESS:1;
      uint64_t reservedSpace0:2;
      uint64_t SEC_VIO_INFO_MASTER_SEC_LEVEL:4;
      uint64_t SEC_VIO_INFO_MASTER:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) sec_vio_misc_info_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEC_VIO_INFO_WRITE:1;
      uint64_t SEC_VIO_INFO_DATA_ACCESS:1;
      uint64_t reservedSpace0:2;
      uint64_t SEC_VIO_INFO_MASTER_SEC_LEVEL:4;
      uint64_t SEC_VIO_INFO_MASTER:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) sec_vio_misc_info_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEC_VIO_INFO_WRITE:1;
      uint64_t SEC_VIO_INFO_DATA_ACCESS:1;
      uint64_t reservedSpace0:2;
      uint64_t SEC_VIO_INFO_MASTER_SEC_LEVEL:4;
      uint64_t SEC_VIO_INFO_MASTER:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) sec_vio_misc_info_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEC_VIO_INFO_WRITE:1;
      uint64_t SEC_VIO_INFO_DATA_ACCESS:1;
      uint64_t reservedSpace0:2;
      uint64_t SEC_VIO_INFO_MASTER_SEC_LEVEL:4;
      uint64_t SEC_VIO_INFO_MASTER:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) sec_vio_misc_info_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEC_VIO_INFO_WRITE:1;
      uint64_t SEC_VIO_INFO_DATA_ACCESS:1;
      uint64_t reservedSpace0:2;
      uint64_t SEC_VIO_INFO_MASTER_SEC_LEVEL:4;
      uint64_t SEC_VIO_INFO_MASTER:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) sec_vio_misc_info_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEC_VIO_INFO_WRITE:1;
      uint64_t SEC_VIO_INFO_DATA_ACCESS:1;
      uint64_t reservedSpace0:2;
      uint64_t SEC_VIO_INFO_MASTER_SEC_LEVEL:4;
      uint64_t SEC_VIO_INFO_MASTER:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) sec_vio_misc_info_7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEC_VIO_INFO_WRITE:1;
      uint64_t SEC_VIO_INFO_DATA_ACCESS:1;
      uint64_t reservedSpace0:2;
      uint64_t SEC_VIO_INFO_MASTER_SEC_LEVEL:4;
      uint64_t SEC_VIO_INFO_MASTER:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) sec_vio_misc_info_8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEC_VIO_INFO_WRITE:1;
      uint64_t SEC_VIO_INFO_DATA_ACCESS:1;
      uint64_t reservedSpace0:2;
      uint64_t SEC_VIO_INFO_MASTER_SEC_LEVEL:4;
      uint64_t SEC_VIO_INFO_MASTER:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) sec_vio_misc_info_9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEC_VIO_INFO_WRITE:1;
      uint64_t SEC_VIO_INFO_DATA_ACCESS:1;
      uint64_t reservedSpace0:2;
      uint64_t SEC_VIO_INFO_MASTER_SEC_LEVEL:4;
      uint64_t SEC_VIO_INFO_MASTER:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) sec_vio_misc_info_10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEC_VIO_INFO_WRITE:1;
      uint64_t SEC_VIO_INFO_DATA_ACCESS:1;
      uint64_t reservedSpace0:2;
      uint64_t SEC_VIO_INFO_MASTER_SEC_LEVEL:4;
      uint64_t SEC_VIO_INFO_MASTER:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) sec_vio_misc_info_11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEC_VIO_INFO_WRITE:1;
      uint64_t SEC_VIO_INFO_DATA_ACCESS:1;
      uint64_t reservedSpace0:2;
      uint64_t SEC_VIO_INFO_MASTER_SEC_LEVEL:4;
      uint64_t SEC_VIO_INFO_MASTER:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) sec_vio_misc_info_12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEC_VIO_INFO_WRITE:1;
      uint64_t SEC_VIO_INFO_DATA_ACCESS:1;
      uint64_t reservedSpace0:2;
      uint64_t SEC_VIO_INFO_MASTER_SEC_LEVEL:4;
      uint64_t SEC_VIO_INFO_MASTER:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) sec_vio_misc_info_13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEC_VIO_INFO_WRITE:1;
      uint64_t SEC_VIO_INFO_DATA_ACCESS:1;
      uint64_t reservedSpace0:2;
      uint64_t SEC_VIO_INFO_MASTER_SEC_LEVEL:4;
      uint64_t SEC_VIO_INFO_MASTER:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) sec_vio_misc_info_14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEC_VIO_INFO_WRITE:1;
      uint64_t SEC_VIO_INFO_DATA_ACCESS:1;
      uint64_t reservedSpace0:2;
      uint64_t SEC_VIO_INFO_MASTER_SEC_LEVEL:4;
      uint64_t SEC_VIO_INFO_MASTER:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) sec_vio_misc_info_15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEC_VIO_INFO_WRITE:1;
      uint64_t SEC_VIO_INFO_DATA_ACCESS:1;
      uint64_t reservedSpace0:2;
      uint64_t SEC_VIO_INFO_MASTER_SEC_LEVEL:4;
      uint64_t SEC_VIO_INFO_MASTER:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) sec_vio_misc_info_16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEC_VIO_INFO_WRITE:1;
      uint64_t SEC_VIO_INFO_DATA_ACCESS:1;
      uint64_t reservedSpace0:2;
      uint64_t SEC_VIO_INFO_MASTER_SEC_LEVEL:4;
      uint64_t SEC_VIO_INFO_MASTER:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) sec_vio_misc_info_17;

  uint8_t res25[56];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VIO_INFO_VALID0:1;
      uint64_t VIO_INFO_VALID1:1;
      uint64_t VIO_INFO_VALID2:1;
      uint64_t VIO_INFO_VALID3:1;
      uint64_t VIO_INFO_VALID4:1;
      uint64_t VIO_INFO_VALID5:1;
      uint64_t VIO_INFO_VALID6:1;
      uint64_t VIO_INFO_VALID7:1;
      uint64_t VIO_INFO_VALID8:1;
      uint64_t VIO_INFO_VALID9:1;
      uint64_t VIO_INFO_VALID10:1;
      uint64_t VIO_INFO_VALID11:1;
      uint64_t VIO_INFO_VALID12:1;
      uint64_t VIO_INFO_VALID13:1;
      uint64_t VIO_INFO_VALID14:1;
      uint64_t VIO_INFO_VALID15:1;
      uint64_t VIO_INFO_VALID16:1;
      uint64_t VIO_INFO_VALID17:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEC_VIO_INFO_VALID;

