iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/IMXRT685_RAM_GCC/targetInit/iMXRT685_sfr.h
  uint8_t res26[124];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PIO0_PIN0_SEC_MASK:1;
      uint64_t PIO0_PIN1_SEC_MASK:1;
      uint64_t PIO0_PIN2_SEC_MASK:1;
      uint64_t PIO0_PIN3_SEC_MASK:1;
      uint64_t PIO0_PIN4_SEC_MASK:1;
      uint64_t PIO0_PIN5_SEC_MASK:1;
      uint64_t PIO0_PIN6_SEC_MASK:1;
      uint64_t PIO0_PIN7_SEC_MASK:1;
      uint64_t PIO0_PIN8_SEC_MASK:1;
      uint64_t PIO0_PIN9_SEC_MASK:1;
      uint64_t PIO0_PIN10_SEC_MASK:1;
      uint64_t PIO0_PIN11_SEC_MASK:1;
      uint64_t PIO0_PIN12_SEC_MASK:1;
      uint64_t PIO0_PIN13_SEC_MASK:1;
      uint64_t PIO0_PIN14_SEC_MASK:1;
      uint64_t PIO0_PIN15_SEC_MASK:1;
      uint64_t PIO0_PIN16_SEC_MASK:1;
      uint64_t PIO0_PIN17_SEC_MASK:1;
      uint64_t PIO0_PIN18_SEC_MASK:1;
      uint64_t PIO0_PIN19_SEC_MASK:1;
      uint64_t PIO0_PIN20_SEC_MASK:1;
      uint64_t PIO0_PIN21_SEC_MASK:1;
      uint64_t PIO0_PIN22_SEC_MASK:1;
      uint64_t PIO0_PIN23_SEC_MASK:1;
      uint64_t PIO0_PIN24_SEC_MASK:1;
      uint64_t PIO0_PIN25_SEC_MASK:1;
      uint64_t PIO0_PIN26_SEC_MASK:1;
      uint64_t PIO0_PIN27_SEC_MASK:1;
      uint64_t PIO0_PIN28_SEC_MASK:1;
      uint64_t PIO0_PIN29_SEC_MASK:1;
      uint64_t PIO0_PIN30_SEC_MASK:1;
      uint64_t PIO0_PIN31_SEC_MASK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEC_GPIO_MASK0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PIO1_PIN0_SEC_MASK:1;
      uint64_t PIO1_PIN1_SEC_MASK:1;
      uint64_t PIO1_PIN2_SEC_MASK:1;
      uint64_t PIO1_PIN3_SEC_MASK:1;
      uint64_t PIO1_PIN4_SEC_MASK:1;
      uint64_t PIO1_PIN5_SEC_MASK:1;
      uint64_t PIO1_PIN6_SEC_MASK:1;
      uint64_t PIO1_PIN7_SEC_MASK:1;
      uint64_t PIO1_PIN8_SEC_MASK:1;
      uint64_t PIO1_PIN9_SEC_MASK:1;
      uint64_t PIO1_PIN10_SEC_MASK:1;
      uint64_t PIO1_PIN11_SEC_MASK:1;
      uint64_t PIO1_PIN12_SEC_MASK:1;
      uint64_t PIO1_PIN13_SEC_MASK:1;
      uint64_t PIO1_PIN14_SEC_MASK:1;
      uint64_t PIO1_PIN15_SEC_MASK:1;
      uint64_t PIO1_PIN16_SEC_MASK:1;
      uint64_t PIO1_PIN17_SEC_MASK:1;
      uint64_t PIO1_PIN18_SEC_MASK:1;
      uint64_t PIO1_PIN19_SEC_MASK:1;
      uint64_t PIO1_PIN20_SEC_MASK:1;
      uint64_t PIO1_PIN21_SEC_MASK:1;
      uint64_t PIO1_PIN22_SEC_MASK:1;
      uint64_t PIO1_PIN23_SEC_MASK:1;
      uint64_t PIO1_PIN24_SEC_MASK:1;
      uint64_t PIO1_PIN25_SEC_MASK:1;
      uint64_t PIO1_PIN26_SEC_MASK:1;
      uint64_t PIO1_PIN27_SEC_MASK:1;
      uint64_t PIO1_PIN28_SEC_MASK:1;
      uint64_t PIO1_PIN29_SEC_MASK:1;
      uint64_t PIO1_PIN30_SEC_MASK:1;
      uint64_t PIO1_PIN31_SEC_MASK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEC_GPIO_MASK1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PIO2_PIN0_SEC_MASK:1;
      uint64_t PIO2_PIN1_SEC_MASK:1;
      uint64_t PIO2_PIN2_SEC_MASK:1;
      uint64_t PIO2_PIN3_SEC_MASK:1;
      uint64_t PIO2_PIN4_SEC_MASK:1;
      uint64_t PIO2_PIN5_SEC_MASK:1;
      uint64_t PIO2_PIN6_SEC_MASK:1;
      uint64_t PIO2_PIN7_SEC_MASK:1;
      uint64_t PIO2_PIN8_SEC_MASK:1;
      uint64_t PIO2_PIN9_SEC_MASK:1;
      uint64_t PIO2_PIN10_SEC_MASK:1;
      uint64_t PIO2_PIN11_SEC_MASK:1;
      uint64_t PIO2_PIN12_SEC_MASK:1;
      uint64_t PIO2_PIN13_SEC_MASK:1;
      uint64_t PIO2_PIN14_SEC_MASK:1;
      uint64_t PIO2_PIN15_SEC_MASK:1;
      uint64_t PIO2_PIN16_SEC_MASK:1;
      uint64_t PIO2_PIN17_SEC_MASK:1;
      uint64_t PIO2_PIN18_SEC_MASK:1;
      uint64_t PIO2_PIN19_SEC_MASK:1;
      uint64_t PIO2_PIN20_SEC_MASK:1;
      uint64_t PIO2_PIN21_SEC_MASK:1;
      uint64_t PIO2_PIN22_SEC_MASK:1;
      uint64_t PIO2_PIN23_SEC_MASK:1;
      uint64_t PIO2_PIN24_SEC_MASK:1;
      uint64_t PIO2_PIN25_SEC_MASK:1;
      uint64_t PIO2_PIN26_SEC_MASK:1;
      uint64_t PIO2_PIN27_SEC_MASK:1;
      uint64_t PIO2_PIN28_SEC_MASK:1;
      uint64_t PIO2_PIN29_SEC_MASK:1;
      uint64_t PIO2_PIN30_SEC_MASK:1;
      uint64_t PIO2_PIN31_SEC_MASK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEC_GPIO_MASK2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PIO3_PIN0_SEC_MASK:1;
      uint64_t PIO3_PIN1_SEC_MASK:1;
      uint64_t PIO3_PIN2_SEC_MASK:1;
      uint64_t PIO3_PIN3_SEC_MASK:1;
      uint64_t PIO3_PIN4_SEC_MASK:1;
      uint64_t PIO3_PIN5_SEC_MASK:1;
      uint64_t PIO3_PIN6_SEC_MASK:1;
      uint64_t PIO3_PIN7_SEC_MASK:1;
      uint64_t PIO3_PIN8_SEC_MASK:1;
      uint64_t PIO3_PIN9_SEC_MASK:1;
      uint64_t PIO3_PIN10_SEC_MASK:1;
      uint64_t PIO3_PIN11_SEC_MASK:1;
      uint64_t PIO3_PIN12_SEC_MASK:1;
      uint64_t PIO3_PIN13_SEC_MASK:1;
      uint64_t PIO3_PIN14_SEC_MASK:1;
      uint64_t PIO3_PIN15_SEC_MASK:1;
      uint64_t PIO3_PIN16_SEC_MASK:1;
      uint64_t PIO3_PIN17_SEC_MASK:1;
      uint64_t PIO3_PIN18_SEC_MASK:1;
      uint64_t PIO3_PIN19_SEC_MASK:1;
      uint64_t PIO3_PIN20_SEC_MASK:1;
      uint64_t PIO3_PIN21_SEC_MASK:1;
      uint64_t PIO3_PIN22_SEC_MASK:1;
      uint64_t PIO3_PIN23_SEC_MASK:1;
      uint64_t PIO3_PIN24_SEC_MASK:1;
      uint64_t PIO3_PIN25_SEC_MASK:1;
      uint64_t PIO3_PIN26_SEC_MASK:1;
      uint64_t PIO3_PIN27_SEC_MASK:1;
      uint64_t PIO3_PIN28_SEC_MASK:1;
      uint64_t PIO3_PIN29_SEC_MASK:1;
      uint64_t PIO3_PIN30_SEC_MASK:1;
      uint64_t PIO3_PIN31_SEC_MASK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEC_GPIO_MASK3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PIO4_PIN0_SEC_MASK:1;
      uint64_t PIO4_PIN1_SEC_MASK:1;
      uint64_t PIO4_PIN2_SEC_MASK:1;
      uint64_t PIO4_PIN3_SEC_MASK:1;
      uint64_t PIO4_PIN4_SEC_MASK:1;
      uint64_t PIO4_PIN5_SEC_MASK:1;
      uint64_t PIO4_PIN6_SEC_MASK:1;
      uint64_t PIO4_PIN7_SEC_MASK:1;
      uint64_t PIO4_PIN8_SEC_MASK:1;
      uint64_t PIO4_PIN9_SEC_MASK:1;
      uint64_t PIO4_PIN10_SEC_MASK:1;
      uint64_t PIO4_PIN11_SEC_MASK:1;
      uint64_t PIO4_PIN12_SEC_MASK:1;
      uint64_t PIO4_PIN13_SEC_MASK:1;
      uint64_t PIO4_PIN14_SEC_MASK:1;
      uint64_t PIO4_PIN15_SEC_MASK:1;
      uint64_t PIO4_PIN16_SEC_MASK:1;
      uint64_t PIO4_PIN17_SEC_MASK:1;
      uint64_t PIO4_PIN18_SEC_MASK:1;
      uint64_t PIO4_PIN19_SEC_MASK:1;
      uint64_t PIO4_PIN20_SEC_MASK:1;
      uint64_t PIO4_PIN21_SEC_MASK:1;
      uint64_t PIO4_PIN22_SEC_MASK:1;
      uint64_t PIO4_PIN23_SEC_MASK:1;
      uint64_t PIO4_PIN24_SEC_MASK:1;
      uint64_t PIO4_PIN25_SEC_MASK:1;
      uint64_t PIO4_PIN26_SEC_MASK:1;
      uint64_t PIO4_PIN27_SEC_MASK:1;
      uint64_t PIO4_PIN28_SEC_MASK:1;
      uint64_t PIO4_PIN29_SEC_MASK:1;
      uint64_t PIO4_PIN30_SEC_MASK:1;
      uint64_t PIO4_PIN31_SEC_MASK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEC_GPIO_MASK4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PIO5_PIN0_SEC_MASK:1;
      uint64_t PIO5_PIN1_SEC_MASK:1;
      uint64_t PIO5_PIN2_SEC_MASK:1;
      uint64_t PIO5_PIN3_SEC_MASK:1;
      uint64_t PIO5_PIN4_SEC_MASK:1;
      uint64_t PIO5_PIN5_SEC_MASK:1;
      uint64_t PIO5_PIN6_SEC_MASK:1;
      uint64_t PIO5_PIN7_SEC_MASK:1;
      uint64_t PIO5_PIN8_SEC_MASK:1;
      uint64_t PIO5_PIN9_SEC_MASK:1;
      uint64_t PIO5_PIN10_SEC_MASK:1;
      uint64_t PIO5_PIN11_SEC_MASK:1;
      uint64_t PIO5_PIN12_SEC_MASK:1;
      uint64_t PIO5_PIN13_SEC_MASK:1;
      uint64_t PIO5_PIN14_SEC_MASK:1;
      uint64_t PIO5_PIN15_SEC_MASK:1;
      uint64_t PIO5_PIN16_SEC_MASK:1;
      uint64_t PIO5_PIN17_SEC_MASK:1;
      uint64_t PIO5_PIN18_SEC_MASK:1;
      uint64_t PIO5_PIN19_SEC_MASK:1;
      uint64_t PIO5_PIN20_SEC_MASK:1;
      uint64_t PIO5_PIN21_SEC_MASK:1;
      uint64_t PIO5_PIN22_SEC_MASK:1;
      uint64_t PIO5_PIN23_SEC_MASK:1;
      uint64_t PIO5_PIN24_SEC_MASK:1;
      uint64_t PIO5_PIN25_SEC_MASK:1;
      uint64_t PIO5_PIN26_SEC_MASK:1;
      uint64_t PIO5_PIN27_SEC_MASK:1;
      uint64_t PIO5_PIN28_SEC_MASK:1;
      uint64_t PIO5_PIN29_SEC_MASK:1;
      uint64_t PIO5_PIN30_SEC_MASK:1;
      uint64_t PIO5_PIN31_SEC_MASK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEC_GPIO_MASK5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PIO6_PIN0_SEC_MASK:1;
      uint64_t PIO6_PIN1_SEC_MASK:1;
      uint64_t PIO6_PIN2_SEC_MASK:1;
      uint64_t PIO6_PIN3_SEC_MASK:1;
      uint64_t PIO6_PIN4_SEC_MASK:1;
      uint64_t PIO6_PIN5_SEC_MASK:1;
      uint64_t PIO6_PIN6_SEC_MASK:1;
      uint64_t PIO6_PIN7_SEC_MASK:1;
      uint64_t PIO6_PIN8_SEC_MASK:1;
      uint64_t PIO6_PIN9_SEC_MASK:1;
      uint64_t PIO6_PIN10_SEC_MASK:1;
      uint64_t PIO6_PIN11_SEC_MASK:1;
      uint64_t PIO6_PIN12_SEC_MASK:1;
      uint64_t PIO6_PIN13_SEC_MASK:1;
      uint64_t PIO6_PIN14_SEC_MASK:1;
      uint64_t PIO6_PIN15_SEC_MASK:1;
      uint64_t PIO6_PIN16_SEC_MASK:1;
      uint64_t PIO6_PIN17_SEC_MASK:1;
      uint64_t PIO6_PIN18_SEC_MASK:1;
      uint64_t PIO6_PIN19_SEC_MASK:1;
      uint64_t PIO6_PIN20_SEC_MASK:1;
      uint64_t PIO6_PIN21_SEC_MASK:1;
      uint64_t PIO6_PIN22_SEC_MASK:1;
      uint64_t PIO6_PIN23_SEC_MASK:1;
      uint64_t PIO6_PIN24_SEC_MASK:1;
      uint64_t PIO6_PIN25_SEC_MASK:1;
      uint64_t PIO6_PIN26_SEC_MASK:1;
      uint64_t PIO6_PIN27_SEC_MASK:1;
      uint64_t PIO6_PIN28_SEC_MASK:1;
      uint64_t PIO6_PIN29_SEC_MASK:1;
      uint64_t PIO6_PIN30_SEC_MASK:1;
      uint64_t PIO6_PIN31_SEC_MASK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEC_GPIO_MASK6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PIO7_PIN0_SEC_MASK:1;
      uint64_t PIO7_PIN1_SEC_MASK:1;
      uint64_t PIO7_PIN2_SEC_MASK:1;
      uint64_t PIO7_PIN3_SEC_MASK:1;
      uint64_t PIO7_PIN4_SEC_MASK:1;
      uint64_t PIO7_PIN5_SEC_MASK:1;
      uint64_t PIO7_PIN6_SEC_MASK:1;
      uint64_t PIO7_PIN7_SEC_MASK:1;
      uint64_t PIO7_PIN8_SEC_MASK:1;
      uint64_t PIO7_PIN9_SEC_MASK:1;
      uint64_t PIO7_PIN10_SEC_MASK:1;
      uint64_t PIO7_PIN11_SEC_MASK:1;
      uint64_t PIO7_PIN12_SEC_MASK:1;
      uint64_t PIO7_PIN13_SEC_MASK:1;
      uint64_t PIO7_PIN14_SEC_MASK:1;
      uint64_t PIO7_PIN15_SEC_MASK:1;
      uint64_t PIO7_PIN16_SEC_MASK:1;
      uint64_t PIO7_PIN17_SEC_MASK:1;
      uint64_t PIO7_PIN18_SEC_MASK:1;
      uint64_t PIO7_PIN19_SEC_MASK:1;
      uint64_t PIO7_PIN20_SEC_MASK:1;
      uint64_t PIO7_PIN21_SEC_MASK:1;
      uint64_t PIO7_PIN22_SEC_MASK:1;
      uint64_t PIO7_PIN23_SEC_MASK:1;
      uint64_t PIO7_PIN24_SEC_MASK:1;
      uint64_t PIO7_PIN25_SEC_MASK:1;
      uint64_t PIO7_PIN26_SEC_MASK:1;
      uint64_t PIO7_PIN27_SEC_MASK:1;
      uint64_t PIO7_PIN28_SEC_MASK:1;
      uint64_t PIO7_PIN29_SEC_MASK:1;
      uint64_t PIO7_PIN30_SEC_MASK:1;
      uint64_t PIO7_PIN31_SEC_MASK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEC_GPIO_MASK7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:5;
      uint64_t DSP_INTR5_SEC_MASK:1;
      uint64_t DSP_INTR6_SEC_MASK:1;
      uint64_t DSP_INTR7_SEC_MASK:1;
      uint64_t DSP_INTR8_SEC_MASK:1;
      uint64_t DSP_INTR9_SEC_MASK:1;
      uint64_t DSP_INTR10_SEC_MASK:1;
      uint64_t DSP_INTR11_SEC_MASK:1;
      uint64_t DSP_INTR12_SEC_MASK:1;
      uint64_t DSP_INTR13_SEC_MASK:1;
      uint64_t DSP_INTR14_SEC_MASK:1;
      uint64_t DSP_INTR15_SEC_MASK:1;
      uint64_t DSP_INTR16_SEC_MASK:1;
      uint64_t DSP_INTR17_SEC_MASK:1;
      uint64_t DSP_INTR18_SEC_MASK:1;
      uint64_t DSP_INTR19_SEC_MASK:1;
      uint64_t DSP_INTR20_SEC_MASK:1;
      uint64_t DSP_INTR21_SEC_MASK:1;
      uint64_t DSP_INTR22_SEC_MASK:1;
      uint64_t DSP_INTR23_SEC_MASK:1;
      uint64_t DSP_INTR24_SEC_MASK:1;
      uint64_t DSP_INTR25_SEC_MASK:1;
      uint64_t DSP_INTR26_SEC_MASK:1;
      uint64_t DSP_INTR27_SEC_MASK:1;
      uint64_t DSP_INTR28_SEC_MASK:1;
      uint64_t DSP_INTR29_SEC_MASK:1;
      uint64_t DSP_INTR30_SEC_MASK:1;
      uint64_t DSP_INTR31_SEC_MASK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEC_DSP_INT_MASK;

  uint8_t res27[24];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEC_GPIO_MASK0_LOCK:2;
      uint64_t SEC_GPIO_MASK1_LOCK:2;
      uint64_t SEC_GPIO_MASK2_LOCK:2;
      uint64_t SEC_GPIO_MASK3_LOCK:2;
      uint64_t SEC_GPIO_MASK4_LOCK:2;
      uint64_t SEC_GPIO_MASK5_LOCK:2;
      uint64_t SEC_GPIO_MASK6_LOCK:2;
      uint64_t SEC_GPIO_MASK7_LOCK:2;
      uint64_t SEC_DSP_INT_LOCK:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEC_MASK_LOCK;

  uint8_t res28[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t POWERQUAD_SEC:2;
      uint64_t DSP_SEC:2;
      uint64_t DMA0_SEC:2;
      uint64_t DMA1_SEC:2;
      uint64_t SDIO0_SEC:2;
      uint64_t SDIO1_SEC:2;
      uint64_t reservedSpace1:14;
      uint64_t MASTER_SEC_LEVEL_LOCK:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MASTER_SEC_LEVEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t POWERQUAD_SEC:2;
      uint64_t DSP_SEC:2;
      uint64_t DMA0_SEC:2;
      uint64_t DMA1_SEC:2;
      uint64_t SDIO0_SEC:2;
      uint64_t SDIO1_SEC:2;
      uint64_t reservedSpace1:14;
      uint64_t MASTER_SEC_LEVEL_ANTI_POLE_LOCK:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MASTER_SEC_LEVEL_ANTI_POL;

  uint8_t res29[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCK_NS_VTOR:2;
      uint64_t LOCK_NS_MPU:2;
      uint64_t LOCK_S_VTOR:2;
      uint64_t LOCK_S_MPU:2;
      uint64_t LOCK_SAU:2;
      uint64_t reservedSpace0:20;
      uint64_t CM33_LOCK_REG_LOCK:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CM33_LOCK_REG;

