iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/IMXRT685_RAM_GCC/targetInit/iMXRT685_sfr.h
  uint8_t res30[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WRITE_LOCK:2;
      uint64_t ENABLE_SECURE_CHECKING:2;
      uint64_t ENABLE_S_PRIV_CHECK:2;
      uint64_t ENABLE_NS_PRIV_CHECK:2;
      uint64_t DISABLE_VIOLATION_ABORT:2;
      uint64_t DISABLE_SIMPLE_MASTER_STRICT_MODE:2;
      uint64_t DISABLE_SMART_MASTER_STRICT_MODE:2;
      uint64_t IDAU_ALL_NS:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MISC_CTRL_DP_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WRITE_LOCK:2;
      uint64_t ENABLE_SECURE_CHECKING:2;
      uint64_t ENABLE_S_PRIV_CHECK:2;
      uint64_t ENABLE_NS_PRIV_CHECK:2;
      uint64_t DISABLE_VIOLATION_ABORT:2;
      uint64_t DISABLE_SIMPLE_MASTER_STRICT_MODE:2;
      uint64_t DISABLE_SMART_MASTER_STRICT_MODE:2;
      uint64_t IDAU_ALL_NS:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MISC_CTRL_REG;

};

#define AHB_SECURE_CTRL (*(volatile struct AHB_SECURE_CTRL_tag *) 0x40148010)

struct POWERQUAD_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t outbase:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OUTBASE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t out_formatint:2;
      uint64_t reservedSpace0:2;
      uint64_t out_formatext:2;
      uint64_t reservedSpace1:2;
      uint64_t out_scaler:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OUTFORMAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t tmpbase:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TMPBASE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t tmp_formatint:2;
      uint64_t reservedSpace0:2;
      uint64_t tmp_formatext:2;
      uint64_t reservedSpace1:2;
      uint64_t tmp_scaler:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TMPFORMAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t inabase:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INABASE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ina_formatint:2;
      uint64_t reservedSpace0:2;
      uint64_t ina_formatext:2;
      uint64_t reservedSpace1:2;
      uint64_t ina_scaler:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INAFORMAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t inbbase:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INBBASE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t inb_formatint:2;
      uint64_t reservedSpace0:2;
      uint64_t inb_formatext:2;
      uint64_t reservedSpace1:2;
      uint64_t inb_scaler:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INBFORMAT;

  uint8_t res0[224];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t decode_opcode:4;
      uint64_t decode_machine:4;
      uint64_t reservedSpace0:23;
      uint64_t inst_busy:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CONTROL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t inst_length:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LENGTH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t cppre_in:8;
      uint64_t cppre_out:8;
      uint64_t cppre_sat:1;
      uint64_t cppre_sat8:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPPRE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t inst_misc:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MISC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t cursory:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CURSORY;

  uint8_t res1[108];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t cordic_x:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CORDIC_X;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t cordic_y:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CORDIC_Y;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t cordic_z:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CORDIC_Z;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OVERFLOW:1;
      uint64_t NAN:1;
      uint64_t FIXEDOVERFLOW:1;
      uint64_t UNDERFLOW:1;
      uint64_t BUSERROR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERRSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t intr_oflow:1;
      uint64_t intr_nan:1;
      uint64_t intr_fixed:1;
      uint64_t intr_uflow:1;
      uint64_t intr_berr:1;
      uint64_t reservedSpace0:2;
      uint64_t intr_comp:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTREN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t event_oflow:1;
      uint64_t event_nan:1;
      uint64_t event_fixed:1;
      uint64_t event_uflow:1;
      uint64_t event_berr:1;
      uint64_t reservedSpace0:2;
      uint64_t event_comp:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EVENTEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t intr_stat:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTRSTAT;

  uint8_t res2[100];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t gpreg:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) gpreg_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t gpreg:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) gpreg_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t gpreg:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) gpreg_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t gpreg:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) gpreg_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t gpreg:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) gpreg_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t gpreg:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) gpreg_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t gpreg:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) gpreg_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t gpreg:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) gpreg_7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t gpreg:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) gpreg_8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t gpreg:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) gpreg_9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t gpreg:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) gpreg_10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t gpreg:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) gpreg_11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t gpreg:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) gpreg_12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t gpreg:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) gpreg_13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t gpreg:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) gpreg_14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t gpreg:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) gpreg_15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t compreg:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) compreg_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t compreg:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) compreg_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t compreg:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) compreg_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t compreg:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) compreg_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t compreg:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) compreg_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t compreg:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) compreg_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t compreg:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) compreg_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t compreg:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) compreg_7;

