iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/IMXRT685_RAM_GCC/targetInit/iMXRT685_sfr.h
};

#define POWERQUAD (*(volatile struct POWERQUAD_tag *) 0x40150000)

struct CASPER_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t ABBPAIR:1;
      uint64_t reservedSpace0:1;
      uint64_t ABOFF:1;
      uint64_t reservedSpace1:13;
      uint64_t CDBPAIR:1;
      uint64_t reservedSpace2:1;
      uint64_t CDOFF:11;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ITER:8;
      uint64_t MODE:8;
      uint64_t RESBPAIR:1;
      uint64_t reservedSpace0:1;
      uint64_t RESOFF:11;
      uint64_t reservedSpace1:1;
      uint64_t CSKIP:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:8;
      uint64_t reservedSpace0:8;
      uint64_t CTRLBPAIR:1;
      uint64_t reservedSpace1:1;
      uint64_t CTRLOFF:11;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LOADER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DONE:1;
      uint64_t reservedSpace0:3;
      uint64_t CARRY:1;
      uint64_t BUSY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DONE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTENSET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DONE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTENCLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DONE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTSTAT;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AREG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BREG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CREG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DREG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RES0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RES1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RES2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REG_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RES3;

  uint8_t res1[32];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MASK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REMASK;

  uint8_t res2[24];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCK:1;
      uint64_t reservedSpace0:3;
      uint64_t KEY:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LOCK;

};

#define CASPER (*(volatile struct CASPER_tag *) 0x40151000)

struct HASHCRYPT_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t Mode:3;
      uint64_t reservedSpace0:1;
      uint64_t New_Hash:1;
      uint64_t reservedSpace1:3;
      uint64_t DMA_I:1;
      uint64_t DMA_O:1;
      uint64_t reservedSpace2:2;
      uint64_t HASHSWPB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WAITING:1;
      uint64_t DIGEST:1;
      uint64_t ERROR:1;
      uint64_t reservedSpace0:1;
      uint64_t NEEDKEY:1;
      uint64_t NEEDIV:1;
      uint64_t reservedSpace1:10;
      uint64_t ICBIDX:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WAITING:1;
      uint64_t DIGEST:1;
      uint64_t ERROR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTENSET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WAITING:1;
      uint64_t DIGEST:1;
      uint64_t ERROR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTENCLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MASTER:1;
      uint64_t reservedSpace0:15;
      uint64_t COUNT:11;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MEMCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BASE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MEMADDR;

  uint8_t res0[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INDATA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ALIAS_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ALIAS_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ALIAS_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ALIAS_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ALIAS_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ALIAS_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ALIAS_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIGEST:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIGEST0_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIGEST:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIGEST0_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIGEST:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIGEST0_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIGEST:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIGEST0_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIGEST:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIGEST0_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIGEST:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIGEST0_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIGEST:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIGEST0_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIGEST:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIGEST0_7;

  uint8_t res1[32];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MSW1ST_OUT:1;
      uint64_t SWAPKEY:1;
      uint64_t SWAPDAT:1;
      uint64_t MSW1ST:1;
      uint64_t AESMODE:2;
      uint64_t AESDECRYPT:1;
      uint64_t AESSECRET:1;
      uint64_t AESKEYSZ:2;
      uint64_t AESCTRPOS:3;
      uint64_t reservedSpace0:3;
      uint64_t STREAMLAST:1;
      uint64_t reservedSpace1:3;
      uint64_t ICBSZ:2;
      uint64_t ICBSTRM:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRYPTCFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DUAL:1;
      uint64_t DMA:1;
      uint64_t reservedSpace0:1;
      uint64_t AHB:1;
      uint64_t reservedSpace1:2;
      uint64_t AES:1;
      uint64_t AESKEY:1;
      uint64_t SECRET:1;
      uint64_t reservedSpace2:2;
      uint64_t ICB_bitfield:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CONFIG;

