iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/IMXRT685_RAM_GCC/targetInit/iMXRT685_sfr.h
  uint8_t res2[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SECLOCK:2;
      uint64_t reservedSpace0:2;
      uint64_t PATTERN:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LOCK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MASK_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MASK_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MASK_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MASK_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIGEST:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RELOAD_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIGEST:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RELOAD_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIGEST:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RELOAD_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIGEST:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RELOAD_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIGEST:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RELOAD_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIGEST:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RELOAD_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIGEST:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RELOAD_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIGEST:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RELOAD_7;

  uint8_t res3[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRNG_SEED:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRNG_SEED;

  uint8_t res4[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRNG_OUT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRNG_OUT;

};

#define HASHCRYPT (*(volatile struct HASHCRYPT_tag *) 0x40158000)

